niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/**
 ******************************************************************************
 * @file    stm32f030x6.h
 * @author  MCD Application Team
 * @brief   CMSIS Cortex-M0 Device Peripheral Access Layer Header File.
 *          This file contains all the peripheral register's definitions, bits
 *          definitions and memory mapping for STM32F0xx devices.
 *
 *          This file contains:
 *           - Data structures and the address mapping for all peripherals
 *           - Peripheral's registers declarations and bits definition
 *           - Macros to access peripheral�s registers hardware
 *
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 *modification, are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright
 *notice, this list of conditions and the following disclaimer in the
 *documentation and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 *ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 *LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 *SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 *INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 *CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 *ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 *POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/** @addtogroup CMSIS
 * @{
 */

/** @addtogroup stm32f030x6
 * @{
 */

#ifndef __STM32F030x6_H
#define __STM32F030x6_H

#ifdef __cplusplus
extern "C"
{
#endif /* __cplusplus */

/** @addtogroup Configuration_section_for_CMSIS
 * @{
 */
/**
 * @brief Configuration of the Cortex-M0 Processor and Core Peripherals
 */
#define __CM0_REV     0 /*!< Core Revision r0p0                            */
#define __MPU_PRESENT 0 /*!< STM32F0xx do not provide MPU                  */
#define __NVIC_PRIO_BITS                                 \
    2 /*!< STM32F0xx uses 2 Bits for the Priority Levels \
       */
#define __Vendor_SysTickConfig \
    0 /*!< Set to 1 if different SysTick Config is used */

    /**
     * @}
     */

    /** @addtogroup Peripheral_interrupt_number_definition
     * @{
     */

    /**
     * @brief STM32F0xx Interrupt Number Definition, according to the selected
     * device in @ref Library_configuration_section
     */

    /*!< Interrupt Number Definition */
    typedef enum
    {
        /******  Cortex-M0 Processor Exceptions Numbers
         * **************************************************************/
        NonMaskableInt_IRQn = -14, /*!< 2 Non Maskable Interrupt */
        HardFault_IRQn      = -13, /*!< 3 Cortex-M0 Hard Fault Interrupt      */
        SVC_IRQn            = -5,  /*!< 11 Cortex-M0 SV Call Interrupt  */
        PendSV_IRQn         = -2,  /*!< 14 Cortex-M0 Pend SV Interrupt  */
        SysTick_IRQn        = -1,  /*!< 15 Cortex-M0 System Tick Interrupt  */

        /******  STM32F0 specific Interrupt Numbers
         * ******************************************************************/
        WWDG_IRQn    = 0, /*!< Window WatchDog Interrupt */
        RTC_IRQn     = 2, /*!< RTC Interrupt through EXTI Lines 17, 19 and 20 */
        FLASH_IRQn   = 3, /*!< FLASH global Interrupt */
        RCC_IRQn     = 4, /*!< RCC global Interrupt */
        EXTI0_1_IRQn = 5, /*!< EXTI Line 0 and 1 Interrupt */
        EXTI2_3_IRQn = 6, /*!< EXTI Line 2 and 3 Interrupt */
        EXTI4_15_IRQn      = 7, /*!< EXTI Line 4 to 15 Interrupt */
        DMA1_Channel1_IRQn = 9, /*!< DMA1 Channel 1 Interrupt    */
        DMA1_Channel2_3_IRQn
        = 10, /*!< DMA1 Channel 2 and Channel 3 Interrupt */
        DMA1_Channel4_5_IRQn
        = 11,           /*!< DMA1 Channel 4 and Channel 5 Interrupt */
        ADC1_IRQn = 12, /*!< ADC1 Interrupt */
        TIM1_BRK_UP_TRG_COM_IRQn
        = 13, /*!< TIM1 Break, Update, Trigger and Commutation Interrupt */
        TIM1_CC_IRQn = 14, /*!< TIM1 Capture Compare Interrupt */
        TIM3_IRQn    = 16, /*!< TIM3 global Interrupt */
        TIM14_IRQn   = 19, /*!< TIM14 global Interrupt */
        TIM16_IRQn   = 21, /*!< TIM16 global Interrupt */
        TIM17_IRQn   = 22, /*!< TIM17 global Interrupt */
        I2C1_IRQn    = 23, /*!< I2C1 Event Interrupt */
        SPI1_IRQn    = 25, /*!< SPI1 global Interrupt */
        USART1_IRQn  = 27  /*!< USART1 global Interrupt  */
    } IRQn_Type;

    /**
     * @}
     */

#include "core_cm0_override.h" /* Cortex-M0 processor and core peripherals */
#include "system_stm32f0xx_override.h" /* STM32F0xx System Header */
#include <stdint.h>

    /** @addtogroup Peripheral_registers_structures
     * @{
     */

    /**
     * @brief Analog to Digital Converter
     */

    typedef struct
    {
        __IO uint32_t ISR; /*!< ADC interrupt and status register,   Address
                              offset: 0x00 */
        __IO uint32_t IER; /*!< ADC interrupt enable register,   Address offset:
                              0x04 */
        __IO uint32_t CR;  /*!< ADC control register,    Address offset: 0x08 */
        __IO uint32_t CFGR1;  /*!< ADC configuration register 1, Address
                                 offset: 0x0C */
        __IO uint32_t CFGR2;  /*!< ADC configuration register 2, Address
                                 offset: 0x10 */
        __IO uint32_t SMPR;   /*!< ADC sampling time register,  Address offset:
                                 0x14 */
        uint32_t RESERVED1;   /*!< Reserved,  0x18
                               */
        uint32_t RESERVED2;   /*!< Reserved,  0x1C
                               */
        __IO uint32_t TR;     /*!< ADC analog watchdog 1 threshold register,
                                 Address offset: 0x20 */
        uint32_t RESERVED3;   /*!< Reserved,  0x24
                               */
        __IO uint32_t CHSELR; /*!< ADC group regular sequencer register,
                                 Address offset: 0x28 */
        uint32_t      RESERVED4[5]; /*!< Reserved, 0x2C */
        __IO uint32_t DR; /*!< ADC group regular data register, Address
                             offset: 0x40 */
    } ADC_TypeDef;

    typedef struct
    {
        __IO uint32_t CCR; /*!< ADC common configuration register, Address
                              offset: ADC1 base address + 0x308 */
    } ADC_Common_TypeDef;

    /**
     * @brief CRC calculation unit
     */

    typedef struct
    {
        __IO uint32_t DR;  /*!< CRC Data register,   Address offset: 0x00 */
        __IO uint8_t  IDR; /*!< CRC Independent data register,   Address offset:
                              0x04 */
        uint8_t       RESERVED0; /*!< Reserved, 0x05 */
        uint16_t      RESERVED1; /*!< Reserved, 0x06 */
        __IO uint32_t CR; /*!< CRC Control register,   Address offset: 0x08 */
        uint32_t      RESERVED2; /*!< Reserved, 0x0C */
        __IO uint32_t INIT; /*!< Initial CRC value register, Address offset:
                               0x10 */
        __IO uint32_t RESERVED3; /*!< Reserved, 0x14 */
    } CRC_TypeDef;

    /**
     * @brief Debug MCU
     */

    typedef struct
    {
        __IO uint32_t IDCODE; /*!< MCU device ID code, Address offset: 0x00 */
        __IO uint32_t CR;     /*!< Debug MCU configuration register,     Address
                                 offset: 0x04 */
        __IO uint32_t APB1FZ; /*!< Debug MCU APB1 freeze register, Address
                                 offset: 0x08 */
        __IO uint32_t APB2FZ; /*!< Debug MCU APB2 freeze register, Address
                                 offset: 0x0C */
    } DBGMCU_TypeDef;

    /**
     * @brief DMA Controller
     */

    typedef struct
    {
        __IO uint32_t CCR;   /*!< DMA channel x configuration register        */
        __IO uint32_t CNDTR; /*!< DMA channel x number of data register       */
        __IO uint32_t CPAR;  /*!< DMA channel x peripheral address register   */
        __IO uint32_t CMAR;  /*!< DMA channel x memory address register       */
    } DMA_Channel_TypeDef;

    typedef struct
    {
        __IO uint32_t ISR;  /*!< DMA interrupt status register,  Address offset:
                               0x00 */
        __IO uint32_t IFCR; /*!< DMA interrupt flag clear register, Address
                               offset: 0x04 */
    } DMA_TypeDef;

    /**
     * @brief External Interrupt/Event Controller
     */

    typedef struct
    {
        __IO uint32_t IMR;  /*!<EXTI Interrupt mask register,   Address offset:
                               0x00 */
        __IO uint32_t EMR;  /*!<EXTI Event mask register,   Address offset: 0x04
                             */
        __IO uint32_t RTSR; /*!<EXTI Rising trigger selection register ,
                               Address offset: 0x08 */
        __IO uint32_t FTSR; /*!<EXTI Falling trigger selection register,
                               Address offset: 0x0C */
        __IO uint32_t SWIER; /*!<EXTI Software interrupt event register,
                                Address offset: 0x10 */
        __IO uint32_t PR; /*!<EXTI Pending register,    Address offset: 0x14 */
    } EXTI_TypeDef;

    /**
     * @brief FLASH Registers
     */
    typedef struct
    {
        __IO uint32_t ACR;  /*!<FLASH access control register,  Address offset:
                               0x00 */
        __IO uint32_t KEYR; /*!<FLASH key register, Address offset: 0x04 */
        __IO uint32_t OPTKEYR; /*!<FLASH OPT key register, Address offset:
                                  0x08 */
        __IO uint32_t SR; /*!<FLASH status register, Address offset: 0x0C */
        __IO uint32_t CR; /*!<FLASH control register, Address offset: 0x10 */
        __IO uint32_t AR; /*!<FLASH address register, Address offset: 0x14 */
        __IO uint32_t RESERVED; /*!< Reserved, 0x18 */
        __IO uint32_t OBR; /*!<FLASH option bytes register,      Address offset:
                              0x1C */
        __IO uint32_t WRPR; /*!<FLASH option bytes register,     Address offset:
                               0x20 */
    } FLASH_TypeDef;

    /**
     * @brief Option Bytes Registers
     */
    typedef struct
    {
        __IO uint16_t RDP;   /*!< FLASH option byte Read protection,   Address
                                offset: 0x00 */
        __IO uint16_t USER;  /*!< FLASH option byte user options,  Address
                                offset: 0x02 */
        __IO uint16_t DATA0; /*!< User data byte 0 (stored in FLASH_OBR[23:16]),
                                Address offset: 0x04 */
        __IO uint16_t DATA1; /*!< User data byte 1 (stored in FLASH_OBR[31:24]),
                                Address offset: 0x06 */
        __IO uint16_t WRP0;  /*!< FLASH option byte write protection 0,  Address
                                offset: 0x08 */
    } OB_TypeDef;

    /**
     * @brief General Purpose I/O
     */

    typedef struct
    {
        __IO uint32_t MODER;   /*!< GPIO port mode register,   Address offset:
                                  0x00 */
        __IO uint32_t OTYPER;  /*!< GPIO port output type register,  Address
                                  offset: 0x04 */
        __IO uint32_t OSPEEDR; /*!< GPIO port output speed register, Address
                                  offset: 0x08 */
        __IO uint32_t PUPDR;   /*!< GPIO port pull-up/pull-down register,
                                  Address offset: 0x0C     */
        __IO uint32_t IDR;  /*!< GPIO port input data register,  Address offset:
                               0x10 */
        __IO uint32_t ODR;  /*!< GPIO port output data register,  Address
                               offset: 0x14 */
        __IO uint32_t BSRR; /*!< GPIO port bit set/reset register,      Address
                               offset: 0x1A */
        __IO uint32_t LCKR; /*!< GPIO port configuration lock register,
                               Address offset: 0x1C      */
        __IO uint32_t AFR[2]; /*!< GPIO alternate function low register,
                                 Address offset: 0x20-0x24 */
        __IO uint32_t BRR; /*!< GPIO bit reset register,    Address offset: 0x28
                            */
    } GPIO_TypeDef;

    /**
     * @brief SysTem Configuration
     */

    typedef struct
    {
        __IO uint32_t CFGR1;     /*!< SYSCFG configuration register 1,  Address
                                    offset: 0x00 */
        uint32_t      RESERVED;  /*!< Reserved,       0x04 */
        __IO uint32_t EXTICR[4]; /*!< SYSCFG external interrupt configuration
                                    register,     Address offset: 0x14-0x08 */
        __IO uint32_t
            CFGR2; /*!< SYSCFG configuration register 2, Address offset: 0x18 */
    } SYSCFG_TypeDef;

    /**
     * @brief Inter-integrated Circuit Interface
     */

    typedef struct
    {
        __IO uint32_t CR1; /*!< I2C Control register 1, Address offset: 0x00 */
        __IO uint32_t CR2; /*!< I2C Control register 2,  Address offset: 0x04 */
        __IO uint32_t OAR1;     /*!< I2C Own address 1 register,        Address
                                   offset: 0x08 */
        __IO uint32_t OAR2;     /*!< I2C Own address 2 register,        Address
                                   offset: 0x0C */
        __IO uint32_t TIMINGR;  /*!< I2C Timing register,               Address
                                   offset: 0x10 */
        __IO uint32_t TIMEOUTR; /*!< I2C Timeout register,              Address
                                   offset: 0x14 */
        __IO uint32_t
            ISR; /*!< I2C Interrupt and status register, Address offset: 0x18 */
        __IO uint32_t
            ICR; /*!< I2C Interrupt clear register,      Address offset: 0x1C */
        __IO uint32_t PECR; /*!< I2C PEC register,                  Address
                               offset: 0x20 */
        __IO uint32_t RXDR; /*!< I2C Receive data register,         Address
                               offset: 0x24 */
        __IO uint32_t TXDR; /*!< I2C Transmit data register,        Address
                               offset: 0x28 */
    } I2C_TypeDef;

    /**
     * @brief Independent WATCHDOG
     */

    typedef struct
    {
        __IO uint32_t KR;  /*!< IWDG Key register,       Address offset: 0x00 */
        __IO uint32_t PR;  /*!< IWDG Prescaler register, Address offset: 0x04 */
        __IO uint32_t RLR; /*!< IWDG Reload register,    Address offset: 0x08 */
        __IO uint32_t SR;  /*!< IWDG Status register,    Address offset: 0x0C */
        __IO uint32_t
            WINR; /*!< IWDG Window register,    Address offset: 0x10 */
    } IWDG_TypeDef;

    /**
     * @brief Power Control
     */

    typedef struct
    {
        __IO uint32_t CR;  /*!< PWR power control register,  Address offset:
                              0x00 */
        __IO uint32_t CSR; /*!< PWR power control/status register, Address
                              offset: 0x04 */
    } PWR_TypeDef;

    /**
     * @brief Reset and Clock Control
     */

    typedef struct
    {
        __IO uint32_t
            CR; /*!< RCC clock control register, Address offset: 0x00 */
        __IO uint32_t CFGR; /*!< RCC clock configuration register,  Address
                               offset: 0x04 */
        __IO uint32_t
            CIR; /*!< RCC clock interrupt register,   Address offset: 0x08 */
        __IO uint32_t APB2RSTR; /*!< RCC APB2 peripheral reset register, Address
                                   offset: 0x0C */
        __IO uint32_t APB1RSTR; /*!< RCC APB1 peripheral reset register, Address
                                   offset: 0x10 */
        __IO uint32_t AHBENR;  /*!< RCC AHB peripheral clock register,   Address
                                  offset: 0x14 */
        __IO uint32_t APB2ENR; /*!< RCC APB2 peripheral clock enable register,
                                * Address offset: 0x18
                                */
        __IO uint32_t APB1ENR; /*!< RCC APB1 peripheral clock enable register,
                                * Address offset: 0x1C
                                */
        __IO uint32_t BDCR; /*!< RCC Backup domain control register,     Address
                               offset: 0x20 */
        __IO uint32_t CSR;  /*!< RCC clock control & status register,  Address
                               offset: 0x24 */
        __IO uint32_t AHBRSTR; /*!< RCC AHB peripheral reset register, Address
                                  offset: 0x28 */
        __IO uint32_t CFGR2; /*!< RCC clock configuration register 2,   Address
                                offset: 0x2C */
        __IO uint32_t CFGR3; /*!< RCC clock configuration register 3,   Address
                                offset: 0x30 */
        __IO uint32_t
            CR2; /*!< RCC clock control register 2, Address offset: 0x34 */
    } RCC_TypeDef;

    /**
     * @brief Real-Time Clock
     */
    typedef struct
    {
        __IO uint32_t TR; /*!< RTC time register,   Address   offset: 0x00 */
        __IO uint32_t DR; /*!< RTC date register,   Address   offset: 0x04 */
        __IO uint32_t CR; /*!< RTC control register,   Address   offset: 0x08 */
        __IO uint32_t ISR;  /*!< RTC initialization and status register, Address
                               offset: 0x0C */
        __IO uint32_t PRER; /*!< RTC prescaler register, Address offset: 0x10 */
        uint32_t      RESERVED1; /*!< Reserved, Address offset: 0x14 */
        uint32_t      RESERVED2; /*!< Reserved, Address offset: 0x18 */
        __IO uint32_t ALRMAR; /*!< RTC alarm A register, Address offset: 0x1C */
        uint32_t      RESERVED3; /*!< Reserved,   Address   offset: 0x20 */
        __IO uint32_t
            WPR; /*!< RTC write protection register, Address offset: 0x24 */
        __IO uint32_t SSR; /*!< RTC sub second register, Address offset: 0x28 */
        __IO uint32_t
            SHIFTR; /*!< RTC shift control register, Address offset: 0x2C */
        __IO uint32_t
            TSTR; /*!< RTC time stamp time register, Address offset: 0x30 */
        __IO uint32_t
            TSDR; /*!< RTC time stamp date register, Address offset: 0x34 */
        __IO uint32_t TSSSR; /*!< RTC time-stamp sub second register, Address
                                offset: 0x38 */
        __IO uint32_t
            CALR; /*!< RTC calibration register, Address offset: 0x3C */
        __IO uint32_t
            TAFCR;              /*!< RTC tamper and alternate function
                                   configuration register,  Address    offset: 0x40 */
        __IO uint32_t ALRMASSR; /*!< RTC alarm A sub second register, Address
                                   offset: 0x44 */
    } RTC_TypeDef;

    /**
     * @brief Serial Peripheral Interface
     */

    typedef struct
    {
        __IO uint32_t CR1; /*!< SPI Control register 1 (not used in I2S mode),
                              Address offset: 0x00 */
        __IO uint32_t CR2; /*!< SPI Control register 2, Address offset: 0x04 */
        __IO uint32_t SR;  /*!< SPI Status register,  Address offset: 0x08 */
        __IO uint32_t DR;  /*!< SPI data register,  Address offset: 0x0C */
        __IO uint32_t CRCPR;   /*!< SPI CRC polynomial register (not used in I2S
                                  mode), Address   offset: 0x10 */
        __IO uint32_t RXCRCR;  /*!< SPI Rx CRC register (not used in I2S mode),
                                  Address  offset: 0x14 */
        __IO uint32_t TXCRCR;  /*!< SPI Tx CRC register (not used in I2S mode),
                                  Address  offset: 0x18 */
        __IO uint32_t I2SCFGR; /*!< SPI_I2S configuration register, Address
                                  offset: 0x1C */
    } SPI_TypeDef;

    /**
     * @brief TIM
     */
    typedef struct
    {
        __IO uint32_t CR1;   /*!< TIM control register 1,              Address
                                offset: 0x00 */
        __IO uint32_t CR2;   /*!< TIM control register 2,              Address
                                offset: 0x04 */
        __IO uint32_t SMCR;  /*!< TIM slave Mode Control register,     Address
                                offset: 0x08 */
        __IO uint32_t DIER;  /*!< TIM DMA/interrupt enable register,   Address
                                offset: 0x0C */
        __IO uint32_t SR;    /*!< TIM status register,                 Address
                                offset: 0x10 */
        __IO uint32_t EGR;   /*!< TIM event generation register,       Address
                                offset: 0x14 */
        __IO uint32_t CCMR1; /*!< TIM capture/compare mode register 1, Address
                                offset: 0x18 */
        __IO uint32_t CCMR2; /*!< TIM capture/compare mode register 2, Address
                                offset: 0x1C */
        __IO uint32_t CCER;  /*!< TIM capture/compare enable register, Address
                                offset: 0x20 */
        __IO uint32_t CNT;   /*!< TIM counter register,                Address
                                offset: 0x24 */
        __IO uint32_t PSC;   /*!< TIM prescaler register,              Address
                                offset: 0x28 */
        __IO uint32_t ARR;   /*!< TIM auto-reload register,            Address
                                offset: 0x2C */
        __IO uint32_t RCR;   /*!< TIM  repetition counter register,   Address
                                offset: 0x30 */
        __IO uint32_t CCR1;  /*!< TIM capture/compare register 1,      Address
                                offset: 0x34 */
        __IO uint32_t CCR2;  /*!< TIM capture/compare register 2,      Address
                                offset: 0x38 */
        __IO uint32_t CCR3;  /*!< TIM capture/compare register 3,      Address
                                offset: 0x3C */
        __IO uint32_t CCR4;  /*!< TIM capture/compare register 4,      Address
                                offset: 0x40 */
        __IO uint32_t BDTR;  /*!< TIM break and dead-time register,  Address
                                offset: 0x44 */
        __IO uint32_t DCR;   /*!< TIM DMA control register,            Address
                                offset: 0x48 */
        __IO uint32_t DMAR;  /*!< TIM DMA address for full transfer register,
                                Address offset: 0x4C */
        __IO uint32_t OR;    /*!< TIM option register,                 Address
                                offset: 0x50 */
    } TIM_TypeDef;

    /**
     * @brief Universal Synchronous Asynchronous Receiver Transmitter
     */

