niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
    typedef struct
    {
        __IO uint32_t CR1;  /*!< USART Control register 1,  Address offset: 0x00
                             */
        __IO uint32_t CR2;  /*!< USART Control register 2,  Address offset: 0x04
                             */
        __IO uint32_t CR3;  /*!< USART Control register 3,  Address offset: 0x08
                             */
        __IO uint32_t BRR;  /*!< USART Baud rate register,  Address offset: 0x0C
                             */
        __IO uint32_t GTPR; /*!< USART Guard time and prescaler register,
                               Address offset: 0x10 */
        __IO uint32_t RTOR; /*!< USART Receiver Time Out register, Address
                               offset: 0x14 */
        __IO uint32_t RQR;  /*!< USART Request register,  Address offset: 0x18
                             */
        __IO uint32_t ISR;  /*!< USART Interrupt and status register,  Address
                               offset: 0x1C */
        __IO uint32_t ICR;  /*!< USART Interrupt flag Clear register,  Address
                               offset: 0x20 */
        __IO uint16_t RDR;  /*!< USART Receive Data register,  Address offset:
                               0x24 */
        uint16_t      RESERVED1; /*!< Reserved, 0x26 */
        __IO uint16_t TDR;  /*!< USART Transmit Data register,  Address offset:
                               0x28 */
        uint16_t RESERVED2; /*!< Reserved, 0x2A */
    } USART_TypeDef;

    /**
     * @brief Window WATCHDOG
     */
    typedef struct
    {
        __IO uint32_t
            CR; /*!< WWDG Control register,       Address offset: 0x00 */
        __IO uint32_t
            CFR; /*!< WWDG Configuration register, Address offset: 0x04 */
        __IO uint32_t
            SR; /*!< WWDG Status register,        Address offset: 0x08 */
    } WWDG_TypeDef;

    /**
     * @}
     */

    /** @addtogroup Peripheral_memory_map
     * @{
     */

#define FLASH_BASE \
    ((uint32_t)0x08000000U) /*!< FLASH base address in the alias region */
#define FLASH_BANK1_END \
    ((uint32_t)0x08007FFFU) /*!< FLASH END address of bank1 */
#define SRAM_BASE \
    ((uint32_t)0x20000000U) /*!< SRAM base address in the alias region */
#define PERIPH_BASE                                                          \
    ((uint32_t)0x40000000U) /*!< Peripheral base address in the alias region \
                             */

/*!< Peripheral memory map */
#define APBPERIPH_BASE  PERIPH_BASE
#define AHBPERIPH_BASE  (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE (PERIPH_BASE + 0x08000000)

/*!< APB peripherals */
#define TIM3_BASE   (APBPERIPH_BASE + 0x00000400)
#define TIM14_BASE  (APBPERIPH_BASE + 0x00002000)
#define RTC_BASE    (APBPERIPH_BASE + 0x00002800)
#define WWDG_BASE   (APBPERIPH_BASE + 0x00002C00)
#define IWDG_BASE   (APBPERIPH_BASE + 0x00003000)
#define I2C1_BASE   (APBPERIPH_BASE + 0x00005400)
#define PWR_BASE    (APBPERIPH_BASE + 0x00007000)
#define SYSCFG_BASE (APBPERIPH_BASE + 0x00010000)
#define EXTI_BASE   (APBPERIPH_BASE + 0x00010400)
#define ADC1_BASE   (APBPERIPH_BASE + 0x00012400)
#define ADC_BASE    (APBPERIPH_BASE + 0x00012708)
#define TIM1_BASE   (APBPERIPH_BASE + 0x00012C00)
#define SPI1_BASE   (APBPERIPH_BASE + 0x00013000)
#define USART1_BASE (APBPERIPH_BASE + 0x00013800)
#define TIM16_BASE  (APBPERIPH_BASE + 0x00014400)
#define TIM17_BASE  (APBPERIPH_BASE + 0x00014800)
#define DBGMCU_BASE (APBPERIPH_BASE + 0x00015800)

/*!< AHB peripherals */
#define DMA1_BASE          (AHBPERIPH_BASE + 0x00000000)
#define DMA1_Channel1_BASE (DMA1_BASE + 0x00000008)
#define DMA1_Channel2_BASE (DMA1_BASE + 0x0000001C)
#define DMA1_Channel3_BASE (DMA1_BASE + 0x00000030)
#define DMA1_Channel4_BASE (DMA1_BASE + 0x00000044)
#define DMA1_Channel5_BASE (DMA1_BASE + 0x00000058)

#define RCC_BASE (AHBPERIPH_BASE + 0x00001000)
#define FLASH_R_BASE \
    (AHBPERIPH_BASE + 0x00002000) /*!< FLASH registers base address */
#define OB_BASE                                                  \
    ((uint32_t)0x1FFFF800U) /*!< FLASH Option Bytes base address \
                             */
#define FLASHSIZE_BASE \
    ((uint32_t)0x1FFFF7CCU) /*!< FLASH Size register base address */
#define UID_BASE \
    ((uint32_t)0x1FFFF7ACU) /*!< Unique device ID register base address */
#define CRC_BASE (AHBPERIPH_BASE + 0x00003000)

/*!< AHB2 peripherals */
#define GPIOA_BASE (AHB2PERIPH_BASE + 0x00000000)
#define GPIOB_BASE (AHB2PERIPH_BASE + 0x00000400)
#define GPIOC_BASE (AHB2PERIPH_BASE + 0x00000800)
#define GPIOD_BASE (AHB2PERIPH_BASE + 0x00000C00)
#define GPIOF_BASE (AHB2PERIPH_BASE + 0x00001400)

    /**
     * @}
     */

    /** @addtogroup Peripheral_declaration
     * @{
     */

#define TIM3          ((TIM_TypeDef *)TIM3_BASE)
#define TIM14         ((TIM_TypeDef *)TIM14_BASE)
#define RTC           ((RTC_TypeDef *)RTC_BASE)
#define WWDG          ((WWDG_TypeDef *)WWDG_BASE)
#define IWDG          ((IWDG_TypeDef *)IWDG_BASE)
#define I2C1          ((I2C_TypeDef *)I2C1_BASE)
#define PWR           ((PWR_TypeDef *)PWR_BASE)
#define SYSCFG        ((SYSCFG_TypeDef *)SYSCFG_BASE)
#define EXTI          ((EXTI_TypeDef *)EXTI_BASE)
#define ADC1          ((ADC_TypeDef *)ADC1_BASE)
#define ADC1_COMMON   ((ADC_Common_TypeDef *)ADC_BASE)
#define ADC           ((ADC_Common_TypeDef *)ADC_BASE) /* Kept for legacy purpose */
#define TIM1          ((TIM_TypeDef *)TIM1_BASE)
#define SPI1          ((SPI_TypeDef *)SPI1_BASE)
#define USART1        ((USART_TypeDef *)USART1_BASE)
#define TIM16         ((TIM_TypeDef *)TIM16_BASE)
#define TIM17         ((TIM_TypeDef *)TIM17_BASE)
#define DBGMCU        ((DBGMCU_TypeDef *)DBGMCU_BASE)
#define DMA1          ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1 ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2 ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3 ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4 ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5 ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define FLASH         ((FLASH_TypeDef *)FLASH_R_BASE)
#define OB            ((OB_TypeDef *)OB_BASE)
#define RCC           ((RCC_TypeDef *)RCC_BASE)
#define CRC           ((CRC_TypeDef *)CRC_BASE)
#define GPIOA         ((GPIO_TypeDef *)GPIOA_BASE)
#define GPIOB         ((GPIO_TypeDef *)GPIOB_BASE)
#define GPIOC         ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD         ((GPIO_TypeDef *)GPIOD_BASE)
#define GPIOF         ((GPIO_TypeDef *)GPIOF_BASE)
/**
 * @}
 */

/** @addtogroup Exported_constants
 * @{
 */

/** @addtogroup Peripheral_Registers_Bits_Definition
 * @{
 */

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                      Analog to Digital Converter (ADC)                     */
/*                                                                            */
/******************************************************************************/

