niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/* Legacy defines */
#define ADC_CFGR1_AUTDLY  (ADC_CFGR1_WAIT)
#define ADC_CFGR1_AWDSGL  (ADC_CFGR1_AWD1SGL)
#define ADC_CFGR1_AWDEN   (ADC_CFGR1_AWD1EN)
#define ADC_CFGR1_AWDCH   (ADC_CFGR1_AWD1CH)
#define ADC_CFGR1_AWDCH_0 (ADC_CFGR1_AWD1CH_0)
#define ADC_CFGR1_AWDCH_1 (ADC_CFGR1_AWD1CH_1)
#define ADC_CFGR1_AWDCH_2 (ADC_CFGR1_AWD1CH_2)
#define ADC_CFGR1_AWDCH_3 (ADC_CFGR1_AWD1CH_3)
#define ADC_CFGR1_AWDCH_4 (ADC_CFGR1_AWD1CH_4)

/*******************  Bits definition for ADC_CFGR2 register  *****************/
#define ADC_CFGR2_CKMODE_Pos (30U)
#define ADC_CFGR2_CKMODE_Msk (0x3U << ADC_CFGR2_CKMODE_Pos) /*!< 0xC0000000 */
#define ADC_CFGR2_CKMODE                                                     \
    ADC_CFGR2_CKMODE_Msk /*!< ADC clock source and prescaler (prescaler only \
                            for clock source synchronous) */
#define ADC_CFGR2_CKMODE_1 (0x2U << ADC_CFGR2_CKMODE_Pos) /*!< 0x80000000 */
#define ADC_CFGR2_CKMODE_0 (0x1U << ADC_CFGR2_CKMODE_Pos) /*!< 0x40000000 */

/* Legacy defines */
#define ADC_CFGR2_JITOFFDIV4 \
    (ADC_CFGR2_CKMODE_1) /*!< ADC clocked by PCLK div4 */
#define ADC_CFGR2_JITOFFDIV2 \
    (ADC_CFGR2_CKMODE_0) /*!< ADC clocked by PCLK div2 */

/******************  Bit definition for ADC_SMPR register  ********************/
#define ADC_SMPR_SMP_Pos (0U)
#define ADC_SMPR_SMP_Msk (0x7U << ADC_SMPR_SMP_Pos) /*!< 0x00000007 */
#define ADC_SMPR_SMP \
    ADC_SMPR_SMP_Msk /*!< ADC group of channels sampling time 2 */
#define ADC_SMPR_SMP_0 (0x1U << ADC_SMPR_SMP_Pos) /*!< 0x00000001 */
#define ADC_SMPR_SMP_1 (0x2U << ADC_SMPR_SMP_Pos) /*!< 0x00000002 */
#define ADC_SMPR_SMP_2 (0x4U << ADC_SMPR_SMP_Pos) /*!< 0x00000004 */

/* Legacy defines */
#define ADC_SMPR1_SMPR \
    (ADC_SMPR_SMP) /*!< SMP[2:0] bits (Sampling time selection) */
#define ADC_SMPR1_SMPR_0 (ADC_SMPR_SMP_0) /*!< bit 0 */
#define ADC_SMPR1_SMPR_1 (ADC_SMPR_SMP_1) /*!< bit 1 */
#define ADC_SMPR1_SMPR_2 (ADC_SMPR_SMP_2) /*!< bit 2 */

/*******************  Bit definition for ADC_TR register  ********************/
#define ADC_TR1_LT1_Pos (0U)
#define ADC_TR1_LT1_Msk (0xFFFU << ADC_TR1_LT1_Pos) /*!< 0x00000FFF */
#define ADC_TR1_LT1                                          \
    ADC_TR1_LT1_Msk /*!< ADC analog watchdog 1 threshold low \
                     */
#define ADC_TR1_LT1_0  (0x001U << ADC_TR1_LT1_Pos) /*!< 0x00000001 */
#define ADC_TR1_LT1_1  (0x002U << ADC_TR1_LT1_Pos) /*!< 0x00000002 */
#define ADC_TR1_LT1_2  (0x004U << ADC_TR1_LT1_Pos) /*!< 0x00000004 */
#define ADC_TR1_LT1_3  (0x008U << ADC_TR1_LT1_Pos) /*!< 0x00000008 */
#define ADC_TR1_LT1_4  (0x010U << ADC_TR1_LT1_Pos) /*!< 0x00000010 */
#define ADC_TR1_LT1_5  (0x020U << ADC_TR1_LT1_Pos) /*!< 0x00000020 */
#define ADC_TR1_LT1_6  (0x040U << ADC_TR1_LT1_Pos) /*!< 0x00000040 */
#define ADC_TR1_LT1_7  (0x080U << ADC_TR1_LT1_Pos) /*!< 0x00000080 */
#define ADC_TR1_LT1_8  (0x100U << ADC_TR1_LT1_Pos) /*!< 0x00000100 */
#define ADC_TR1_LT1_9  (0x200U << ADC_TR1_LT1_Pos) /*!< 0x00000200 */
#define ADC_TR1_LT1_10 (0x400U << ADC_TR1_LT1_Pos) /*!< 0x00000400 */
#define ADC_TR1_LT1_11 (0x800U << ADC_TR1_LT1_Pos) /*!< 0x00000800 */

#define ADC_TR1_HT1_Pos (16U)
#define ADC_TR1_HT1_Msk (0xFFFU << ADC_TR1_HT1_Pos) /*!< 0x0FFF0000 */
#define ADC_TR1_HT1                                           \
    ADC_TR1_HT1_Msk /*!< ADC Analog watchdog 1 threshold high \
                     */
#define ADC_TR1_HT1_0  (0x001U << ADC_TR1_HT1_Pos) /*!< 0x00010000 */
#define ADC_TR1_HT1_1  (0x002U << ADC_TR1_HT1_Pos) /*!< 0x00020000 */
#define ADC_TR1_HT1_2  (0x004U << ADC_TR1_HT1_Pos) /*!< 0x00040000 */
#define ADC_TR1_HT1_3  (0x008U << ADC_TR1_HT1_Pos) /*!< 0x00080000 */
#define ADC_TR1_HT1_4  (0x010U << ADC_TR1_HT1_Pos) /*!< 0x00100000 */
#define ADC_TR1_HT1_5  (0x020U << ADC_TR1_HT1_Pos) /*!< 0x00200000 */
#define ADC_TR1_HT1_6  (0x040U << ADC_TR1_HT1_Pos) /*!< 0x00400000 */
#define ADC_TR1_HT1_7  (0x080U << ADC_TR1_HT1_Pos) /*!< 0x00800000 */
#define ADC_TR1_HT1_8  (0x100U << ADC_TR1_HT1_Pos) /*!< 0x01000000 */
#define ADC_TR1_HT1_9  (0x200U << ADC_TR1_HT1_Pos) /*!< 0x02000000 */
#define ADC_TR1_HT1_10 (0x400U << ADC_TR1_HT1_Pos) /*!< 0x04000000 */
#define ADC_TR1_HT1_11 (0x800U << ADC_TR1_HT1_Pos) /*!< 0x08000000 */

/* Legacy defines */
#define ADC_TR_HT  (ADC_TR1_HT1)
#define ADC_TR_LT  (ADC_TR1_LT1)
#define ADC_HTR_HT (ADC_TR1_HT1)
#define ADC_LTR_LT (ADC_TR1_LT1)

/******************  Bit definition for ADC_CHSELR register  ******************/
#define ADC_CHSELR_CHSEL_Pos (0U)
#define ADC_CHSELR_CHSEL_Msk \
    (0x7FFFFU << ADC_CHSELR_CHSEL_Pos) /*!< 0x0007FFFF */
#define ADC_CHSELR_CHSEL                                                      \
    ADC_CHSELR_CHSEL_Msk /*!< ADC group regular sequencer channels, available \
                            when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL18_Pos (18U)
#define ADC_CHSELR_CHSEL18_Msk \
    (0x1U << ADC_CHSELR_CHSEL18_Pos) /*!< 0x00040000 */
#define ADC_CHSELR_CHSEL18                                              \
    ADC_CHSELR_CHSEL18_Msk /*!< ADC group regular sequencer channel 18, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL17_Pos (17U)
#define ADC_CHSELR_CHSEL17_Msk \
    (0x1U << ADC_CHSELR_CHSEL17_Pos) /*!< 0x00020000 */
#define ADC_CHSELR_CHSEL17                                              \
    ADC_CHSELR_CHSEL17_Msk /*!< ADC group regular sequencer channel 17, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL16_Pos (16U)
#define ADC_CHSELR_CHSEL16_Msk \
    (0x1U << ADC_CHSELR_CHSEL16_Pos) /*!< 0x00010000 */
#define ADC_CHSELR_CHSEL16                                              \
    ADC_CHSELR_CHSEL16_Msk /*!< ADC group regular sequencer channel 16, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL15_Pos (15U)
#define ADC_CHSELR_CHSEL15_Msk \
    (0x1U << ADC_CHSELR_CHSEL15_Pos) /*!< 0x00008000 */
#define ADC_CHSELR_CHSEL15                                              \
    ADC_CHSELR_CHSEL15_Msk /*!< ADC group regular sequencer channel 15, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL14_Pos (14U)
#define ADC_CHSELR_CHSEL14_Msk \
    (0x1U << ADC_CHSELR_CHSEL14_Pos) /*!< 0x00004000 */
#define ADC_CHSELR_CHSEL14                                              \
    ADC_CHSELR_CHSEL14_Msk /*!< ADC group regular sequencer channel 14, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL13_Pos (13U)
#define ADC_CHSELR_CHSEL13_Msk \
    (0x1U << ADC_CHSELR_CHSEL13_Pos) /*!< 0x00002000 */
#define ADC_CHSELR_CHSEL13                                              \
    ADC_CHSELR_CHSEL13_Msk /*!< ADC group regular sequencer channel 13, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL12_Pos (12U)
#define ADC_CHSELR_CHSEL12_Msk \
    (0x1U << ADC_CHSELR_CHSEL12_Pos) /*!< 0x00001000 */
#define ADC_CHSELR_CHSEL12                                              \
    ADC_CHSELR_CHSEL12_Msk /*!< ADC group regular sequencer channel 12, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL11_Pos (11U)
#define ADC_CHSELR_CHSEL11_Msk \
    (0x1U << ADC_CHSELR_CHSEL11_Pos) /*!< 0x00000800 */
#define ADC_CHSELR_CHSEL11                                              \
    ADC_CHSELR_CHSEL11_Msk /*!< ADC group regular sequencer channel 11, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL10_Pos (10U)
#define ADC_CHSELR_CHSEL10_Msk \
    (0x1U << ADC_CHSELR_CHSEL10_Pos) /*!< 0x00000400 */
#define ADC_CHSELR_CHSEL10                                              \
    ADC_CHSELR_CHSEL10_Msk /*!< ADC group regular sequencer channel 10, \
                              available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL9_Pos (9U)
#define ADC_CHSELR_CHSEL9_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL9_Pos) /*!< 0x00000200 \
                                     */
#define ADC_CHSELR_CHSEL9                                             \
    ADC_CHSELR_CHSEL9_Msk /*!< ADC group regular sequencer channel 9, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL8_Pos (8U)
#define ADC_CHSELR_CHSEL8_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL8_Pos) /*!< 0x00000100 \
                                     */
#define ADC_CHSELR_CHSEL8                                             \
    ADC_CHSELR_CHSEL8_Msk /*!< ADC group regular sequencer channel 8, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL7_Pos (7U)
#define ADC_CHSELR_CHSEL7_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL7_Pos) /*!< 0x00000080 \
                                     */
#define ADC_CHSELR_CHSEL7                                             \
    ADC_CHSELR_CHSEL7_Msk /*!< ADC group regular sequencer channel 7, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL6_Pos (6U)
#define ADC_CHSELR_CHSEL6_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL6_Pos) /*!< 0x00000040 \
                                     */
#define ADC_CHSELR_CHSEL6                                             \
    ADC_CHSELR_CHSEL6_Msk /*!< ADC group regular sequencer channel 6, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL5_Pos (5U)
#define ADC_CHSELR_CHSEL5_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL5_Pos) /*!< 0x00000020 \
                                     */
#define ADC_CHSELR_CHSEL5                                             \
    ADC_CHSELR_CHSEL5_Msk /*!< ADC group regular sequencer channel 5, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL4_Pos (4U)
#define ADC_CHSELR_CHSEL4_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL4_Pos) /*!< 0x00000010 \
                                     */
#define ADC_CHSELR_CHSEL4                                             \
    ADC_CHSELR_CHSEL4_Msk /*!< ADC group regular sequencer channel 4, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL3_Pos (3U)
#define ADC_CHSELR_CHSEL3_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL3_Pos) /*!< 0x00000008 \
                                     */
#define ADC_CHSELR_CHSEL3                                             \
    ADC_CHSELR_CHSEL3_Msk /*!< ADC group regular sequencer channel 3, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL2_Pos (2U)
#define ADC_CHSELR_CHSEL2_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL2_Pos) /*!< 0x00000004 \
                                     */
#define ADC_CHSELR_CHSEL2                                             \
    ADC_CHSELR_CHSEL2_Msk /*!< ADC group regular sequencer channel 2, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL1_Pos (1U)
#define ADC_CHSELR_CHSEL1_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL1_Pos) /*!< 0x00000002 \
                                     */
#define ADC_CHSELR_CHSEL1                                             \
    ADC_CHSELR_CHSEL1_Msk /*!< ADC group regular sequencer channel 1, \
                             available when ADC_CFGR1_CHSELRMOD is reset */
#define ADC_CHSELR_CHSEL0_Pos (0U)
#define ADC_CHSELR_CHSEL0_Msk                       \
    (0x1U << ADC_CHSELR_CHSEL0_Pos) /*!< 0x00000001 \
                                     */
#define ADC_CHSELR_CHSEL0                                             \
    ADC_CHSELR_CHSEL0_Msk /*!< ADC group regular sequencer channel 0, \
                             available when ADC_CFGR1_CHSELRMOD is reset */

