niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA_Pos (0U)
#define ADC_DR_DATA_Msk (0xFFFFU << ADC_DR_DATA_Pos) /*!< 0x0000FFFF */
#define ADC_DR_DATA     ADC_DR_DATA_Msk /*!< ADC group regular conversion data */
#define ADC_DR_DATA_0   (0x0001U << ADC_DR_DATA_Pos) /*!< 0x00000001 */
#define ADC_DR_DATA_1   (0x0002U << ADC_DR_DATA_Pos) /*!< 0x00000002 */
#define ADC_DR_DATA_2   (0x0004U << ADC_DR_DATA_Pos) /*!< 0x00000004 */
#define ADC_DR_DATA_3   (0x0008U << ADC_DR_DATA_Pos) /*!< 0x00000008 */
#define ADC_DR_DATA_4   (0x0010U << ADC_DR_DATA_Pos) /*!< 0x00000010 */
#define ADC_DR_DATA_5   (0x0020U << ADC_DR_DATA_Pos) /*!< 0x00000020 */
#define ADC_DR_DATA_6   (0x0040U << ADC_DR_DATA_Pos) /*!< 0x00000040 */
#define ADC_DR_DATA_7   (0x0080U << ADC_DR_DATA_Pos) /*!< 0x00000080 */
#define ADC_DR_DATA_8   (0x0100U << ADC_DR_DATA_Pos) /*!< 0x00000100 */
#define ADC_DR_DATA_9   (0x0200U << ADC_DR_DATA_Pos) /*!< 0x00000200 */
#define ADC_DR_DATA_10  (0x0400U << ADC_DR_DATA_Pos) /*!< 0x00000400 */
#define ADC_DR_DATA_11  (0x0800U << ADC_DR_DATA_Pos) /*!< 0x00000800 */
#define ADC_DR_DATA_12  (0x1000U << ADC_DR_DATA_Pos) /*!< 0x00001000 */
#define ADC_DR_DATA_13  (0x2000U << ADC_DR_DATA_Pos) /*!< 0x00002000 */
#define ADC_DR_DATA_14  (0x4000U << ADC_DR_DATA_Pos) /*!< 0x00004000 */
#define ADC_DR_DATA_15  (0x8000U << ADC_DR_DATA_Pos) /*!< 0x00008000 */

/*************************  ADC Common registers  *****************************/
/*******************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_VREFEN_Pos (22U)
#define ADC_CCR_VREFEN_Msk (0x1U << ADC_CCR_VREFEN_Pos) /*!< 0x00400000 */
#define ADC_CCR_VREFEN \
    ADC_CCR_VREFEN_Msk /*!< ADC internal path to VrefInt enable */
#define ADC_CCR_TSEN_Pos (23U)
#define ADC_CCR_TSEN_Msk (0x1U << ADC_CCR_TSEN_Pos) /*!< 0x00800000 */
#define ADC_CCR_TSEN \
    ADC_CCR_TSEN_Msk /*!< ADC internal path to temperature sensor enable */

/******************************************************************************/
/*                                                                            */
/*                       CRC calculation unit (CRC)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos (0U)
#define CRC_DR_DR_Msk (0xFFFFFFFFU << CRC_DR_DR_Pos) /*!< 0xFFFFFFFF */
#define CRC_DR_DR     CRC_DR_DR_Msk                  /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR \
    ((uint8_t)0xFFU) /*!< General-purpose 8-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos (0U)
#define CRC_CR_RESET_Msk (0x1U << CRC_CR_RESET_Pos) /*!< 0x00000001 */
#define CRC_CR_RESET                                         \
    CRC_CR_RESET_Msk /*!< RESET the CRC computation unit bit \
                      */
#define CRC_CR_REV_IN_Pos  (5U)
#define CRC_CR_REV_IN_Msk  (0x3U << CRC_CR_REV_IN_Pos) /*!< 0x00000060 */
#define CRC_CR_REV_IN      CRC_CR_REV_IN_Msk /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0    (0x1U << CRC_CR_REV_IN_Pos) /*!< 0x00000020 */
#define CRC_CR_REV_IN_1    (0x2U << CRC_CR_REV_IN_Pos) /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos (7U)
#define CRC_CR_REV_OUT_Msk (0x1U << CRC_CR_REV_OUT_Pos) /*!< 0x00000080 */
#define CRC_CR_REV_OUT \
    CRC_CR_REV_OUT_Msk /*!< REV_OUT Reverse Output Data bits */

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos (0U)
#define CRC_INIT_INIT_Msk                               \
    (0xFFFFFFFFU << CRC_INIT_INIT_Pos)  /*!< 0xFFFFFFFF \
                                         */
#define CRC_INIT_INIT CRC_INIT_INIT_Msk /*!< Initial CRC value bits */

/******************************************************************************/
/*                                                                            */
/*                           Debug MCU (DBGMCU)                               */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define DBGMCU_IDCODE_DEV_ID_Pos (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk \
    (0xFFFU << DBGMCU_IDCODE_DEV_ID_Pos) /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                        \
    DBGMCU_IDCODE_DEV_ID_Msk /*!< Device Identifier \
                              */

#define DBGMCU_IDCODE_REV_ID_Pos (16U)
#define DBGMCU_IDCODE_REV_ID_Msk \
    (0xFFFFU << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID \
    DBGMCU_IDCODE_REV_ID_Msk /*!< REV_ID[15:0] bits (Revision Identifier) */
#define DBGMCU_IDCODE_REV_ID_0 \
    (0x0001U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00010000 */
#define DBGMCU_IDCODE_REV_ID_1 \
    (0x0002U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00020000 */
#define DBGMCU_IDCODE_REV_ID_2 \
    (0x0004U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00040000 */
#define DBGMCU_IDCODE_REV_ID_3 \
    (0x0008U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00080000 */
#define DBGMCU_IDCODE_REV_ID_4 \
    (0x0010U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00100000 */
#define DBGMCU_IDCODE_REV_ID_5 \
    (0x0020U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00200000 */
#define DBGMCU_IDCODE_REV_ID_6 \
    (0x0040U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00400000 */
#define DBGMCU_IDCODE_REV_ID_7 \
    (0x0080U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x00800000 */
#define DBGMCU_IDCODE_REV_ID_8 \
    (0x0100U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x01000000 */
#define DBGMCU_IDCODE_REV_ID_9 \
    (0x0200U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x02000000 */
#define DBGMCU_IDCODE_REV_ID_10 \
    (0x0400U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x04000000 */
#define DBGMCU_IDCODE_REV_ID_11 \
    (0x0800U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x08000000 */
#define DBGMCU_IDCODE_REV_ID_12 \
    (0x1000U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x10000000 */
#define DBGMCU_IDCODE_REV_ID_13 \
    (0x2000U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x20000000 */
#define DBGMCU_IDCODE_REV_ID_14 \
    (0x4000U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x40000000 */
#define DBGMCU_IDCODE_REV_ID_15 \
    (0x8000U << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0x80000000 */

