niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************  Bit definition for EXTI_EMR register  ********************/
#define EXTI_EMR_MR0_Pos  (0U)
#define EXTI_EMR_MR0_Msk  (0x1U << EXTI_EMR_MR0_Pos) /*!< 0x00000001 */
#define EXTI_EMR_MR0      EXTI_EMR_MR0_Msk /*!< Event Mask on line 0  */
#define EXTI_EMR_MR1_Pos  (1U)
#define EXTI_EMR_MR1_Msk  (0x1U << EXTI_EMR_MR1_Pos) /*!< 0x00000002 */
#define EXTI_EMR_MR1      EXTI_EMR_MR1_Msk /*!< Event Mask on line 1  */
#define EXTI_EMR_MR2_Pos  (2U)
#define EXTI_EMR_MR2_Msk  (0x1U << EXTI_EMR_MR2_Pos) /*!< 0x00000004 */
#define EXTI_EMR_MR2      EXTI_EMR_MR2_Msk /*!< Event Mask on line 2  */
#define EXTI_EMR_MR3_Pos  (3U)
#define EXTI_EMR_MR3_Msk  (0x1U << EXTI_EMR_MR3_Pos) /*!< 0x00000008 */
#define EXTI_EMR_MR3      EXTI_EMR_MR3_Msk /*!< Event Mask on line 3  */
#define EXTI_EMR_MR4_Pos  (4U)
#define EXTI_EMR_MR4_Msk  (0x1U << EXTI_EMR_MR4_Pos) /*!< 0x00000010 */
#define EXTI_EMR_MR4      EXTI_EMR_MR4_Msk /*!< Event Mask on line 4  */
#define EXTI_EMR_MR5_Pos  (5U)
#define EXTI_EMR_MR5_Msk  (0x1U << EXTI_EMR_MR5_Pos) /*!< 0x00000020 */
#define EXTI_EMR_MR5      EXTI_EMR_MR5_Msk /*!< Event Mask on line 5  */
#define EXTI_EMR_MR6_Pos  (6U)
#define EXTI_EMR_MR6_Msk  (0x1U << EXTI_EMR_MR6_Pos) /*!< 0x00000040 */
#define EXTI_EMR_MR6      EXTI_EMR_MR6_Msk /*!< Event Mask on line 6  */
#define EXTI_EMR_MR7_Pos  (7U)
#define EXTI_EMR_MR7_Msk  (0x1U << EXTI_EMR_MR7_Pos) /*!< 0x00000080 */
#define EXTI_EMR_MR7      EXTI_EMR_MR7_Msk /*!< Event Mask on line 7  */
#define EXTI_EMR_MR8_Pos  (8U)
#define EXTI_EMR_MR8_Msk  (0x1U << EXTI_EMR_MR8_Pos) /*!< 0x00000100 */
#define EXTI_EMR_MR8      EXTI_EMR_MR8_Msk /*!< Event Mask on line 8  */
#define EXTI_EMR_MR9_Pos  (9U)
#define EXTI_EMR_MR9_Msk  (0x1U << EXTI_EMR_MR9_Pos) /*!< 0x00000200 */
#define EXTI_EMR_MR9      EXTI_EMR_MR9_Msk /*!< Event Mask on line 9  */
#define EXTI_EMR_MR10_Pos (10U)
#define EXTI_EMR_MR10_Msk (0x1U << EXTI_EMR_MR10_Pos) /*!< 0x00000400 */
#define EXTI_EMR_MR10     EXTI_EMR_MR10_Msk /*!< Event Mask on line 10 */
#define EXTI_EMR_MR11_Pos (11U)
#define EXTI_EMR_MR11_Msk (0x1U << EXTI_EMR_MR11_Pos) /*!< 0x00000800 */
#define EXTI_EMR_MR11     EXTI_EMR_MR11_Msk /*!< Event Mask on line 11 */
#define EXTI_EMR_MR12_Pos (12U)
#define EXTI_EMR_MR12_Msk (0x1U << EXTI_EMR_MR12_Pos) /*!< 0x00001000 */
#define EXTI_EMR_MR12     EXTI_EMR_MR12_Msk /*!< Event Mask on line 12 */
#define EXTI_EMR_MR13_Pos (13U)
#define EXTI_EMR_MR13_Msk (0x1U << EXTI_EMR_MR13_Pos) /*!< 0x00002000 */
#define EXTI_EMR_MR13     EXTI_EMR_MR13_Msk /*!< Event Mask on line 13 */
#define EXTI_EMR_MR14_Pos (14U)
#define EXTI_EMR_MR14_Msk (0x1U << EXTI_EMR_MR14_Pos) /*!< 0x00004000 */
#define EXTI_EMR_MR14     EXTI_EMR_MR14_Msk /*!< Event Mask on line 14 */
#define EXTI_EMR_MR15_Pos (15U)
#define EXTI_EMR_MR15_Msk (0x1U << EXTI_EMR_MR15_Pos) /*!< 0x00008000 */
#define EXTI_EMR_MR15     EXTI_EMR_MR15_Msk /*!< Event Mask on line 15 */
#define EXTI_EMR_MR17_Pos (17U)
#define EXTI_EMR_MR17_Msk (0x1U << EXTI_EMR_MR17_Pos) /*!< 0x00020000 */
#define EXTI_EMR_MR17     EXTI_EMR_MR17_Msk /*!< Event Mask on line 17 */
#define EXTI_EMR_MR18_Pos (18U)
#define EXTI_EMR_MR18_Msk (0x1U << EXTI_EMR_MR18_Pos) /*!< 0x00040000 */
#define EXTI_EMR_MR18     EXTI_EMR_MR18_Msk /*!< Event Mask on line 18 */
#define EXTI_EMR_MR19_Pos (19U)
#define EXTI_EMR_MR19_Msk (0x1U << EXTI_EMR_MR19_Pos) /*!< 0x00080000 */
#define EXTI_EMR_MR19     EXTI_EMR_MR19_Msk /*!< Event Mask on line 19 */
#define EXTI_EMR_MR23_Pos (23U)
#define EXTI_EMR_MR23_Msk (0x1U << EXTI_EMR_MR23_Pos) /*!< 0x00800000 */
#define EXTI_EMR_MR23     EXTI_EMR_MR23_Msk /*!< Event Mask on line 23 */

/* References Defines */
#define EXTI_EMR_EM0  EXTI_EMR_MR0
#define EXTI_EMR_EM1  EXTI_EMR_MR1
#define EXTI_EMR_EM2  EXTI_EMR_MR2
#define EXTI_EMR_EM3  EXTI_EMR_MR3
#define EXTI_EMR_EM4  EXTI_EMR_MR4
#define EXTI_EMR_EM5  EXTI_EMR_MR5
#define EXTI_EMR_EM6  EXTI_EMR_MR6
#define EXTI_EMR_EM7  EXTI_EMR_MR7
#define EXTI_EMR_EM8  EXTI_EMR_MR8
#define EXTI_EMR_EM9  EXTI_EMR_MR9
#define EXTI_EMR_EM10 EXTI_EMR_MR10
#define EXTI_EMR_EM11 EXTI_EMR_MR11
#define EXTI_EMR_EM12 EXTI_EMR_MR12
#define EXTI_EMR_EM13 EXTI_EMR_MR13
#define EXTI_EMR_EM14 EXTI_EMR_MR14
#define EXTI_EMR_EM15 EXTI_EMR_MR15
#define EXTI_EMR_EM17 EXTI_EMR_MR17
#define EXTI_EMR_EM18 EXTI_EMR_MR18
#define EXTI_EMR_EM19 EXTI_EMR_MR19
#define EXTI_EMR_EM23 EXTI_EMR_MR23

/*******************  Bit definition for EXTI_RTSR register  ******************/
#define EXTI_RTSR_TR0_Pos (0U)
#define EXTI_RTSR_TR0_Msk (0x1U << EXTI_RTSR_TR0_Pos) /*!< 0x00000001 */
#define EXTI_RTSR_TR0 \
    EXTI_RTSR_TR0_Msk /*!< Rising trigger event configuration bit of line 0 */
#define EXTI_RTSR_TR1_Pos (1U)
#define EXTI_RTSR_TR1_Msk (0x1U << EXTI_RTSR_TR1_Pos) /*!< 0x00000002 */
#define EXTI_RTSR_TR1 \
    EXTI_RTSR_TR1_Msk /*!< Rising trigger event configuration bit of line 1 */
#define EXTI_RTSR_TR2_Pos (2U)
#define EXTI_RTSR_TR2_Msk (0x1U << EXTI_RTSR_TR2_Pos) /*!< 0x00000004 */
#define EXTI_RTSR_TR2 \
    EXTI_RTSR_TR2_Msk /*!< Rising trigger event configuration bit of line 2 */
#define EXTI_RTSR_TR3_Pos (3U)
#define EXTI_RTSR_TR3_Msk (0x1U << EXTI_RTSR_TR3_Pos) /*!< 0x00000008 */
#define EXTI_RTSR_TR3 \
    EXTI_RTSR_TR3_Msk /*!< Rising trigger event configuration bit of line 3 */
#define EXTI_RTSR_TR4_Pos (4U)
#define EXTI_RTSR_TR4_Msk (0x1U << EXTI_RTSR_TR4_Pos) /*!< 0x00000010 */
#define EXTI_RTSR_TR4 \
    EXTI_RTSR_TR4_Msk /*!< Rising trigger event configuration bit of line 4 */
#define EXTI_RTSR_TR5_Pos (5U)
#define EXTI_RTSR_TR5_Msk (0x1U << EXTI_RTSR_TR5_Pos) /*!< 0x00000020 */
#define EXTI_RTSR_TR5 \
    EXTI_RTSR_TR5_Msk /*!< Rising trigger event configuration bit of line 5 */
#define EXTI_RTSR_TR6_Pos (6U)
#define EXTI_RTSR_TR6_Msk (0x1U << EXTI_RTSR_TR6_Pos) /*!< 0x00000040 */
#define EXTI_RTSR_TR6 \
    EXTI_RTSR_TR6_Msk /*!< Rising trigger event configuration bit of line 6 */
#define EXTI_RTSR_TR7_Pos (7U)
#define EXTI_RTSR_TR7_Msk (0x1U << EXTI_RTSR_TR7_Pos) /*!< 0x00000080 */
#define EXTI_RTSR_TR7 \
    EXTI_RTSR_TR7_Msk /*!< Rising trigger event configuration bit of line 7 */
#define EXTI_RTSR_TR8_Pos (8U)
#define EXTI_RTSR_TR8_Msk (0x1U << EXTI_RTSR_TR8_Pos) /*!< 0x00000100 */
#define EXTI_RTSR_TR8 \
    EXTI_RTSR_TR8_Msk /*!< Rising trigger event configuration bit of line 8 */
#define EXTI_RTSR_TR9_Pos (9U)
#define EXTI_RTSR_TR9_Msk (0x1U << EXTI_RTSR_TR9_Pos) /*!< 0x00000200 */
#define EXTI_RTSR_TR9 \
    EXTI_RTSR_TR9_Msk /*!< Rising trigger event configuration bit of line 9 */
#define EXTI_RTSR_TR10_Pos (10U)
#define EXTI_RTSR_TR10_Msk (0x1U << EXTI_RTSR_TR10_Pos) /*!< 0x00000400 */
#define EXTI_RTSR_TR10                                                        \
    EXTI_RTSR_TR10_Msk /*!< Rising trigger event configuration bit of line 10 \
                        */
#define EXTI_RTSR_TR11_Pos (11U)
#define EXTI_RTSR_TR11_Msk (0x1U << EXTI_RTSR_TR11_Pos) /*!< 0x00000800 */
#define EXTI_RTSR_TR11                                                        \
    EXTI_RTSR_TR11_Msk /*!< Rising trigger event configuration bit of line 11 \
                        */
#define EXTI_RTSR_TR12_Pos (12U)
#define EXTI_RTSR_TR12_Msk (0x1U << EXTI_RTSR_TR12_Pos) /*!< 0x00001000 */
#define EXTI_RTSR_TR12                                                        \
    EXTI_RTSR_TR12_Msk /*!< Rising trigger event configuration bit of line 12 \
                        */
#define EXTI_RTSR_TR13_Pos (13U)
#define EXTI_RTSR_TR13_Msk (0x1U << EXTI_RTSR_TR13_Pos) /*!< 0x00002000 */
#define EXTI_RTSR_TR13                                                        \
    EXTI_RTSR_TR13_Msk /*!< Rising trigger event configuration bit of line 13 \
                        */
#define EXTI_RTSR_TR14_Pos (14U)
#define EXTI_RTSR_TR14_Msk (0x1U << EXTI_RTSR_TR14_Pos) /*!< 0x00004000 */
#define EXTI_RTSR_TR14                                                        \
    EXTI_RTSR_TR14_Msk /*!< Rising trigger event configuration bit of line 14 \
                        */
#define EXTI_RTSR_TR15_Pos (15U)
#define EXTI_RTSR_TR15_Msk (0x1U << EXTI_RTSR_TR15_Pos) /*!< 0x00008000 */
#define EXTI_RTSR_TR15                                                        \
    EXTI_RTSR_TR15_Msk /*!< Rising trigger event configuration bit of line 15 \
                        */
#define EXTI_RTSR_TR16_Pos (16U)
#define EXTI_RTSR_TR16_Msk (0x1U << EXTI_RTSR_TR16_Pos) /*!< 0x00010000 */
#define EXTI_RTSR_TR16                                                        \
    EXTI_RTSR_TR16_Msk /*!< Rising trigger event configuration bit of line 16 \
                        */
#define EXTI_RTSR_TR17_Pos (17U)
#define EXTI_RTSR_TR17_Msk (0x1U << EXTI_RTSR_TR17_Pos) /*!< 0x00020000 */
#define EXTI_RTSR_TR17                                                        \
    EXTI_RTSR_TR17_Msk /*!< Rising trigger event configuration bit of line 17 \
                        */
#define EXTI_RTSR_TR19_Pos (19U)
#define EXTI_RTSR_TR19_Msk (0x1U << EXTI_RTSR_TR19_Pos) /*!< 0x00080000 */
#define EXTI_RTSR_TR19                                                        \
    EXTI_RTSR_TR19_Msk /*!< Rising trigger event configuration bit of line 19 \
                        */

/* References Defines */
#define EXTI_RTSR_RT0  EXTI_RTSR_TR0
#define EXTI_RTSR_RT1  EXTI_RTSR_TR1
#define EXTI_RTSR_RT2  EXTI_RTSR_TR2
#define EXTI_RTSR_RT3  EXTI_RTSR_TR3
#define EXTI_RTSR_RT4  EXTI_RTSR_TR4
#define EXTI_RTSR_RT5  EXTI_RTSR_TR5
#define EXTI_RTSR_RT6  EXTI_RTSR_TR6
#define EXTI_RTSR_RT7  EXTI_RTSR_TR7
#define EXTI_RTSR_RT8  EXTI_RTSR_TR8
#define EXTI_RTSR_RT9  EXTI_RTSR_TR9
#define EXTI_RTSR_RT10 EXTI_RTSR_TR10
#define EXTI_RTSR_RT11 EXTI_RTSR_TR11
#define EXTI_RTSR_RT12 EXTI_RTSR_TR12
#define EXTI_RTSR_RT13 EXTI_RTSR_TR13
#define EXTI_RTSR_RT14 EXTI_RTSR_TR14
#define EXTI_RTSR_RT15 EXTI_RTSR_TR15
#define EXTI_RTSR_RT16 EXTI_RTSR_TR16
#define EXTI_RTSR_RT17 EXTI_RTSR_TR17
#define EXTI_RTSR_RT19 EXTI_RTSR_TR19

/*******************  Bit definition for EXTI_FTSR register *******************/
#define EXTI_FTSR_TR0_Pos (0U)
#define EXTI_FTSR_TR0_Msk (0x1U << EXTI_FTSR_TR0_Pos) /*!< 0x00000001 */
#define EXTI_FTSR_TR0                                                        \
    EXTI_FTSR_TR0_Msk /*!< Falling trigger event configuration bit of line 0 \
                       */
#define EXTI_FTSR_TR1_Pos (1U)
#define EXTI_FTSR_TR1_Msk (0x1U << EXTI_FTSR_TR1_Pos) /*!< 0x00000002 */
#define EXTI_FTSR_TR1                                                        \
    EXTI_FTSR_TR1_Msk /*!< Falling trigger event configuration bit of line 1 \
                       */
#define EXTI_FTSR_TR2_Pos (2U)
#define EXTI_FTSR_TR2_Msk (0x1U << EXTI_FTSR_TR2_Pos) /*!< 0x00000004 */
#define EXTI_FTSR_TR2                                                        \
    EXTI_FTSR_TR2_Msk /*!< Falling trigger event configuration bit of line 2 \
                       */
#define EXTI_FTSR_TR3_Pos (3U)
#define EXTI_FTSR_TR3_Msk (0x1U << EXTI_FTSR_TR3_Pos) /*!< 0x00000008 */
#define EXTI_FTSR_TR3                                                        \
    EXTI_FTSR_TR3_Msk /*!< Falling trigger event configuration bit of line 3 \
                       */
#define EXTI_FTSR_TR4_Pos (4U)
#define EXTI_FTSR_TR4_Msk (0x1U << EXTI_FTSR_TR4_Pos) /*!< 0x00000010 */
#define EXTI_FTSR_TR4                                                        \
    EXTI_FTSR_TR4_Msk /*!< Falling trigger event configuration bit of line 4 \
                       */
#define EXTI_FTSR_TR5_Pos (5U)
#define EXTI_FTSR_TR5_Msk (0x1U << EXTI_FTSR_TR5_Pos) /*!< 0x00000020 */
#define EXTI_FTSR_TR5                                                        \
    EXTI_FTSR_TR5_Msk /*!< Falling trigger event configuration bit of line 5 \
                       */
#define EXTI_FTSR_TR6_Pos (6U)
#define EXTI_FTSR_TR6_Msk (0x1U << EXTI_FTSR_TR6_Pos) /*!< 0x00000040 */
#define EXTI_FTSR_TR6                                                        \
    EXTI_FTSR_TR6_Msk /*!< Falling trigger event configuration bit of line 6 \
                       */
#define EXTI_FTSR_TR7_Pos (7U)
#define EXTI_FTSR_TR7_Msk (0x1U << EXTI_FTSR_TR7_Pos) /*!< 0x00000080 */
#define EXTI_FTSR_TR7                                                        \
    EXTI_FTSR_TR7_Msk /*!< Falling trigger event configuration bit of line 7 \
                       */
#define EXTI_FTSR_TR8_Pos (8U)
#define EXTI_FTSR_TR8_Msk (0x1U << EXTI_FTSR_TR8_Pos) /*!< 0x00000100 */
#define EXTI_FTSR_TR8                                                        \
    EXTI_FTSR_TR8_Msk /*!< Falling trigger event configuration bit of line 8 \
                       */
#define EXTI_FTSR_TR9_Pos (9U)
#define EXTI_FTSR_TR9_Msk (0x1U << EXTI_FTSR_TR9_Pos) /*!< 0x00000200 */
#define EXTI_FTSR_TR9                                                        \
    EXTI_FTSR_TR9_Msk /*!< Falling trigger event configuration bit of line 9 \
                       */
#define EXTI_FTSR_TR10_Pos (10U)
#define EXTI_FTSR_TR10_Msk (0x1U << EXTI_FTSR_TR10_Pos) /*!< 0x00000400 */
#define EXTI_FTSR_TR10                                                         \
    EXTI_FTSR_TR10_Msk /*!< Falling trigger event configuration bit of line 10 \
                        */
#define EXTI_FTSR_TR11_Pos (11U)
#define EXTI_FTSR_TR11_Msk (0x1U << EXTI_FTSR_TR11_Pos) /*!< 0x00000800 */
#define EXTI_FTSR_TR11                                                         \
    EXTI_FTSR_TR11_Msk /*!< Falling trigger event configuration bit of line 11 \
                        */
#define EXTI_FTSR_TR12_Pos (12U)
#define EXTI_FTSR_TR12_Msk (0x1U << EXTI_FTSR_TR12_Pos) /*!< 0x00001000 */
#define EXTI_FTSR_TR12                                                         \
    EXTI_FTSR_TR12_Msk /*!< Falling trigger event configuration bit of line 12 \
                        */
#define EXTI_FTSR_TR13_Pos (13U)
#define EXTI_FTSR_TR13_Msk (0x1U << EXTI_FTSR_TR13_Pos) /*!< 0x00002000 */
#define EXTI_FTSR_TR13                                                         \
    EXTI_FTSR_TR13_Msk /*!< Falling trigger event configuration bit of line 13 \
                        */
#define EXTI_FTSR_TR14_Pos (14U)
#define EXTI_FTSR_TR14_Msk (0x1U << EXTI_FTSR_TR14_Pos) /*!< 0x00004000 */
#define EXTI_FTSR_TR14                                                         \
    EXTI_FTSR_TR14_Msk /*!< Falling trigger event configuration bit of line 14 \
                        */
#define EXTI_FTSR_TR15_Pos (15U)
#define EXTI_FTSR_TR15_Msk (0x1U << EXTI_FTSR_TR15_Pos) /*!< 0x00008000 */
#define EXTI_FTSR_TR15                                                         \
    EXTI_FTSR_TR15_Msk /*!< Falling trigger event configuration bit of line 15 \
                        */
#define EXTI_FTSR_TR16_Pos (16U)
#define EXTI_FTSR_TR16_Msk (0x1U << EXTI_FTSR_TR16_Pos) /*!< 0x00010000 */
#define EXTI_FTSR_TR16                                                         \
    EXTI_FTSR_TR16_Msk /*!< Falling trigger event configuration bit of line 16 \
                        */
#define EXTI_FTSR_TR17_Pos (17U)
#define EXTI_FTSR_TR17_Msk (0x1U << EXTI_FTSR_TR17_Pos) /*!< 0x00020000 */
#define EXTI_FTSR_TR17                                                         \
    EXTI_FTSR_TR17_Msk /*!< Falling trigger event configuration bit of line 17 \
                        */
#define EXTI_FTSR_TR19_Pos (19U)
#define EXTI_FTSR_TR19_Msk (0x1U << EXTI_FTSR_TR19_Pos) /*!< 0x00080000 */
#define EXTI_FTSR_TR19                                                         \
    EXTI_FTSR_TR19_Msk /*!< Falling trigger event configuration bit of line 19 \
                        */

/* References Defines */
#define EXTI_FTSR_FT0  EXTI_FTSR_TR0
#define EXTI_FTSR_FT1  EXTI_FTSR_TR1
#define EXTI_FTSR_FT2  EXTI_FTSR_TR2
#define EXTI_FTSR_FT3  EXTI_FTSR_TR3
#define EXTI_FTSR_FT4  EXTI_FTSR_TR4
#define EXTI_FTSR_FT5  EXTI_FTSR_TR5
#define EXTI_FTSR_FT6  EXTI_FTSR_TR6
#define EXTI_FTSR_FT7  EXTI_FTSR_TR7
#define EXTI_FTSR_FT8  EXTI_FTSR_TR8
#define EXTI_FTSR_FT9  EXTI_FTSR_TR9
#define EXTI_FTSR_FT10 EXTI_FTSR_TR10
#define EXTI_FTSR_FT11 EXTI_FTSR_TR11
#define EXTI_FTSR_FT12 EXTI_FTSR_TR12
#define EXTI_FTSR_FT13 EXTI_FTSR_TR13
#define EXTI_FTSR_FT14 EXTI_FTSR_TR14
#define EXTI_FTSR_FT15 EXTI_FTSR_TR15
#define EXTI_FTSR_FT16 EXTI_FTSR_TR16
#define EXTI_FTSR_FT17 EXTI_FTSR_TR17
#define EXTI_FTSR_FT19 EXTI_FTSR_TR19

/******************* Bit definition for EXTI_SWIER register *******************/
#define EXTI_SWIER_SWIER0_Pos (0U)
#define EXTI_SWIER_SWIER0_Msk                       \
    (0x1U << EXTI_SWIER_SWIER0_Pos) /*!< 0x00000001 \
                                     */
#define EXTI_SWIER_SWIER0 \
    EXTI_SWIER_SWIER0_Msk /*!< Software Interrupt on line 0  */
#define EXTI_SWIER_SWIER1_Pos (1U)
#define EXTI_SWIER_SWIER1_Msk                       \
    (0x1U << EXTI_SWIER_SWIER1_Pos) /*!< 0x00000002 \
                                     */
#define EXTI_SWIER_SWIER1 \
    EXTI_SWIER_SWIER1_Msk /*!< Software Interrupt on line 1  */
#define EXTI_SWIER_SWIER2_Pos (2U)
#define EXTI_SWIER_SWIER2_Msk                       \
    (0x1U << EXTI_SWIER_SWIER2_Pos) /*!< 0x00000004 \
                                     */
#define EXTI_SWIER_SWIER2 \
    EXTI_SWIER_SWIER2_Msk /*!< Software Interrupt on line 2  */
#define EXTI_SWIER_SWIER3_Pos (3U)
#define EXTI_SWIER_SWIER3_Msk                       \
    (0x1U << EXTI_SWIER_SWIER3_Pos) /*!< 0x00000008 \
                                     */
#define EXTI_SWIER_SWIER3 \
    EXTI_SWIER_SWIER3_Msk /*!< Software Interrupt on line 3  */
#define EXTI_SWIER_SWIER4_Pos (4U)
#define EXTI_SWIER_SWIER4_Msk                       \
    (0x1U << EXTI_SWIER_SWIER4_Pos) /*!< 0x00000010 \
                                     */
#define EXTI_SWIER_SWIER4 \
    EXTI_SWIER_SWIER4_Msk /*!< Software Interrupt on line 4  */
#define EXTI_SWIER_SWIER5_Pos (5U)
#define EXTI_SWIER_SWIER5_Msk                       \
    (0x1U << EXTI_SWIER_SWIER5_Pos) /*!< 0x00000020 \
                                     */
#define EXTI_SWIER_SWIER5 \
    EXTI_SWIER_SWIER5_Msk /*!< Software Interrupt on line 5  */
#define EXTI_SWIER_SWIER6_Pos (6U)
#define EXTI_SWIER_SWIER6_Msk                       \
    (0x1U << EXTI_SWIER_SWIER6_Pos) /*!< 0x00000040 \
                                     */
#define EXTI_SWIER_SWIER6 \
    EXTI_SWIER_SWIER6_Msk /*!< Software Interrupt on line 6  */
#define EXTI_SWIER_SWIER7_Pos (7U)
#define EXTI_SWIER_SWIER7_Msk                       \
    (0x1U << EXTI_SWIER_SWIER7_Pos) /*!< 0x00000080 \
                                     */
#define EXTI_SWIER_SWIER7 \
    EXTI_SWIER_SWIER7_Msk /*!< Software Interrupt on line 7  */
#define EXTI_SWIER_SWIER8_Pos (8U)
#define EXTI_SWIER_SWIER8_Msk                       \
    (0x1U << EXTI_SWIER_SWIER8_Pos) /*!< 0x00000100 \
                                     */
#define EXTI_SWIER_SWIER8 \
    EXTI_SWIER_SWIER8_Msk /*!< Software Interrupt on line 8  */
#define EXTI_SWIER_SWIER9_Pos (9U)
#define EXTI_SWIER_SWIER9_Msk                       \
    (0x1U << EXTI_SWIER_SWIER9_Pos) /*!< 0x00000200 \
                                     */
#define EXTI_SWIER_SWIER9 \
    EXTI_SWIER_SWIER9_Msk /*!< Software Interrupt on line 9  */
#define EXTI_SWIER_SWIER10_Pos (10U)
#define EXTI_SWIER_SWIER10_Msk \
    (0x1U << EXTI_SWIER_SWIER10_Pos) /*!< 0x00000400 */
#define EXTI_SWIER_SWIER10 \
    EXTI_SWIER_SWIER10_Msk /*!< Software Interrupt on line 10 */
#define EXTI_SWIER_SWIER11_Pos (11U)
#define EXTI_SWIER_SWIER11_Msk \
    (0x1U << EXTI_SWIER_SWIER11_Pos) /*!< 0x00000800 */
#define EXTI_SWIER_SWIER11 \
    EXTI_SWIER_SWIER11_Msk /*!< Software Interrupt on line 11 */
#define EXTI_SWIER_SWIER12_Pos (12U)
#define EXTI_SWIER_SWIER12_Msk \
    (0x1U << EXTI_SWIER_SWIER12_Pos) /*!< 0x00001000 */
#define EXTI_SWIER_SWIER12 \
    EXTI_SWIER_SWIER12_Msk /*!< Software Interrupt on line 12 */
#define EXTI_SWIER_SWIER13_Pos (13U)
#define EXTI_SWIER_SWIER13_Msk \
    (0x1U << EXTI_SWIER_SWIER13_Pos) /*!< 0x00002000 */
#define EXTI_SWIER_SWIER13 \
    EXTI_SWIER_SWIER13_Msk /*!< Software Interrupt on line 13 */
#define EXTI_SWIER_SWIER14_Pos (14U)
#define EXTI_SWIER_SWIER14_Msk \
    (0x1U << EXTI_SWIER_SWIER14_Pos) /*!< 0x00004000 */
#define EXTI_SWIER_SWIER14 \
    EXTI_SWIER_SWIER14_Msk /*!< Software Interrupt on line 14 */
#define EXTI_SWIER_SWIER15_Pos (15U)
#define EXTI_SWIER_SWIER15_Msk \
    (0x1U << EXTI_SWIER_SWIER15_Pos) /*!< 0x00008000 */
#define EXTI_SWIER_SWIER15 \
    EXTI_SWIER_SWIER15_Msk /*!< Software Interrupt on line 15 */
#define EXTI_SWIER_SWIER16_Pos (16U)
#define EXTI_SWIER_SWIER16_Msk \
    (0x1U << EXTI_SWIER_SWIER16_Pos) /*!< 0x00010000 */
#define EXTI_SWIER_SWIER16 \
    EXTI_SWIER_SWIER16_Msk /*!< Software Interrupt on line 16 */
#define EXTI_SWIER_SWIER17_Pos (17U)
#define EXTI_SWIER_SWIER17_Msk \
    (0x1U << EXTI_SWIER_SWIER17_Pos) /*!< 0x00020000 */
#define EXTI_SWIER_SWIER17 \
    EXTI_SWIER_SWIER17_Msk /*!< Software Interrupt on line 17 */
#define EXTI_SWIER_SWIER19_Pos (19U)
#define EXTI_SWIER_SWIER19_Msk \
    (0x1U << EXTI_SWIER_SWIER19_Pos) /*!< 0x00080000 */
#define EXTI_SWIER_SWIER19 \
    EXTI_SWIER_SWIER19_Msk /*!< Software Interrupt on line 19 */

/* References Defines */
#define EXTI_SWIER_SWI0  EXTI_SWIER_SWIER0
#define EXTI_SWIER_SWI1  EXTI_SWIER_SWIER1
#define EXTI_SWIER_SWI2  EXTI_SWIER_SWIER2
#define EXTI_SWIER_SWI3  EXTI_SWIER_SWIER3
#define EXTI_SWIER_SWI4  EXTI_SWIER_SWIER4
#define EXTI_SWIER_SWI5  EXTI_SWIER_SWIER5
#define EXTI_SWIER_SWI6  EXTI_SWIER_SWIER6
#define EXTI_SWIER_SWI7  EXTI_SWIER_SWIER7
#define EXTI_SWIER_SWI8  EXTI_SWIER_SWIER8
#define EXTI_SWIER_SWI9  EXTI_SWIER_SWIER9
#define EXTI_SWIER_SWI10 EXTI_SWIER_SWIER10
#define EXTI_SWIER_SWI11 EXTI_SWIER_SWIER11
#define EXTI_SWIER_SWI12 EXTI_SWIER_SWIER12
#define EXTI_SWIER_SWI13 EXTI_SWIER_SWIER13
#define EXTI_SWIER_SWI14 EXTI_SWIER_SWIER14
#define EXTI_SWIER_SWI15 EXTI_SWIER_SWIER15
#define EXTI_SWIER_SWI16 EXTI_SWIER_SWIER16
#define EXTI_SWIER_SWI17 EXTI_SWIER_SWIER17
#define EXTI_SWIER_SWI19 EXTI_SWIER_SWIER19

