niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************  Bit definition for EXTI_PR register  *********************/
#define EXTI_PR_PR0_Pos  (0U)
#define EXTI_PR_PR0_Msk  (0x1U << EXTI_PR_PR0_Pos) /*!< 0x00000001 */
#define EXTI_PR_PR0      EXTI_PR_PR0_Msk           /*!< Pending bit 0  */
#define EXTI_PR_PR1_Pos  (1U)
#define EXTI_PR_PR1_Msk  (0x1U << EXTI_PR_PR1_Pos) /*!< 0x00000002 */
#define EXTI_PR_PR1      EXTI_PR_PR1_Msk           /*!< Pending bit 1  */
#define EXTI_PR_PR2_Pos  (2U)
#define EXTI_PR_PR2_Msk  (0x1U << EXTI_PR_PR2_Pos) /*!< 0x00000004 */
#define EXTI_PR_PR2      EXTI_PR_PR2_Msk           /*!< Pending bit 2  */
#define EXTI_PR_PR3_Pos  (3U)
#define EXTI_PR_PR3_Msk  (0x1U << EXTI_PR_PR3_Pos) /*!< 0x00000008 */
#define EXTI_PR_PR3      EXTI_PR_PR3_Msk           /*!< Pending bit 3  */
#define EXTI_PR_PR4_Pos  (4U)
#define EXTI_PR_PR4_Msk  (0x1U << EXTI_PR_PR4_Pos) /*!< 0x00000010 */
#define EXTI_PR_PR4      EXTI_PR_PR4_Msk           /*!< Pending bit 4  */
#define EXTI_PR_PR5_Pos  (5U)
#define EXTI_PR_PR5_Msk  (0x1U << EXTI_PR_PR5_Pos) /*!< 0x00000020 */
#define EXTI_PR_PR5      EXTI_PR_PR5_Msk           /*!< Pending bit 5  */
#define EXTI_PR_PR6_Pos  (6U)
#define EXTI_PR_PR6_Msk  (0x1U << EXTI_PR_PR6_Pos) /*!< 0x00000040 */
#define EXTI_PR_PR6      EXTI_PR_PR6_Msk           /*!< Pending bit 6  */
#define EXTI_PR_PR7_Pos  (7U)
#define EXTI_PR_PR7_Msk  (0x1U << EXTI_PR_PR7_Pos) /*!< 0x00000080 */
#define EXTI_PR_PR7      EXTI_PR_PR7_Msk           /*!< Pending bit 7  */
#define EXTI_PR_PR8_Pos  (8U)
#define EXTI_PR_PR8_Msk  (0x1U << EXTI_PR_PR8_Pos) /*!< 0x00000100 */
#define EXTI_PR_PR8      EXTI_PR_PR8_Msk           /*!< Pending bit 8  */
#define EXTI_PR_PR9_Pos  (9U)
#define EXTI_PR_PR9_Msk  (0x1U << EXTI_PR_PR9_Pos) /*!< 0x00000200 */
#define EXTI_PR_PR9      EXTI_PR_PR9_Msk           /*!< Pending bit 9  */
#define EXTI_PR_PR10_Pos (10U)
#define EXTI_PR_PR10_Msk (0x1U << EXTI_PR_PR10_Pos) /*!< 0x00000400 */
#define EXTI_PR_PR10     EXTI_PR_PR10_Msk           /*!< Pending bit 10 */
#define EXTI_PR_PR11_Pos (11U)
#define EXTI_PR_PR11_Msk (0x1U << EXTI_PR_PR11_Pos) /*!< 0x00000800 */
#define EXTI_PR_PR11     EXTI_PR_PR11_Msk           /*!< Pending bit 11 */
#define EXTI_PR_PR12_Pos (12U)
#define EXTI_PR_PR12_Msk (0x1U << EXTI_PR_PR12_Pos) /*!< 0x00001000 */
#define EXTI_PR_PR12     EXTI_PR_PR12_Msk           /*!< Pending bit 12 */
#define EXTI_PR_PR13_Pos (13U)
#define EXTI_PR_PR13_Msk (0x1U << EXTI_PR_PR13_Pos) /*!< 0x00002000 */
#define EXTI_PR_PR13     EXTI_PR_PR13_Msk           /*!< Pending bit 13 */
#define EXTI_PR_PR14_Pos (14U)
#define EXTI_PR_PR14_Msk (0x1U << EXTI_PR_PR14_Pos) /*!< 0x00004000 */
#define EXTI_PR_PR14     EXTI_PR_PR14_Msk           /*!< Pending bit 14 */
#define EXTI_PR_PR15_Pos (15U)
#define EXTI_PR_PR15_Msk (0x1U << EXTI_PR_PR15_Pos) /*!< 0x00008000 */
#define EXTI_PR_PR15     EXTI_PR_PR15_Msk           /*!< Pending bit 15 */
#define EXTI_PR_PR16_Pos (16U)
#define EXTI_PR_PR16_Msk (0x1U << EXTI_PR_PR16_Pos) /*!< 0x00010000 */
#define EXTI_PR_PR16     EXTI_PR_PR16_Msk           /*!< Pending bit 16 */
#define EXTI_PR_PR17_Pos (17U)
#define EXTI_PR_PR17_Msk (0x1U << EXTI_PR_PR17_Pos) /*!< 0x00020000 */
#define EXTI_PR_PR17     EXTI_PR_PR17_Msk           /*!< Pending bit 17 */
#define EXTI_PR_PR19_Pos (19U)
#define EXTI_PR_PR19_Msk (0x1U << EXTI_PR_PR19_Pos) /*!< 0x00080000 */
#define EXTI_PR_PR19     EXTI_PR_PR19_Msk           /*!< Pending bit 19 */

/* References Defines */
#define EXTI_PR_PIF0  EXTI_PR_PR0
#define EXTI_PR_PIF1  EXTI_PR_PR1
#define EXTI_PR_PIF2  EXTI_PR_PR2
#define EXTI_PR_PIF3  EXTI_PR_PR3
#define EXTI_PR_PIF4  EXTI_PR_PR4
#define EXTI_PR_PIF5  EXTI_PR_PR5
#define EXTI_PR_PIF6  EXTI_PR_PR6
#define EXTI_PR_PIF7  EXTI_PR_PR7
#define EXTI_PR_PIF8  EXTI_PR_PR8
#define EXTI_PR_PIF9  EXTI_PR_PR9
#define EXTI_PR_PIF10 EXTI_PR_PR10
#define EXTI_PR_PIF11 EXTI_PR_PR11
#define EXTI_PR_PIF12 EXTI_PR_PR12
#define EXTI_PR_PIF13 EXTI_PR_PR13
#define EXTI_PR_PIF14 EXTI_PR_PR14
#define EXTI_PR_PIF15 EXTI_PR_PR15
#define EXTI_PR_PIF16 EXTI_PR_PR16
#define EXTI_PR_PIF17 EXTI_PR_PR17
#define EXTI_PR_PIF19 EXTI_PR_PR19

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define FLASH_ACR_LATENCY_Pos (0U)
#define FLASH_ACR_LATENCY_Msk                                   \
    (0x1U << FLASH_ACR_LATENCY_Pos)             /*!< 0x00000001 \
                                                 */
#define FLASH_ACR_LATENCY FLASH_ACR_LATENCY_Msk /*!< LATENCY bit (Latency) */

#define FLASH_ACR_PRFTBE_Pos (4U)
#define FLASH_ACR_PRFTBE_Msk (0x1U << FLASH_ACR_PRFTBE_Pos) /*!< 0x00000010 */
#define FLASH_ACR_PRFTBE     FLASH_ACR_PRFTBE_Msk /*!< Prefetch Buffer Enable */
#define FLASH_ACR_PRFTBS_Pos (5U)
#define FLASH_ACR_PRFTBS_Msk (0x1U << FLASH_ACR_PRFTBS_Pos) /*!< 0x00000020 */
#define FLASH_ACR_PRFTBS     FLASH_ACR_PRFTBS_Msk /*!< Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define FLASH_KEYR_FKEYR_Pos (0U)
#define FLASH_KEYR_FKEYR_Msk \
    (0xFFFFFFFFU << FLASH_KEYR_FKEYR_Pos)     /*!< 0xFFFFFFFF */
#define FLASH_KEYR_FKEYR FLASH_KEYR_FKEYR_Msk /*!< FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define FLASH_OPTKEYR_OPTKEYR_Pos (0U)
#define FLASH_OPTKEYR_OPTKEYR_Msk \
    (0xFFFFFFFFU << FLASH_OPTKEYR_OPTKEYR_Pos) /*!< 0xFFFFFFFF */
#define FLASH_OPTKEYR_OPTKEYR                      \
    FLASH_OPTKEYR_OPTKEYR_Msk /*!< Option Byte Key \
                               */

/******************  FLASH Keys  **********************************************/
#define FLASH_KEY1_Pos (0U)
#define FLASH_KEY1_Msk (0x45670123U << FLASH_KEY1_Pos) /*!< 0x45670123 */
#define FLASH_KEY1     FLASH_KEY1_Msk /*!< Flash program erase key1 */
#define FLASH_KEY2_Pos (0U)
#define FLASH_KEY2_Msk (0xCDEF89ABU << FLASH_KEY2_Pos) /*!< 0xCDEF89AB */
#define FLASH_KEY2                                                       \
    FLASH_KEY2_Msk /*!< Flash program erase key2: used with FLASH_PEKEY1 \
                    to unlock the write access to the FPEC. */

#define FLASH_OPTKEY1_Pos (0U)
#define FLASH_OPTKEY1_Msk                                   \
    (0x45670123U << FLASH_OPTKEY1_Pos)      /*!< 0x45670123 \
                                             */
#define FLASH_OPTKEY1     FLASH_OPTKEY1_Msk /*!< Flash option key1 */
#define FLASH_OPTKEY2_Pos (0U)
#define FLASH_OPTKEY2_Msk                              \
    (0xCDEF89ABU << FLASH_OPTKEY2_Pos) /*!< 0xCDEF89AB \
                                        */
#define FLASH_OPTKEY2                                                    \
    FLASH_OPTKEY2_Msk /*!< Flash option key2: used with FLASH_OPTKEY1 to \
                       unlock the write access to the option byte block */

/******************  Bit definition for FLASH_SR register  *******************/
#define FLASH_SR_BSY_Pos      (0U)
#define FLASH_SR_BSY_Msk      (0x1U << FLASH_SR_BSY_Pos) /*!< 0x00000001 */
#define FLASH_SR_BSY          FLASH_SR_BSY_Msk           /*!< Busy */
#define FLASH_SR_PGERR_Pos    (2U)
#define FLASH_SR_PGERR_Msk    (0x1U << FLASH_SR_PGERR_Pos) /*!< 0x00000004 */
#define FLASH_SR_PGERR        FLASH_SR_PGERR_Msk /*!< Programming Error */
#define FLASH_SR_WRPRTERR_Pos (4U)
#define FLASH_SR_WRPRTERR_Msk                                   \
    (0x1U << FLASH_SR_WRPRTERR_Pos)             /*!< 0x00000010 \
                                                 */
#define FLASH_SR_WRPRTERR FLASH_SR_WRPRTERR_Msk /*!< Write Protection Error */
#define FLASH_SR_EOP_Pos  (5U)
#define FLASH_SR_EOP_Msk  (0x1U << FLASH_SR_EOP_Pos) /*!< 0x00000020 */
#define FLASH_SR_EOP      FLASH_SR_EOP_Msk           /*!< End of operation */
#define FLASH_SR_WRPERR \
    FLASH_SR_WRPRTERR /*!< Legacy of Write Protection Error */

/*******************  Bit definition for FLASH_CR register  *******************/
#define FLASH_CR_PG_Pos     (0U)
#define FLASH_CR_PG_Msk     (0x1U << FLASH_CR_PG_Pos) /*!< 0x00000001 */
#define FLASH_CR_PG         FLASH_CR_PG_Msk           /*!< Programming */
#define FLASH_CR_PER_Pos    (1U)
#define FLASH_CR_PER_Msk    (0x1U << FLASH_CR_PER_Pos) /*!< 0x00000002 */
#define FLASH_CR_PER        FLASH_CR_PER_Msk           /*!< Page Erase */
#define FLASH_CR_MER_Pos    (2U)
#define FLASH_CR_MER_Msk    (0x1U << FLASH_CR_MER_Pos) /*!< 0x00000004 */
#define FLASH_CR_MER        FLASH_CR_MER_Msk           /*!< Mass Erase */
#define FLASH_CR_OPTPG_Pos  (4U)
#define FLASH_CR_OPTPG_Msk  (0x1U << FLASH_CR_OPTPG_Pos) /*!< 0x00000010 */
#define FLASH_CR_OPTPG      FLASH_CR_OPTPG_Msk /*!< Option Byte Programming */
#define FLASH_CR_OPTER_Pos  (5U)
#define FLASH_CR_OPTER_Msk  (0x1U << FLASH_CR_OPTER_Pos) /*!< 0x00000020 */
#define FLASH_CR_OPTER      FLASH_CR_OPTER_Msk /*!< Option Byte Erase */
#define FLASH_CR_STRT_Pos   (6U)
#define FLASH_CR_STRT_Msk   (0x1U << FLASH_CR_STRT_Pos) /*!< 0x00000040 */
#define FLASH_CR_STRT       FLASH_CR_STRT_Msk           /*!< Start */
#define FLASH_CR_LOCK_Pos   (7U)
#define FLASH_CR_LOCK_Msk   (0x1U << FLASH_CR_LOCK_Pos) /*!< 0x00000080 */
#define FLASH_CR_LOCK       FLASH_CR_LOCK_Msk           /*!< Lock */
#define FLASH_CR_OPTWRE_Pos (9U)
#define FLASH_CR_OPTWRE_Msk (0x1U << FLASH_CR_OPTWRE_Pos) /*!< 0x00000200 */
#define FLASH_CR_OPTWRE     FLASH_CR_OPTWRE_Msk /*!< Option Bytes Write Enable */
#define FLASH_CR_ERRIE_Pos  (10U)
#define FLASH_CR_ERRIE_Msk  (0x1U << FLASH_CR_ERRIE_Pos) /*!< 0x00000400 */
#define FLASH_CR_ERRIE      FLASH_CR_ERRIE_Msk /*!< Error Interrupt Enable */
#define FLASH_CR_EOPIE_Pos  (12U)
#define FLASH_CR_EOPIE_Msk  (0x1U << FLASH_CR_EOPIE_Pos) /*!< 0x00001000 */
#define FLASH_CR_EOPIE \
    FLASH_CR_EOPIE_Msk /*!< End of operation interrupt enable */
#define FLASH_CR_OBL_LAUNCH_Pos (13U)
#define FLASH_CR_OBL_LAUNCH_Msk \
    (0x1U << FLASH_CR_OBL_LAUNCH_Pos) /*!< 0x00002000 */
#define FLASH_CR_OBL_LAUNCH \
    FLASH_CR_OBL_LAUNCH_Msk /*!< Option Bytes Loader Launch */

/*******************  Bit definition for FLASH_AR register  *******************/
#define FLASH_AR_FAR_Pos (0U)
#define FLASH_AR_FAR_Msk (0xFFFFFFFFU << FLASH_AR_FAR_Pos) /*!< 0xFFFFFFFF */
#define FLASH_AR_FAR     FLASH_AR_FAR_Msk                  /*!< Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define FLASH_OBR_OPTERR_Pos (0U)
#define FLASH_OBR_OPTERR_Msk (0x1U << FLASH_OBR_OPTERR_Pos) /*!< 0x00000001 */
#define FLASH_OBR_OPTERR     FLASH_OBR_OPTERR_Msk /*!< Option Byte Error */
#define FLASH_OBR_RDPRT1_Pos (1U)
#define FLASH_OBR_RDPRT1_Msk (0x1U << FLASH_OBR_RDPRT1_Pos) /*!< 0x00000002 */
#define FLASH_OBR_RDPRT1     FLASH_OBR_RDPRT1_Msk /*!< Read protection Level 1 */
#define FLASH_OBR_RDPRT2_Pos (2U)
#define FLASH_OBR_RDPRT2_Msk (0x1U << FLASH_OBR_RDPRT2_Pos) /*!< 0x00000004 */
#define FLASH_OBR_RDPRT2     FLASH_OBR_RDPRT2_Msk /*!< Read protection Level 2 */

