niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
#define FLASH_OBR_USER_Pos    (8U)
#define FLASH_OBR_USER_Msk    (0x77U << FLASH_OBR_USER_Pos) /*!< 0x00007700 */
#define FLASH_OBR_USER        FLASH_OBR_USER_Msk /*!< User Option Bytes */
#define FLASH_OBR_IWDG_SW_Pos (8U)
#define FLASH_OBR_IWDG_SW_Msk                                         \
    (0x1U << FLASH_OBR_IWDG_SW_Pos)                   /*!< 0x00000100 \
                                                       */
#define FLASH_OBR_IWDG_SW       FLASH_OBR_IWDG_SW_Msk /*!< IWDG SW */
#define FLASH_OBR_nRST_STOP_Pos (9U)
#define FLASH_OBR_nRST_STOP_Msk \
    (0x1U << FLASH_OBR_nRST_STOP_Pos)                    /*!< 0x00000200 */
#define FLASH_OBR_nRST_STOP      FLASH_OBR_nRST_STOP_Msk /*!< nRST_STOP */
#define FLASH_OBR_nRST_STDBY_Pos (10U)
#define FLASH_OBR_nRST_STDBY_Msk \
    (0x1U << FLASH_OBR_nRST_STDBY_Pos)                      /*!< 0x00000400 */
#define FLASH_OBR_nRST_STDBY       FLASH_OBR_nRST_STDBY_Msk /*!< nRST_STDBY */
#define FLASH_OBR_nBOOT1_Pos       (12U)
#define FLASH_OBR_nBOOT1_Msk       (0x1U << FLASH_OBR_nBOOT1_Pos) /*!< 0x00001000 */
#define FLASH_OBR_nBOOT1           FLASH_OBR_nBOOT1_Msk           /*!< nBOOT1 */
#define FLASH_OBR_VDDA_MONITOR_Pos (13U)
#define FLASH_OBR_VDDA_MONITOR_Msk \
    (0x1U << FLASH_OBR_VDDA_MONITOR_Pos) /*!< 0x00002000 */
#define FLASH_OBR_VDDA_MONITOR \
    FLASH_OBR_VDDA_MONITOR_Msk /*!< VDDA power supply supervisor */
#define FLASH_OBR_RAM_PARITY_CHECK_Pos (14U)
#define FLASH_OBR_RAM_PARITY_CHECK_Msk \
    (0x1U << FLASH_OBR_RAM_PARITY_CHECK_Pos) /*!< 0x00004000 */
#define FLASH_OBR_RAM_PARITY_CHECK \
    FLASH_OBR_RAM_PARITY_CHECK_Msk /*!< RAM parity check */
#define FLASH_OBR_DATA0_Pos (16U)
#define FLASH_OBR_DATA0_Msk (0xFFU << FLASH_OBR_DATA0_Pos) /*!< 0x00FF0000 */
#define FLASH_OBR_DATA0     FLASH_OBR_DATA0_Msk            /*!< Data0 */
#define FLASH_OBR_DATA1_Pos (24U)
#define FLASH_OBR_DATA1_Msk (0xFFU << FLASH_OBR_DATA1_Pos) /*!< 0xFF000000 */
#define FLASH_OBR_DATA1     FLASH_OBR_DATA1_Msk            /*!< Data1 */

/* Old BOOT1 bit definition, maintained for legacy purpose */
#define FLASH_OBR_BOOT1 FLASH_OBR_nBOOT1

/* Old OBR_VDDA bit definition, maintained for legacy purpose */
#define FLASH_OBR_VDDA_ANALOG FLASH_OBR_VDDA_MONITOR

/******************  Bit definition for FLASH_WRPR register  ******************/
#define FLASH_WRPR_WRP_Pos (0U)
#define FLASH_WRPR_WRP_Msk (0xFFFFU << FLASH_WRPR_WRP_Pos) /*!< 0x0000FFFF */
#define FLASH_WRPR_WRP     FLASH_WRPR_WRP_Msk              /*!< Write Protect */

/*----------------------------------------------------------------------------*/

/******************  Bit definition for OB_RDP register  **********************/
#define OB_RDP_RDP_Pos  (0U)
#define OB_RDP_RDP_Msk  (0xFFU << OB_RDP_RDP_Pos) /*!< 0x000000FF */
#define OB_RDP_RDP      OB_RDP_RDP_Msk /*!< Read protection option byte */
#define OB_RDP_nRDP_Pos (8U)
#define OB_RDP_nRDP_Msk (0xFFU << OB_RDP_nRDP_Pos) /*!< 0x0000FF00 */
#define OB_RDP_nRDP \
    OB_RDP_nRDP_Msk /*!< Read protection complemented option byte */

/******************  Bit definition for OB_USER register  *********************/
#define OB_USER_USER_Pos  (16U)
#define OB_USER_USER_Msk  (0xFFU << OB_USER_USER_Pos) /*!< 0x00FF0000 */
#define OB_USER_USER      OB_USER_USER_Msk            /*!< User option byte */
#define OB_USER_nUSER_Pos (24U)
#define OB_USER_nUSER_Msk (0xFFU << OB_USER_nUSER_Pos) /*!< 0xFF000000 */
#define OB_USER_nUSER     OB_USER_nUSER_Msk /*!< User complemented option byte */

/******************  Bit definition for OB_WRP0 register  *********************/
#define OB_WRP0_WRP0_Pos (0U)
#define OB_WRP0_WRP0_Msk (0xFFU << OB_WRP0_WRP0_Pos) /*!< 0x000000FF */
#define OB_WRP0_WRP0 \
    OB_WRP0_WRP0_Msk /*!< Flash memory write protection option bytes */
#define OB_WRP0_nWRP0_Pos (8U)
#define OB_WRP0_nWRP0_Msk (0xFFU << OB_WRP0_nWRP0_Pos) /*!< 0x0000FF00 */
#define OB_WRP0_nWRP0                                                        \
    OB_WRP0_nWRP0_Msk /*!< Flash memory write protection complemented option \
                         bytes */

/******************************************************************************/
/*                                                                            */
/*                       General Purpose IOs (GPIO)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0_Pos (0U)
#define GPIO_MODER_MODER0_Msk                       \
    (0x3U << GPIO_MODER_MODER0_Pos) /*!< 0x00000003 \
                                     */
#define GPIO_MODER_MODER0     GPIO_MODER_MODER0_Msk
#define GPIO_MODER_MODER0_0   (0x1U << GPIO_MODER_MODER0_Pos) /*!< 0x00000001 */
#define GPIO_MODER_MODER0_1   (0x2U << GPIO_MODER_MODER0_Pos) /*!< 0x00000002 */
#define GPIO_MODER_MODER1_Pos (2U)
#define GPIO_MODER_MODER1_Msk                       \
    (0x3U << GPIO_MODER_MODER1_Pos) /*!< 0x0000000C \
                                     */
#define GPIO_MODER_MODER1     GPIO_MODER_MODER1_Msk
#define GPIO_MODER_MODER1_0   (0x1U << GPIO_MODER_MODER1_Pos) /*!< 0x00000004 */
#define GPIO_MODER_MODER1_1   (0x2U << GPIO_MODER_MODER1_Pos) /*!< 0x00000008 */
#define GPIO_MODER_MODER2_Pos (4U)
#define GPIO_MODER_MODER2_Msk                       \
    (0x3U << GPIO_MODER_MODER2_Pos) /*!< 0x00000030 \
                                     */
#define GPIO_MODER_MODER2     GPIO_MODER_MODER2_Msk
#define GPIO_MODER_MODER2_0   (0x1U << GPIO_MODER_MODER2_Pos) /*!< 0x00000010 */
#define GPIO_MODER_MODER2_1   (0x2U << GPIO_MODER_MODER2_Pos) /*!< 0x00000020 */
#define GPIO_MODER_MODER3_Pos (6U)
#define GPIO_MODER_MODER3_Msk                       \
    (0x3U << GPIO_MODER_MODER3_Pos) /*!< 0x000000C0 \
                                     */
#define GPIO_MODER_MODER3     GPIO_MODER_MODER3_Msk
#define GPIO_MODER_MODER3_0   (0x1U << GPIO_MODER_MODER3_Pos) /*!< 0x00000040 */
#define GPIO_MODER_MODER3_1   (0x2U << GPIO_MODER_MODER3_Pos) /*!< 0x00000080 */
#define GPIO_MODER_MODER4_Pos (8U)
#define GPIO_MODER_MODER4_Msk                       \
    (0x3U << GPIO_MODER_MODER4_Pos) /*!< 0x00000300 \
                                     */
#define GPIO_MODER_MODER4     GPIO_MODER_MODER4_Msk
#define GPIO_MODER_MODER4_0   (0x1U << GPIO_MODER_MODER4_Pos) /*!< 0x00000100 */
#define GPIO_MODER_MODER4_1   (0x2U << GPIO_MODER_MODER4_Pos) /*!< 0x00000200 */
#define GPIO_MODER_MODER5_Pos (10U)
#define GPIO_MODER_MODER5_Msk                       \
    (0x3U << GPIO_MODER_MODER5_Pos) /*!< 0x00000C00 \
                                     */
#define GPIO_MODER_MODER5     GPIO_MODER_MODER5_Msk
#define GPIO_MODER_MODER5_0   (0x1U << GPIO_MODER_MODER5_Pos) /*!< 0x00000400 */
#define GPIO_MODER_MODER5_1   (0x2U << GPIO_MODER_MODER5_Pos) /*!< 0x00000800 */
#define GPIO_MODER_MODER6_Pos (12U)
#define GPIO_MODER_MODER6_Msk                       \
    (0x3U << GPIO_MODER_MODER6_Pos) /*!< 0x00003000 \
                                     */
#define GPIO_MODER_MODER6     GPIO_MODER_MODER6_Msk
#define GPIO_MODER_MODER6_0   (0x1U << GPIO_MODER_MODER6_Pos) /*!< 0x00001000 */
#define GPIO_MODER_MODER6_1   (0x2U << GPIO_MODER_MODER6_Pos) /*!< 0x00002000 */
#define GPIO_MODER_MODER7_Pos (14U)
#define GPIO_MODER_MODER7_Msk                       \
    (0x3U << GPIO_MODER_MODER7_Pos) /*!< 0x0000C000 \
                                     */
#define GPIO_MODER_MODER7     GPIO_MODER_MODER7_Msk
#define GPIO_MODER_MODER7_0   (0x1U << GPIO_MODER_MODER7_Pos) /*!< 0x00004000 */
#define GPIO_MODER_MODER7_1   (0x2U << GPIO_MODER_MODER7_Pos) /*!< 0x00008000 */
#define GPIO_MODER_MODER8_Pos (16U)
#define GPIO_MODER_MODER8_Msk                       \
    (0x3U << GPIO_MODER_MODER8_Pos) /*!< 0x00030000 \
                                     */
#define GPIO_MODER_MODER8     GPIO_MODER_MODER8_Msk
#define GPIO_MODER_MODER8_0   (0x1U << GPIO_MODER_MODER8_Pos) /*!< 0x00010000 */
#define GPIO_MODER_MODER8_1   (0x2U << GPIO_MODER_MODER8_Pos) /*!< 0x00020000 */
#define GPIO_MODER_MODER9_Pos (18U)
#define GPIO_MODER_MODER9_Msk                       \
    (0x3U << GPIO_MODER_MODER9_Pos) /*!< 0x000C0000 \
                                     */
#define GPIO_MODER_MODER9      GPIO_MODER_MODER9_Msk
#define GPIO_MODER_MODER9_0    (0x1U << GPIO_MODER_MODER9_Pos) /*!< 0x00040000 */
#define GPIO_MODER_MODER9_1    (0x2U << GPIO_MODER_MODER9_Pos) /*!< 0x00080000 */
#define GPIO_MODER_MODER10_Pos (20U)
#define GPIO_MODER_MODER10_Msk \
    (0x3U << GPIO_MODER_MODER10_Pos) /*!< 0x00300000 */
#define GPIO_MODER_MODER10 GPIO_MODER_MODER10_Msk
#define GPIO_MODER_MODER10_0                         \
    (0x1U << GPIO_MODER_MODER10_Pos) /*!< 0x00100000 \
                                      */
#define GPIO_MODER_MODER10_1                         \
    (0x2U << GPIO_MODER_MODER10_Pos) /*!< 0x00200000 \
                                      */
#define GPIO_MODER_MODER11_Pos (22U)
#define GPIO_MODER_MODER11_Msk \
    (0x3U << GPIO_MODER_MODER11_Pos) /*!< 0x00C00000 */
#define GPIO_MODER_MODER11 GPIO_MODER_MODER11_Msk
#define GPIO_MODER_MODER11_0                         \
    (0x1U << GPIO_MODER_MODER11_Pos) /*!< 0x00400000 \
                                      */
#define GPIO_MODER_MODER11_1                         \
    (0x2U << GPIO_MODER_MODER11_Pos) /*!< 0x00800000 \
                                      */
#define GPIO_MODER_MODER12_Pos (24U)
#define GPIO_MODER_MODER12_Msk \
    (0x3U << GPIO_MODER_MODER12_Pos) /*!< 0x03000000 */
#define GPIO_MODER_MODER12 GPIO_MODER_MODER12_Msk
#define GPIO_MODER_MODER12_0                         \
    (0x1U << GPIO_MODER_MODER12_Pos) /*!< 0x01000000 \
                                      */
#define GPIO_MODER_MODER12_1                         \
    (0x2U << GPIO_MODER_MODER12_Pos) /*!< 0x02000000 \
                                      */
#define GPIO_MODER_MODER13_Pos (26U)
#define GPIO_MODER_MODER13_Msk \
    (0x3U << GPIO_MODER_MODER13_Pos) /*!< 0x0C000000 */
#define GPIO_MODER_MODER13 GPIO_MODER_MODER13_Msk
#define GPIO_MODER_MODER13_0                         \
    (0x1U << GPIO_MODER_MODER13_Pos) /*!< 0x04000000 \
                                      */
#define GPIO_MODER_MODER13_1                         \
    (0x2U << GPIO_MODER_MODER13_Pos) /*!< 0x08000000 \
                                      */
#define GPIO_MODER_MODER14_Pos (28U)
#define GPIO_MODER_MODER14_Msk \
    (0x3U << GPIO_MODER_MODER14_Pos) /*!< 0x30000000 */
#define GPIO_MODER_MODER14 GPIO_MODER_MODER14_Msk
#define GPIO_MODER_MODER14_0                         \
    (0x1U << GPIO_MODER_MODER14_Pos) /*!< 0x10000000 \
                                      */
#define GPIO_MODER_MODER14_1                         \
    (0x2U << GPIO_MODER_MODER14_Pos) /*!< 0x20000000 \
                                      */
#define GPIO_MODER_MODER15_Pos (30U)
#define GPIO_MODER_MODER15_Msk \
    (0x3U << GPIO_MODER_MODER15_Pos) /*!< 0xC0000000 */
#define GPIO_MODER_MODER15 GPIO_MODER_MODER15_Msk
#define GPIO_MODER_MODER15_0                         \
    (0x1U << GPIO_MODER_MODER15_Pos) /*!< 0x40000000 \
                                      */
#define GPIO_MODER_MODER15_1                         \
    (0x2U << GPIO_MODER_MODER15_Pos) /*!< 0x80000000 \
                                      */

