niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************  Bit definition for GPIO_OTYPER register  *****************/
#define GPIO_OTYPER_OT_0  (0x00000001U)
#define GPIO_OTYPER_OT_1  (0x00000002U)
#define GPIO_OTYPER_OT_2  (0x00000004U)
#define GPIO_OTYPER_OT_3  (0x00000008U)
#define GPIO_OTYPER_OT_4  (0x00000010U)
#define GPIO_OTYPER_OT_5  (0x00000020U)
#define GPIO_OTYPER_OT_6  (0x00000040U)
#define GPIO_OTYPER_OT_7  (0x00000080U)
#define GPIO_OTYPER_OT_8  (0x00000100U)
#define GPIO_OTYPER_OT_9  (0x00000200U)
#define GPIO_OTYPER_OT_10 (0x00000400U)
#define GPIO_OTYPER_OT_11 (0x00000800U)
#define GPIO_OTYPER_OT_12 (0x00001000U)
#define GPIO_OTYPER_OT_13 (0x00002000U)
#define GPIO_OTYPER_OT_14 (0x00004000U)
#define GPIO_OTYPER_OT_15 (0x00008000U)

/****************  Bit definition for GPIO_OSPEEDR register  ******************/
#define GPIO_OSPEEDR_OSPEEDR0_Pos (0U)
#define GPIO_OSPEEDR_OSPEEDR0_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR0_Pos) /*!< 0x00000003 */
#define GPIO_OSPEEDR_OSPEEDR0 GPIO_OSPEEDR_OSPEEDR0_Msk
#define GPIO_OSPEEDR_OSPEEDR0_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR0_Pos) /*!< 0x00000001 */
#define GPIO_OSPEEDR_OSPEEDR0_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR0_Pos) /*!< 0x00000002 */
#define GPIO_OSPEEDR_OSPEEDR1_Pos (2U)
#define GPIO_OSPEEDR_OSPEEDR1_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR1_Pos) /*!< 0x0000000C */
#define GPIO_OSPEEDR_OSPEEDR1 GPIO_OSPEEDR_OSPEEDR1_Msk
#define GPIO_OSPEEDR_OSPEEDR1_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR1_Pos) /*!< 0x00000004 */
#define GPIO_OSPEEDR_OSPEEDR1_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR1_Pos) /*!< 0x00000008 */
#define GPIO_OSPEEDR_OSPEEDR2_Pos (4U)
#define GPIO_OSPEEDR_OSPEEDR2_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR2_Pos) /*!< 0x00000030 */
#define GPIO_OSPEEDR_OSPEEDR2 GPIO_OSPEEDR_OSPEEDR2_Msk
#define GPIO_OSPEEDR_OSPEEDR2_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR2_Pos) /*!< 0x00000010 */
#define GPIO_OSPEEDR_OSPEEDR2_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR2_Pos) /*!< 0x00000020 */
#define GPIO_OSPEEDR_OSPEEDR3_Pos (6U)
#define GPIO_OSPEEDR_OSPEEDR3_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR3_Pos) /*!< 0x000000C0 */
#define GPIO_OSPEEDR_OSPEEDR3 GPIO_OSPEEDR_OSPEEDR3_Msk
#define GPIO_OSPEEDR_OSPEEDR3_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR3_Pos) /*!< 0x00000040 */
#define GPIO_OSPEEDR_OSPEEDR3_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR3_Pos) /*!< 0x00000080 */
#define GPIO_OSPEEDR_OSPEEDR4_Pos (8U)
#define GPIO_OSPEEDR_OSPEEDR4_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR4_Pos) /*!< 0x00000300 */
#define GPIO_OSPEEDR_OSPEEDR4 GPIO_OSPEEDR_OSPEEDR4_Msk
#define GPIO_OSPEEDR_OSPEEDR4_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR4_Pos) /*!< 0x00000100 */
#define GPIO_OSPEEDR_OSPEEDR4_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR4_Pos) /*!< 0x00000200 */
#define GPIO_OSPEEDR_OSPEEDR5_Pos (10U)
#define GPIO_OSPEEDR_OSPEEDR5_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR5_Pos) /*!< 0x00000C00 */
#define GPIO_OSPEEDR_OSPEEDR5 GPIO_OSPEEDR_OSPEEDR5_Msk
#define GPIO_OSPEEDR_OSPEEDR5_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR5_Pos) /*!< 0x00000400 */
#define GPIO_OSPEEDR_OSPEEDR5_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR5_Pos) /*!< 0x00000800 */
#define GPIO_OSPEEDR_OSPEEDR6_Pos (12U)
#define GPIO_OSPEEDR_OSPEEDR6_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR6_Pos) /*!< 0x00003000 */
#define GPIO_OSPEEDR_OSPEEDR6 GPIO_OSPEEDR_OSPEEDR6_Msk
#define GPIO_OSPEEDR_OSPEEDR6_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR6_Pos) /*!< 0x00001000 */
#define GPIO_OSPEEDR_OSPEEDR6_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR6_Pos) /*!< 0x00002000 */
#define GPIO_OSPEEDR_OSPEEDR7_Pos (14U)
#define GPIO_OSPEEDR_OSPEEDR7_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR7_Pos) /*!< 0x0000C000 */
#define GPIO_OSPEEDR_OSPEEDR7 GPIO_OSPEEDR_OSPEEDR7_Msk
#define GPIO_OSPEEDR_OSPEEDR7_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR7_Pos) /*!< 0x00004000 */
#define GPIO_OSPEEDR_OSPEEDR7_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR7_Pos) /*!< 0x00008000 */
#define GPIO_OSPEEDR_OSPEEDR8_Pos (16U)
#define GPIO_OSPEEDR_OSPEEDR8_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR8_Pos) /*!< 0x00030000 */
#define GPIO_OSPEEDR_OSPEEDR8 GPIO_OSPEEDR_OSPEEDR8_Msk
#define GPIO_OSPEEDR_OSPEEDR8_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR8_Pos) /*!< 0x00010000 */
#define GPIO_OSPEEDR_OSPEEDR8_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR8_Pos) /*!< 0x00020000 */
#define GPIO_OSPEEDR_OSPEEDR9_Pos (18U)
#define GPIO_OSPEEDR_OSPEEDR9_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR9_Pos) /*!< 0x000C0000 */
#define GPIO_OSPEEDR_OSPEEDR9 GPIO_OSPEEDR_OSPEEDR9_Msk
#define GPIO_OSPEEDR_OSPEEDR9_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR9_Pos) /*!< 0x00040000 */
#define GPIO_OSPEEDR_OSPEEDR9_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR9_Pos) /*!< 0x00080000 */
#define GPIO_OSPEEDR_OSPEEDR10_Pos (20U)
#define GPIO_OSPEEDR_OSPEEDR10_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR10_Pos) /*!< 0x00300000 */
#define GPIO_OSPEEDR_OSPEEDR10 GPIO_OSPEEDR_OSPEEDR10_Msk
#define GPIO_OSPEEDR_OSPEEDR10_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR10_Pos) /*!< 0x00100000 */
#define GPIO_OSPEEDR_OSPEEDR10_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR10_Pos) /*!< 0x00200000 */
#define GPIO_OSPEEDR_OSPEEDR11_Pos (22U)
#define GPIO_OSPEEDR_OSPEEDR11_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR11_Pos) /*!< 0x00C00000 */
#define GPIO_OSPEEDR_OSPEEDR11 GPIO_OSPEEDR_OSPEEDR11_Msk
#define GPIO_OSPEEDR_OSPEEDR11_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR11_Pos) /*!< 0x00400000 */
#define GPIO_OSPEEDR_OSPEEDR11_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR11_Pos) /*!< 0x00800000 */
#define GPIO_OSPEEDR_OSPEEDR12_Pos (24U)
#define GPIO_OSPEEDR_OSPEEDR12_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR12_Pos) /*!< 0x03000000 */
#define GPIO_OSPEEDR_OSPEEDR12 GPIO_OSPEEDR_OSPEEDR12_Msk
#define GPIO_OSPEEDR_OSPEEDR12_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR12_Pos) /*!< 0x01000000 */
#define GPIO_OSPEEDR_OSPEEDR12_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR12_Pos) /*!< 0x02000000 */
#define GPIO_OSPEEDR_OSPEEDR13_Pos (26U)
#define GPIO_OSPEEDR_OSPEEDR13_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR13_Pos) /*!< 0x0C000000 */
#define GPIO_OSPEEDR_OSPEEDR13 GPIO_OSPEEDR_OSPEEDR13_Msk
#define GPIO_OSPEEDR_OSPEEDR13_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR13_Pos) /*!< 0x04000000 */
#define GPIO_OSPEEDR_OSPEEDR13_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR13_Pos) /*!< 0x08000000 */
#define GPIO_OSPEEDR_OSPEEDR14_Pos (28U)
#define GPIO_OSPEEDR_OSPEEDR14_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR14_Pos) /*!< 0x30000000 */
#define GPIO_OSPEEDR_OSPEEDR14 GPIO_OSPEEDR_OSPEEDR14_Msk
#define GPIO_OSPEEDR_OSPEEDR14_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR14_Pos) /*!< 0x10000000 */
#define GPIO_OSPEEDR_OSPEEDR14_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR14_Pos) /*!< 0x20000000 */
#define GPIO_OSPEEDR_OSPEEDR15_Pos (30U)
#define GPIO_OSPEEDR_OSPEEDR15_Msk \
    (0x3U << GPIO_OSPEEDR_OSPEEDR15_Pos) /*!< 0xC0000000 */
#define GPIO_OSPEEDR_OSPEEDR15 GPIO_OSPEEDR_OSPEEDR15_Msk
#define GPIO_OSPEEDR_OSPEEDR15_0 \
    (0x1U << GPIO_OSPEEDR_OSPEEDR15_Pos) /*!< 0x40000000 */
#define GPIO_OSPEEDR_OSPEEDR15_1 \
    (0x2U << GPIO_OSPEEDR_OSPEEDR15_Pos) /*!< 0x80000000 */

/* Old Bit definition for GPIO_OSPEEDR register maintained for legacy purpose */
#define GPIO_OSPEEDER_OSPEEDR0    GPIO_OSPEEDR_OSPEEDR0
#define GPIO_OSPEEDER_OSPEEDR0_0  GPIO_OSPEEDR_OSPEEDR0_0
#define GPIO_OSPEEDER_OSPEEDR0_1  GPIO_OSPEEDR_OSPEEDR0_1
#define GPIO_OSPEEDER_OSPEEDR1    GPIO_OSPEEDR_OSPEEDR1
#define GPIO_OSPEEDER_OSPEEDR1_0  GPIO_OSPEEDR_OSPEEDR1_0
#define GPIO_OSPEEDER_OSPEEDR1_1  GPIO_OSPEEDR_OSPEEDR1_1
#define GPIO_OSPEEDER_OSPEEDR2    GPIO_OSPEEDR_OSPEEDR2
#define GPIO_OSPEEDER_OSPEEDR2_0  GPIO_OSPEEDR_OSPEEDR2_0
#define GPIO_OSPEEDER_OSPEEDR2_1  GPIO_OSPEEDR_OSPEEDR2_1
#define GPIO_OSPEEDER_OSPEEDR3    GPIO_OSPEEDR_OSPEEDR3
#define GPIO_OSPEEDER_OSPEEDR3_0  GPIO_OSPEEDR_OSPEEDR3_0
#define GPIO_OSPEEDER_OSPEEDR3_1  GPIO_OSPEEDR_OSPEEDR3_1
#define GPIO_OSPEEDER_OSPEEDR4    GPIO_OSPEEDR_OSPEEDR4
#define GPIO_OSPEEDER_OSPEEDR4_0  GPIO_OSPEEDR_OSPEEDR4_0
#define GPIO_OSPEEDER_OSPEEDR4_1  GPIO_OSPEEDR_OSPEEDR4_1
#define GPIO_OSPEEDER_OSPEEDR5    GPIO_OSPEEDR_OSPEEDR5
#define GPIO_OSPEEDER_OSPEEDR5_0  GPIO_OSPEEDR_OSPEEDR5_0
#define GPIO_OSPEEDER_OSPEEDR5_1  GPIO_OSPEEDR_OSPEEDR5_1
#define GPIO_OSPEEDER_OSPEEDR6    GPIO_OSPEEDR_OSPEEDR6
#define GPIO_OSPEEDER_OSPEEDR6_0  GPIO_OSPEEDR_OSPEEDR6_0
#define GPIO_OSPEEDER_OSPEEDR6_1  GPIO_OSPEEDR_OSPEEDR6_1
#define GPIO_OSPEEDER_OSPEEDR7    GPIO_OSPEEDR_OSPEEDR7
#define GPIO_OSPEEDER_OSPEEDR7_0  GPIO_OSPEEDR_OSPEEDR7_0
#define GPIO_OSPEEDER_OSPEEDR7_1  GPIO_OSPEEDR_OSPEEDR7_1
#define GPIO_OSPEEDER_OSPEEDR8    GPIO_OSPEEDR_OSPEEDR8
#define GPIO_OSPEEDER_OSPEEDR8_0  GPIO_OSPEEDR_OSPEEDR8_0
#define GPIO_OSPEEDER_OSPEEDR8_1  GPIO_OSPEEDR_OSPEEDR8_1
#define GPIO_OSPEEDER_OSPEEDR9    GPIO_OSPEEDR_OSPEEDR9
#define GPIO_OSPEEDER_OSPEEDR9_0  GPIO_OSPEEDR_OSPEEDR9_0
#define GPIO_OSPEEDER_OSPEEDR9_1  GPIO_OSPEEDR_OSPEEDR9_1
#define GPIO_OSPEEDER_OSPEEDR10   GPIO_OSPEEDR_OSPEEDR10
#define GPIO_OSPEEDER_OSPEEDR10_0 GPIO_OSPEEDR_OSPEEDR10_0
#define GPIO_OSPEEDER_OSPEEDR10_1 GPIO_OSPEEDR_OSPEEDR10_1
#define GPIO_OSPEEDER_OSPEEDR11   GPIO_OSPEEDR_OSPEEDR11
#define GPIO_OSPEEDER_OSPEEDR11_0 GPIO_OSPEEDR_OSPEEDR11_0
#define GPIO_OSPEEDER_OSPEEDR11_1 GPIO_OSPEEDR_OSPEEDR11_1
#define GPIO_OSPEEDER_OSPEEDR12   GPIO_OSPEEDR_OSPEEDR12
#define GPIO_OSPEEDER_OSPEEDR12_0 GPIO_OSPEEDR_OSPEEDR12_0
#define GPIO_OSPEEDER_OSPEEDR12_1 GPIO_OSPEEDR_OSPEEDR12_1
#define GPIO_OSPEEDER_OSPEEDR13   GPIO_OSPEEDR_OSPEEDR13
#define GPIO_OSPEEDER_OSPEEDR13_0 GPIO_OSPEEDR_OSPEEDR13_0
#define GPIO_OSPEEDER_OSPEEDR13_1 GPIO_OSPEEDR_OSPEEDR13_1
#define GPIO_OSPEEDER_OSPEEDR14   GPIO_OSPEEDR_OSPEEDR14
#define GPIO_OSPEEDER_OSPEEDR14_0 GPIO_OSPEEDR_OSPEEDR14_0
#define GPIO_OSPEEDER_OSPEEDR14_1 GPIO_OSPEEDR_OSPEEDR14_1
#define GPIO_OSPEEDER_OSPEEDR15   GPIO_OSPEEDR_OSPEEDR15
#define GPIO_OSPEEDER_OSPEEDR15_0 GPIO_OSPEEDR_OSPEEDR15_0
#define GPIO_OSPEEDER_OSPEEDR15_1 GPIO_OSPEEDR_OSPEEDR15_1

/*******************  Bit definition for GPIO_PUPDR register ******************/
#define GPIO_PUPDR_PUPDR0_Pos (0U)
#define GPIO_PUPDR_PUPDR0_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR0_Pos) /*!< 0x00000003 \
                                     */
#define GPIO_PUPDR_PUPDR0     GPIO_PUPDR_PUPDR0_Msk
#define GPIO_PUPDR_PUPDR0_0   (0x1U << GPIO_PUPDR_PUPDR0_Pos) /*!< 0x00000001 */
#define GPIO_PUPDR_PUPDR0_1   (0x2U << GPIO_PUPDR_PUPDR0_Pos) /*!< 0x00000002 */
#define GPIO_PUPDR_PUPDR1_Pos (2U)
#define GPIO_PUPDR_PUPDR1_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR1_Pos) /*!< 0x0000000C \
                                     */
#define GPIO_PUPDR_PUPDR1     GPIO_PUPDR_PUPDR1_Msk
#define GPIO_PUPDR_PUPDR1_0   (0x1U << GPIO_PUPDR_PUPDR1_Pos) /*!< 0x00000004 */
#define GPIO_PUPDR_PUPDR1_1   (0x2U << GPIO_PUPDR_PUPDR1_Pos) /*!< 0x00000008 */
#define GPIO_PUPDR_PUPDR2_Pos (4U)
#define GPIO_PUPDR_PUPDR2_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR2_Pos) /*!< 0x00000030 \
                                     */
#define GPIO_PUPDR_PUPDR2     GPIO_PUPDR_PUPDR2_Msk
#define GPIO_PUPDR_PUPDR2_0   (0x1U << GPIO_PUPDR_PUPDR2_Pos) /*!< 0x00000010 */
#define GPIO_PUPDR_PUPDR2_1   (0x2U << GPIO_PUPDR_PUPDR2_Pos) /*!< 0x00000020 */
#define GPIO_PUPDR_PUPDR3_Pos (6U)
#define GPIO_PUPDR_PUPDR3_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR3_Pos) /*!< 0x000000C0 \
                                     */
#define GPIO_PUPDR_PUPDR3     GPIO_PUPDR_PUPDR3_Msk
#define GPIO_PUPDR_PUPDR3_0   (0x1U << GPIO_PUPDR_PUPDR3_Pos) /*!< 0x00000040 */
#define GPIO_PUPDR_PUPDR3_1   (0x2U << GPIO_PUPDR_PUPDR3_Pos) /*!< 0x00000080 */
#define GPIO_PUPDR_PUPDR4_Pos (8U)
#define GPIO_PUPDR_PUPDR4_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR4_Pos) /*!< 0x00000300 \
                                     */
#define GPIO_PUPDR_PUPDR4     GPIO_PUPDR_PUPDR4_Msk
#define GPIO_PUPDR_PUPDR4_0   (0x1U << GPIO_PUPDR_PUPDR4_Pos) /*!< 0x00000100 */
#define GPIO_PUPDR_PUPDR4_1   (0x2U << GPIO_PUPDR_PUPDR4_Pos) /*!< 0x00000200 */
#define GPIO_PUPDR_PUPDR5_Pos (10U)
#define GPIO_PUPDR_PUPDR5_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR5_Pos) /*!< 0x00000C00 \
                                     */
#define GPIO_PUPDR_PUPDR5     GPIO_PUPDR_PUPDR5_Msk
#define GPIO_PUPDR_PUPDR5_0   (0x1U << GPIO_PUPDR_PUPDR5_Pos) /*!< 0x00000400 */
#define GPIO_PUPDR_PUPDR5_1   (0x2U << GPIO_PUPDR_PUPDR5_Pos) /*!< 0x00000800 */
#define GPIO_PUPDR_PUPDR6_Pos (12U)
#define GPIO_PUPDR_PUPDR6_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR6_Pos) /*!< 0x00003000 \
                                     */
#define GPIO_PUPDR_PUPDR6     GPIO_PUPDR_PUPDR6_Msk
#define GPIO_PUPDR_PUPDR6_0   (0x1U << GPIO_PUPDR_PUPDR6_Pos) /*!< 0x00001000 */
#define GPIO_PUPDR_PUPDR6_1   (0x2U << GPIO_PUPDR_PUPDR6_Pos) /*!< 0x00002000 */
#define GPIO_PUPDR_PUPDR7_Pos (14U)
#define GPIO_PUPDR_PUPDR7_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR7_Pos) /*!< 0x0000C000 \
                                     */
#define GPIO_PUPDR_PUPDR7     GPIO_PUPDR_PUPDR7_Msk
#define GPIO_PUPDR_PUPDR7_0   (0x1U << GPIO_PUPDR_PUPDR7_Pos) /*!< 0x00004000 */
#define GPIO_PUPDR_PUPDR7_1   (0x2U << GPIO_PUPDR_PUPDR7_Pos) /*!< 0x00008000 */
#define GPIO_PUPDR_PUPDR8_Pos (16U)
#define GPIO_PUPDR_PUPDR8_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR8_Pos) /*!< 0x00030000 \
                                     */
#define GPIO_PUPDR_PUPDR8     GPIO_PUPDR_PUPDR8_Msk
#define GPIO_PUPDR_PUPDR8_0   (0x1U << GPIO_PUPDR_PUPDR8_Pos) /*!< 0x00010000 */
#define GPIO_PUPDR_PUPDR8_1   (0x2U << GPIO_PUPDR_PUPDR8_Pos) /*!< 0x00020000 */
#define GPIO_PUPDR_PUPDR9_Pos (18U)
#define GPIO_PUPDR_PUPDR9_Msk                       \
    (0x3U << GPIO_PUPDR_PUPDR9_Pos) /*!< 0x000C0000 \
                                     */
#define GPIO_PUPDR_PUPDR9      GPIO_PUPDR_PUPDR9_Msk
#define GPIO_PUPDR_PUPDR9_0    (0x1U << GPIO_PUPDR_PUPDR9_Pos) /*!< 0x00040000 */
#define GPIO_PUPDR_PUPDR9_1    (0x2U << GPIO_PUPDR_PUPDR9_Pos) /*!< 0x00080000 */
#define GPIO_PUPDR_PUPDR10_Pos (20U)
#define GPIO_PUPDR_PUPDR10_Msk \
    (0x3U << GPIO_PUPDR_PUPDR10_Pos) /*!< 0x00300000 */
#define GPIO_PUPDR_PUPDR10 GPIO_PUPDR_PUPDR10_Msk
#define GPIO_PUPDR_PUPDR10_0                         \
    (0x1U << GPIO_PUPDR_PUPDR10_Pos) /*!< 0x00100000 \
                                      */
#define GPIO_PUPDR_PUPDR10_1                         \
    (0x2U << GPIO_PUPDR_PUPDR10_Pos) /*!< 0x00200000 \
                                      */
#define GPIO_PUPDR_PUPDR11_Pos (22U)
#define GPIO_PUPDR_PUPDR11_Msk \
    (0x3U << GPIO_PUPDR_PUPDR11_Pos) /*!< 0x00C00000 */
#define GPIO_PUPDR_PUPDR11 GPIO_PUPDR_PUPDR11_Msk
#define GPIO_PUPDR_PUPDR11_0                         \
    (0x1U << GPIO_PUPDR_PUPDR11_Pos) /*!< 0x00400000 \
                                      */
#define GPIO_PUPDR_PUPDR11_1                         \
    (0x2U << GPIO_PUPDR_PUPDR11_Pos) /*!< 0x00800000 \
                                      */
#define GPIO_PUPDR_PUPDR12_Pos (24U)
#define GPIO_PUPDR_PUPDR12_Msk \
    (0x3U << GPIO_PUPDR_PUPDR12_Pos) /*!< 0x03000000 */
#define GPIO_PUPDR_PUPDR12 GPIO_PUPDR_PUPDR12_Msk
#define GPIO_PUPDR_PUPDR12_0                         \
    (0x1U << GPIO_PUPDR_PUPDR12_Pos) /*!< 0x01000000 \
                                      */
#define GPIO_PUPDR_PUPDR12_1                         \
    (0x2U << GPIO_PUPDR_PUPDR12_Pos) /*!< 0x02000000 \
                                      */
#define GPIO_PUPDR_PUPDR13_Pos (26U)
#define GPIO_PUPDR_PUPDR13_Msk \
    (0x3U << GPIO_PUPDR_PUPDR13_Pos) /*!< 0x0C000000 */
#define GPIO_PUPDR_PUPDR13 GPIO_PUPDR_PUPDR13_Msk
#define GPIO_PUPDR_PUPDR13_0                         \
    (0x1U << GPIO_PUPDR_PUPDR13_Pos) /*!< 0x04000000 \
                                      */
#define GPIO_PUPDR_PUPDR13_1                         \
    (0x2U << GPIO_PUPDR_PUPDR13_Pos) /*!< 0x08000000 \
                                      */
#define GPIO_PUPDR_PUPDR14_Pos (28U)
#define GPIO_PUPDR_PUPDR14_Msk \
    (0x3U << GPIO_PUPDR_PUPDR14_Pos) /*!< 0x30000000 */
#define GPIO_PUPDR_PUPDR14 GPIO_PUPDR_PUPDR14_Msk
#define GPIO_PUPDR_PUPDR14_0                         \
    (0x1U << GPIO_PUPDR_PUPDR14_Pos) /*!< 0x10000000 \
                                      */
#define GPIO_PUPDR_PUPDR14_1                         \
    (0x2U << GPIO_PUPDR_PUPDR14_Pos) /*!< 0x20000000 \
                                      */
#define GPIO_PUPDR_PUPDR15_Pos (30U)
#define GPIO_PUPDR_PUPDR15_Msk \
    (0x3U << GPIO_PUPDR_PUPDR15_Pos) /*!< 0xC0000000 */
#define GPIO_PUPDR_PUPDR15 GPIO_PUPDR_PUPDR15_Msk
#define GPIO_PUPDR_PUPDR15_0                         \
    (0x1U << GPIO_PUPDR_PUPDR15_Pos) /*!< 0x40000000 \
                                      */
#define GPIO_PUPDR_PUPDR15_1                         \
    (0x2U << GPIO_PUPDR_PUPDR15_Pos) /*!< 0x80000000 \
                                      */

/*******************  Bit definition for GPIO_IDR register  *******************/
#define GPIO_IDR_0  (0x00000001U)
#define GPIO_IDR_1  (0x00000002U)
#define GPIO_IDR_2  (0x00000004U)
#define GPIO_IDR_3  (0x00000008U)
#define GPIO_IDR_4  (0x00000010U)
#define GPIO_IDR_5  (0x00000020U)
#define GPIO_IDR_6  (0x00000040U)
#define GPIO_IDR_7  (0x00000080U)
#define GPIO_IDR_8  (0x00000100U)
#define GPIO_IDR_9  (0x00000200U)
#define GPIO_IDR_10 (0x00000400U)
#define GPIO_IDR_11 (0x00000800U)
#define GPIO_IDR_12 (0x00001000U)
#define GPIO_IDR_13 (0x00002000U)
#define GPIO_IDR_14 (0x00004000U)
#define GPIO_IDR_15 (0x00008000U)

/******************  Bit definition for GPIO_ODR register  ********************/
#define GPIO_ODR_0  (0x00000001U)
#define GPIO_ODR_1  (0x00000002U)
#define GPIO_ODR_2  (0x00000004U)
#define GPIO_ODR_3  (0x00000008U)
#define GPIO_ODR_4  (0x00000010U)
#define GPIO_ODR_5  (0x00000020U)
#define GPIO_ODR_6  (0x00000040U)
#define GPIO_ODR_7  (0x00000080U)
#define GPIO_ODR_8  (0x00000100U)
#define GPIO_ODR_9  (0x00000200U)
#define GPIO_ODR_10 (0x00000400U)
#define GPIO_ODR_11 (0x00000800U)
#define GPIO_ODR_12 (0x00001000U)
#define GPIO_ODR_13 (0x00002000U)
#define GPIO_ODR_14 (0x00004000U)
#define GPIO_ODR_15 (0x00008000U)

/****************** Bit definition for GPIO_BSRR register  ********************/
#define GPIO_BSRR_BS_0  (0x00000001U)
#define GPIO_BSRR_BS_1  (0x00000002U)
#define GPIO_BSRR_BS_2  (0x00000004U)
#define GPIO_BSRR_BS_3  (0x00000008U)
#define GPIO_BSRR_BS_4  (0x00000010U)
#define GPIO_BSRR_BS_5  (0x00000020U)
#define GPIO_BSRR_BS_6  (0x00000040U)
#define GPIO_BSRR_BS_7  (0x00000080U)
#define GPIO_BSRR_BS_8  (0x00000100U)
#define GPIO_BSRR_BS_9  (0x00000200U)
#define GPIO_BSRR_BS_10 (0x00000400U)
#define GPIO_BSRR_BS_11 (0x00000800U)
#define GPIO_BSRR_BS_12 (0x00001000U)
#define GPIO_BSRR_BS_13 (0x00002000U)
#define GPIO_BSRR_BS_14 (0x00004000U)
#define GPIO_BSRR_BS_15 (0x00008000U)
#define GPIO_BSRR_BR_0  (0x00010000U)
#define GPIO_BSRR_BR_1  (0x00020000U)
#define GPIO_BSRR_BR_2  (0x00040000U)
#define GPIO_BSRR_BR_3  (0x00080000U)
#define GPIO_BSRR_BR_4  (0x00100000U)
#define GPIO_BSRR_BR_5  (0x00200000U)
#define GPIO_BSRR_BR_6  (0x00400000U)
#define GPIO_BSRR_BR_7  (0x00800000U)
#define GPIO_BSRR_BR_8  (0x01000000U)
#define GPIO_BSRR_BR_9  (0x02000000U)
#define GPIO_BSRR_BR_10 (0x04000000U)
#define GPIO_BSRR_BR_11 (0x08000000U)
#define GPIO_BSRR_BR_12 (0x10000000U)
#define GPIO_BSRR_BR_13 (0x20000000U)
#define GPIO_BSRR_BR_14 (0x40000000U)
#define GPIO_BSRR_BR_15 (0x80000000U)

/****************** Bit definition for GPIO_LCKR register  ********************/
#define GPIO_LCKR_LCK0_Pos  (0U)
#define GPIO_LCKR_LCK0_Msk  (0x1U << GPIO_LCKR_LCK0_Pos) /*!< 0x00000001 */
#define GPIO_LCKR_LCK0      GPIO_LCKR_LCK0_Msk
#define GPIO_LCKR_LCK1_Pos  (1U)
#define GPIO_LCKR_LCK1_Msk  (0x1U << GPIO_LCKR_LCK1_Pos) /*!< 0x00000002 */
#define GPIO_LCKR_LCK1      GPIO_LCKR_LCK1_Msk
#define GPIO_LCKR_LCK2_Pos  (2U)
#define GPIO_LCKR_LCK2_Msk  (0x1U << GPIO_LCKR_LCK2_Pos) /*!< 0x00000004 */
#define GPIO_LCKR_LCK2      GPIO_LCKR_LCK2_Msk
#define GPIO_LCKR_LCK3_Pos  (3U)
#define GPIO_LCKR_LCK3_Msk  (0x1U << GPIO_LCKR_LCK3_Pos) /*!< 0x00000008 */
#define GPIO_LCKR_LCK3      GPIO_LCKR_LCK3_Msk
#define GPIO_LCKR_LCK4_Pos  (4U)
#define GPIO_LCKR_LCK4_Msk  (0x1U << GPIO_LCKR_LCK4_Pos) /*!< 0x00000010 */
#define GPIO_LCKR_LCK4      GPIO_LCKR_LCK4_Msk
#define GPIO_LCKR_LCK5_Pos  (5U)
#define GPIO_LCKR_LCK5_Msk  (0x1U << GPIO_LCKR_LCK5_Pos) /*!< 0x00000020 */
#define GPIO_LCKR_LCK5      GPIO_LCKR_LCK5_Msk
#define GPIO_LCKR_LCK6_Pos  (6U)
#define GPIO_LCKR_LCK6_Msk  (0x1U << GPIO_LCKR_LCK6_Pos) /*!< 0x00000040 */
#define GPIO_LCKR_LCK6      GPIO_LCKR_LCK6_Msk
#define GPIO_LCKR_LCK7_Pos  (7U)
#define GPIO_LCKR_LCK7_Msk  (0x1U << GPIO_LCKR_LCK7_Pos) /*!< 0x00000080 */
#define GPIO_LCKR_LCK7      GPIO_LCKR_LCK7_Msk
#define GPIO_LCKR_LCK8_Pos  (8U)
#define GPIO_LCKR_LCK8_Msk  (0x1U << GPIO_LCKR_LCK8_Pos) /*!< 0x00000100 */
#define GPIO_LCKR_LCK8      GPIO_LCKR_LCK8_Msk
#define GPIO_LCKR_LCK9_Pos  (9U)
#define GPIO_LCKR_LCK9_Msk  (0x1U << GPIO_LCKR_LCK9_Pos) /*!< 0x00000200 */
#define GPIO_LCKR_LCK9      GPIO_LCKR_LCK9_Msk
#define GPIO_LCKR_LCK10_Pos (10U)
#define GPIO_LCKR_LCK10_Msk (0x1U << GPIO_LCKR_LCK10_Pos) /*!< 0x00000400 */
#define GPIO_LCKR_LCK10     GPIO_LCKR_LCK10_Msk
#define GPIO_LCKR_LCK11_Pos (11U)
#define GPIO_LCKR_LCK11_Msk (0x1U << GPIO_LCKR_LCK11_Pos) /*!< 0x00000800 */
#define GPIO_LCKR_LCK11     GPIO_LCKR_LCK11_Msk
#define GPIO_LCKR_LCK12_Pos (12U)
#define GPIO_LCKR_LCK12_Msk (0x1U << GPIO_LCKR_LCK12_Pos) /*!< 0x00001000 */
#define GPIO_LCKR_LCK12     GPIO_LCKR_LCK12_Msk
#define GPIO_LCKR_LCK13_Pos (13U)
#define GPIO_LCKR_LCK13_Msk (0x1U << GPIO_LCKR_LCK13_Pos) /*!< 0x00002000 */
#define GPIO_LCKR_LCK13     GPIO_LCKR_LCK13_Msk
#define GPIO_LCKR_LCK14_Pos (14U)
#define GPIO_LCKR_LCK14_Msk (0x1U << GPIO_LCKR_LCK14_Pos) /*!< 0x00004000 */
#define GPIO_LCKR_LCK14     GPIO_LCKR_LCK14_Msk
#define GPIO_LCKR_LCK15_Pos (15U)
#define GPIO_LCKR_LCK15_Msk (0x1U << GPIO_LCKR_LCK15_Pos) /*!< 0x00008000 */
#define GPIO_LCKR_LCK15     GPIO_LCKR_LCK15_Msk
#define GPIO_LCKR_LCKK_Pos  (16U)
#define GPIO_LCKR_LCKK_Msk  (0x1U << GPIO_LCKR_LCKK_Pos) /*!< 0x00010000 */
#define GPIO_LCKR_LCKK      GPIO_LCKR_LCKK_Msk

