niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/****************** Bit definition for GPIO_AFRL register  ********************/
#define GPIO_AFRL_AFSEL0_Pos (0U)
#define GPIO_AFRL_AFSEL0_Msk (0xFU << GPIO_AFRL_AFSEL0_Pos) /*!< 0x0000000F */
#define GPIO_AFRL_AFSEL0     GPIO_AFRL_AFSEL0_Msk
#define GPIO_AFRL_AFSEL1_Pos (4U)
#define GPIO_AFRL_AFSEL1_Msk (0xFU << GPIO_AFRL_AFSEL1_Pos) /*!< 0x000000F0 */
#define GPIO_AFRL_AFSEL1     GPIO_AFRL_AFSEL1_Msk
#define GPIO_AFRL_AFSEL2_Pos (8U)
#define GPIO_AFRL_AFSEL2_Msk (0xFU << GPIO_AFRL_AFSEL2_Pos) /*!< 0x00000F00 */
#define GPIO_AFRL_AFSEL2     GPIO_AFRL_AFSEL2_Msk
#define GPIO_AFRL_AFSEL3_Pos (12U)
#define GPIO_AFRL_AFSEL3_Msk (0xFU << GPIO_AFRL_AFSEL3_Pos) /*!< 0x0000F000 */
#define GPIO_AFRL_AFSEL3     GPIO_AFRL_AFSEL3_Msk
#define GPIO_AFRL_AFSEL4_Pos (16U)
#define GPIO_AFRL_AFSEL4_Msk (0xFU << GPIO_AFRL_AFSEL4_Pos) /*!< 0x000F0000 */
#define GPIO_AFRL_AFSEL4     GPIO_AFRL_AFSEL4_Msk
#define GPIO_AFRL_AFSEL5_Pos (20U)
#define GPIO_AFRL_AFSEL5_Msk (0xFU << GPIO_AFRL_AFSEL5_Pos) /*!< 0x00F00000 */
#define GPIO_AFRL_AFSEL5     GPIO_AFRL_AFSEL5_Msk
#define GPIO_AFRL_AFSEL6_Pos (24U)
#define GPIO_AFRL_AFSEL6_Msk (0xFU << GPIO_AFRL_AFSEL6_Pos) /*!< 0x0F000000 */
#define GPIO_AFRL_AFSEL6     GPIO_AFRL_AFSEL6_Msk
#define GPIO_AFRL_AFSEL7_Pos (28U)
#define GPIO_AFRL_AFSEL7_Msk (0xFU << GPIO_AFRL_AFSEL7_Pos) /*!< 0xF0000000 */
#define GPIO_AFRL_AFSEL7     GPIO_AFRL_AFSEL7_Msk

/* Legacy aliases */
#define GPIO_AFRL_AFRL0_Pos GPIO_AFRL_AFSEL0_Pos
#define GPIO_AFRL_AFRL0_Msk GPIO_AFRL_AFSEL0_Msk
#define GPIO_AFRL_AFRL0     GPIO_AFRL_AFSEL0
#define GPIO_AFRL_AFRL1_Pos GPIO_AFRL_AFSEL1_Pos
#define GPIO_AFRL_AFRL1_Msk GPIO_AFRL_AFSEL1_Msk
#define GPIO_AFRL_AFRL1     GPIO_AFRL_AFSEL1
#define GPIO_AFRL_AFRL2_Pos GPIO_AFRL_AFSEL2_Pos
#define GPIO_AFRL_AFRL2_Msk GPIO_AFRL_AFSEL2_Msk
#define GPIO_AFRL_AFRL2     GPIO_AFRL_AFSEL2
#define GPIO_AFRL_AFRL3_Pos GPIO_AFRL_AFSEL3_Pos
#define GPIO_AFRL_AFRL3_Msk GPIO_AFRL_AFSEL3_Msk
#define GPIO_AFRL_AFRL3     GPIO_AFRL_AFSEL3
#define GPIO_AFRL_AFRL4_Pos GPIO_AFRL_AFSEL4_Pos
#define GPIO_AFRL_AFRL4_Msk GPIO_AFRL_AFSEL4_Msk
#define GPIO_AFRL_AFRL4     GPIO_AFRL_AFSEL4
#define GPIO_AFRL_AFRL5_Pos GPIO_AFRL_AFSEL5_Pos
#define GPIO_AFRL_AFRL5_Msk GPIO_AFRL_AFSEL5_Msk
#define GPIO_AFRL_AFRL5     GPIO_AFRL_AFSEL5
#define GPIO_AFRL_AFRL6_Pos GPIO_AFRL_AFSEL6_Pos
#define GPIO_AFRL_AFRL6_Msk GPIO_AFRL_AFSEL6_Msk
#define GPIO_AFRL_AFRL6     GPIO_AFRL_AFSEL6
#define GPIO_AFRL_AFRL7_Pos GPIO_AFRL_AFSEL7_Pos
#define GPIO_AFRL_AFRL7_Msk GPIO_AFRL_AFSEL7_Msk
#define GPIO_AFRL_AFRL7     GPIO_AFRL_AFSEL7

/****************** Bit definition for GPIO_AFRH register  ********************/
#define GPIO_AFRH_AFSEL8_Pos  (0U)
#define GPIO_AFRH_AFSEL8_Msk  (0xFU << GPIO_AFRH_AFSEL8_Pos) /*!< 0x0000000F */
#define GPIO_AFRH_AFSEL8      GPIO_AFRH_AFSEL8_Msk
#define GPIO_AFRH_AFSEL9_Pos  (4U)
#define GPIO_AFRH_AFSEL9_Msk  (0xFU << GPIO_AFRH_AFSEL9_Pos) /*!< 0x000000F0 */
#define GPIO_AFRH_AFSEL9      GPIO_AFRH_AFSEL9_Msk
#define GPIO_AFRH_AFSEL10_Pos (8U)
#define GPIO_AFRH_AFSEL10_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL10_Pos) /*!< 0x00000F00 \
                                     */
#define GPIO_AFRH_AFSEL10     GPIO_AFRH_AFSEL10_Msk
#define GPIO_AFRH_AFSEL11_Pos (12U)
#define GPIO_AFRH_AFSEL11_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL11_Pos) /*!< 0x0000F000 \
                                     */
#define GPIO_AFRH_AFSEL11     GPIO_AFRH_AFSEL11_Msk
#define GPIO_AFRH_AFSEL12_Pos (16U)
#define GPIO_AFRH_AFSEL12_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL12_Pos) /*!< 0x000F0000 \
                                     */
#define GPIO_AFRH_AFSEL12     GPIO_AFRH_AFSEL12_Msk
#define GPIO_AFRH_AFSEL13_Pos (20U)
#define GPIO_AFRH_AFSEL13_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL13_Pos) /*!< 0x00F00000 \
                                     */
#define GPIO_AFRH_AFSEL13     GPIO_AFRH_AFSEL13_Msk
#define GPIO_AFRH_AFSEL14_Pos (24U)
#define GPIO_AFRH_AFSEL14_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL14_Pos) /*!< 0x0F000000 \
                                     */
#define GPIO_AFRH_AFSEL14     GPIO_AFRH_AFSEL14_Msk
#define GPIO_AFRH_AFSEL15_Pos (28U)
#define GPIO_AFRH_AFSEL15_Msk                       \
    (0xFU << GPIO_AFRH_AFSEL15_Pos) /*!< 0xF0000000 \
                                     */
#define GPIO_AFRH_AFSEL15 GPIO_AFRH_AFSEL15_Msk

/* Legacy aliases */
#define GPIO_AFRH_AFRH0_Pos GPIO_AFRH_AFSEL8_Pos
#define GPIO_AFRH_AFRH0_Msk GPIO_AFRH_AFSEL8_Msk
#define GPIO_AFRH_AFRH0     GPIO_AFRH_AFSEL8
#define GPIO_AFRH_AFRH1_Pos GPIO_AFRH_AFSEL9_Pos
#define GPIO_AFRH_AFRH1_Msk GPIO_AFRH_AFSEL9_Msk
#define GPIO_AFRH_AFRH1     GPIO_AFRH_AFSEL9
#define GPIO_AFRH_AFRH2_Pos GPIO_AFRH_AFSEL10_Pos
#define GPIO_AFRH_AFRH2_Msk GPIO_AFRH_AFSEL10_Msk
#define GPIO_AFRH_AFRH2     GPIO_AFRH_AFSEL10
#define GPIO_AFRH_AFRH3_Pos GPIO_AFRH_AFSEL11_Pos
#define GPIO_AFRH_AFRH3_Msk GPIO_AFRH_AFSEL11_Msk
#define GPIO_AFRH_AFRH3     GPIO_AFRH_AFSEL11
#define GPIO_AFRH_AFRH4_Pos GPIO_AFRH_AFSEL12_Pos
#define GPIO_AFRH_AFRH4_Msk GPIO_AFRH_AFSEL12_Msk
#define GPIO_AFRH_AFRH4     GPIO_AFRH_AFSEL12
#define GPIO_AFRH_AFRH5_Pos GPIO_AFRH_AFSEL13_Pos
#define GPIO_AFRH_AFRH5_Msk GPIO_AFRH_AFSEL13_Msk
#define GPIO_AFRH_AFRH5     GPIO_AFRH_AFSEL13
#define GPIO_AFRH_AFRH6_Pos GPIO_AFRH_AFSEL14_Pos
#define GPIO_AFRH_AFRH6_Msk GPIO_AFRH_AFSEL14_Msk
#define GPIO_AFRH_AFRH6     GPIO_AFRH_AFSEL14
#define GPIO_AFRH_AFRH7_Pos GPIO_AFRH_AFSEL15_Pos
#define GPIO_AFRH_AFRH7_Msk GPIO_AFRH_AFSEL15_Msk
#define GPIO_AFRH_AFRH7     GPIO_AFRH_AFSEL15

/****************** Bit definition for GPIO_BRR register  *********************/
#define GPIO_BRR_BR_0  (0x00000001U)
#define GPIO_BRR_BR_1  (0x00000002U)
#define GPIO_BRR_BR_2  (0x00000004U)
#define GPIO_BRR_BR_3  (0x00000008U)
#define GPIO_BRR_BR_4  (0x00000010U)
#define GPIO_BRR_BR_5  (0x00000020U)
#define GPIO_BRR_BR_6  (0x00000040U)
#define GPIO_BRR_BR_7  (0x00000080U)
#define GPIO_BRR_BR_8  (0x00000100U)
#define GPIO_BRR_BR_9  (0x00000200U)
#define GPIO_BRR_BR_10 (0x00000400U)
#define GPIO_BRR_BR_11 (0x00000800U)
#define GPIO_BRR_BR_12 (0x00001000U)
#define GPIO_BRR_BR_13 (0x00002000U)
#define GPIO_BRR_BR_14 (0x00004000U)
#define GPIO_BRR_BR_15 (0x00008000U)

/******************************************************************************/
/*                                                                            */
/*                   Inter-integrated Circuit Interface (I2C)                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos     (0U)
#define I2C_CR1_PE_Msk     (0x1U << I2C_CR1_PE_Pos) /*!< 0x00000001 */
#define I2C_CR1_PE         I2C_CR1_PE_Msk           /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos   (1U)
#define I2C_CR1_TXIE_Msk   (0x1U << I2C_CR1_TXIE_Pos) /*!< 0x00000002 */
#define I2C_CR1_TXIE       I2C_CR1_TXIE_Msk /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos   (2U)
#define I2C_CR1_RXIE_Msk   (0x1U << I2C_CR1_RXIE_Pos) /*!< 0x00000004 */
#define I2C_CR1_RXIE       I2C_CR1_RXIE_Msk /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos (3U)
#define I2C_CR1_ADDRIE_Msk (0x1U << I2C_CR1_ADDRIE_Pos) /*!< 0x00000008 */
#define I2C_CR1_ADDRIE                                     \
    I2C_CR1_ADDRIE_Msk /*!< Address match interrupt enable \
                        */
#define I2C_CR1_NACKIE_Pos (4U)
#define I2C_CR1_NACKIE_Msk (0x1U << I2C_CR1_NACKIE_Pos) /*!< 0x00000010 */
#define I2C_CR1_NACKIE                                     \
    I2C_CR1_NACKIE_Msk /*!< NACK received interrupt enable \
                        */
#define I2C_CR1_STOPIE_Pos (5U)
#define I2C_CR1_STOPIE_Msk (0x1U << I2C_CR1_STOPIE_Pos) /*!< 0x00000020 */
#define I2C_CR1_STOPIE \
    I2C_CR1_STOPIE_Msk /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos (6U)
#define I2C_CR1_TCIE_Msk (0x1U << I2C_CR1_TCIE_Pos) /*!< 0x00000040 */
#define I2C_CR1_TCIE                                         \
    I2C_CR1_TCIE_Msk /*!< Transfer complete interrupt enable \
                      */
#define I2C_CR1_ERRIE_Pos   (7U)
#define I2C_CR1_ERRIE_Msk   (0x1U << I2C_CR1_ERRIE_Pos) /*!< 0x00000080 */
#define I2C_CR1_ERRIE       I2C_CR1_ERRIE_Msk /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos     (8U)
#define I2C_CR1_DNF_Msk     (0xFU << I2C_CR1_DNF_Pos) /*!< 0x00000F00 */
#define I2C_CR1_DNF         I2C_CR1_DNF_Msk /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos  (12U)
#define I2C_CR1_ANFOFF_Msk  (0x1U << I2C_CR1_ANFOFF_Pos) /*!< 0x00001000 */
#define I2C_CR1_ANFOFF      I2C_CR1_ANFOFF_Msk /*!< Analog noise filter OFF */
#define I2C_CR1_SWRST_Pos   (13U)
#define I2C_CR1_SWRST_Msk   (0x1U << I2C_CR1_SWRST_Pos) /*!< 0x00002000 */
#define I2C_CR1_SWRST       I2C_CR1_SWRST_Msk           /*!< Software reset */
#define I2C_CR1_TXDMAEN_Pos (14U)
#define I2C_CR1_TXDMAEN_Msk (0x1U << I2C_CR1_TXDMAEN_Pos) /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN \
    I2C_CR1_TXDMAEN_Msk /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos (15U)
#define I2C_CR1_RXDMAEN_Msk (0x1U << I2C_CR1_RXDMAEN_Pos) /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN \
    I2C_CR1_RXDMAEN_Msk /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos       (16U)
#define I2C_CR1_SBC_Msk       (0x1U << I2C_CR1_SBC_Pos) /*!< 0x00010000 */
#define I2C_CR1_SBC           I2C_CR1_SBC_Msk /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos (17U)
#define I2C_CR1_NOSTRETCH_Msk                       \
    (0x1U << I2C_CR1_NOSTRETCH_Pos) /*!< 0x00020000 \
                                     */
#define I2C_CR1_NOSTRETCH                               \
    I2C_CR1_NOSTRETCH_Msk /*!< Clock stretching disable \
                           */
#define I2C_CR1_GCEN_Pos   (19U)
#define I2C_CR1_GCEN_Msk   (0x1U << I2C_CR1_GCEN_Pos) /*!< 0x00080000 */
#define I2C_CR1_GCEN       I2C_CR1_GCEN_Msk /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos (20U)
#define I2C_CR1_SMBHEN_Msk (0x1U << I2C_CR1_SMBHEN_Pos) /*!< 0x00100000 */
#define I2C_CR1_SMBHEN     I2C_CR1_SMBHEN_Msk /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos (21U)
#define I2C_CR1_SMBDEN_Msk (0x1U << I2C_CR1_SMBDEN_Pos) /*!< 0x00200000 */
#define I2C_CR1_SMBDEN \
    I2C_CR1_SMBDEN_Msk /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos (22U)
#define I2C_CR1_ALERTEN_Msk (0x1U << I2C_CR1_ALERTEN_Pos) /*!< 0x00400000 */
#define I2C_CR1_ALERTEN     I2C_CR1_ALERTEN_Msk /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos   (23U)
#define I2C_CR1_PECEN_Msk   (0x1U << I2C_CR1_PECEN_Pos) /*!< 0x00800000 */
#define I2C_CR1_PECEN       I2C_CR1_PECEN_Msk           /*!< PEC enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos   (0U)
#define I2C_CR2_SADD_Msk   (0x3FFU << I2C_CR2_SADD_Pos) /*!< 0x000003FF */
#define I2C_CR2_SADD       I2C_CR2_SADD_Msk /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos (10U)
#define I2C_CR2_RD_WRN_Msk (0x1U << I2C_CR2_RD_WRN_Pos) /*!< 0x00000400 */
#define I2C_CR2_RD_WRN \
    I2C_CR2_RD_WRN_Msk /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos (11U)
#define I2C_CR2_ADD10_Msk (0x1U << I2C_CR2_ADD10_Pos) /*!< 0x00000800 */
#define I2C_CR2_ADD10 \
    I2C_CR2_ADD10_Msk /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos (12U)
#define I2C_CR2_HEAD10R_Msk (0x1U << I2C_CR2_HEAD10R_Pos) /*!< 0x00001000 */
#define I2C_CR2_HEAD10R                                                        \
    I2C_CR2_HEAD10R_Msk /*!< 10-bit address header only read direction (master \
                           mode) */
#define I2C_CR2_START_Pos   (13U)
#define I2C_CR2_START_Msk   (0x1U << I2C_CR2_START_Pos) /*!< 0x00002000 */
#define I2C_CR2_START       I2C_CR2_START_Msk           /*!< START generation */
#define I2C_CR2_STOP_Pos    (14U)
#define I2C_CR2_STOP_Msk    (0x1U << I2C_CR2_STOP_Pos) /*!< 0x00004000 */
#define I2C_CR2_STOP        I2C_CR2_STOP_Msk /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos    (15U)
#define I2C_CR2_NACK_Msk    (0x1U << I2C_CR2_NACK_Pos) /*!< 0x00008000 */
#define I2C_CR2_NACK        I2C_CR2_NACK_Msk /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos  (16U)
#define I2C_CR2_NBYTES_Msk  (0xFFU << I2C_CR2_NBYTES_Pos) /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES      I2C_CR2_NBYTES_Msk /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos  (24U)
#define I2C_CR2_RELOAD_Msk  (0x1U << I2C_CR2_RELOAD_Pos) /*!< 0x01000000 */
#define I2C_CR2_RELOAD      I2C_CR2_RELOAD_Msk /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos (25U)
#define I2C_CR2_AUTOEND_Msk (0x1U << I2C_CR2_AUTOEND_Pos) /*!< 0x02000000 */
#define I2C_CR2_AUTOEND \
    I2C_CR2_AUTOEND_Msk /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos (26U)
#define I2C_CR2_PECBYTE_Msk (0x1U << I2C_CR2_PECBYTE_Pos) /*!< 0x04000000 */
#define I2C_CR2_PECBYTE     I2C_CR2_PECBYTE_Msk /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos     (0U)
#define I2C_OAR1_OA1_Msk     (0x3FFU << I2C_OAR1_OA1_Pos) /*!< 0x000003FF */
#define I2C_OAR1_OA1         I2C_OAR1_OA1_Msk /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos (10U)
#define I2C_OAR1_OA1MODE_Msk (0x1U << I2C_OAR1_OA1MODE_Pos) /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE                                \
    I2C_OAR1_OA1MODE_Msk /*!< Own address 1 10-bit mode \
                          */
#define I2C_OAR1_OA1EN_Pos (15U)
#define I2C_OAR1_OA1EN_Msk (0x1U << I2C_OAR1_OA1EN_Pos) /*!< 0x00008000 */
#define I2C_OAR1_OA1EN     I2C_OAR1_OA1EN_Msk /*!< Own address 1 enable */

