niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
#define RCC_CFGR_SW_HSI (0x00000000U) /*!< HSI selected as system clock */
#define RCC_CFGR_SW_HSE (0x00000001U) /*!< HSE selected as system clock */
#define RCC_CFGR_SW_PLL (0x00000002U) /*!< PLL selected as system clock */

/*!< SWS configuration */
#define RCC_CFGR_SWS_Pos (2U)
#define RCC_CFGR_SWS_Msk (0x3U << RCC_CFGR_SWS_Pos) /*!< 0x0000000C */
#define RCC_CFGR_SWS \
    RCC_CFGR_SWS_Msk /*!< SWS[1:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0 (0x1U << RCC_CFGR_SWS_Pos) /*!< 0x00000004 */
#define RCC_CFGR_SWS_1 (0x2U << RCC_CFGR_SWS_Pos) /*!< 0x00000008 */

#define RCC_CFGR_SWS_HSI \
    (0x00000000U) /*!< HSI oscillator used as system clock */
#define RCC_CFGR_SWS_HSE \
    (0x00000004U) /*!< HSE oscillator used as system clock */
#define RCC_CFGR_SWS_PLL (0x00000008U) /*!< PLL used as system clock */

/*!< HPRE configuration */
#define RCC_CFGR_HPRE_Pos (4U)
#define RCC_CFGR_HPRE_Msk (0xFU << RCC_CFGR_HPRE_Pos) /*!< 0x000000F0 */
#define RCC_CFGR_HPRE     RCC_CFGR_HPRE_Msk /*!< HPRE[3:0] bits (AHB prescaler) */
#define RCC_CFGR_HPRE_0   (0x1U << RCC_CFGR_HPRE_Pos) /*!< 0x00000010 */
#define RCC_CFGR_HPRE_1   (0x2U << RCC_CFGR_HPRE_Pos) /*!< 0x00000020 */
#define RCC_CFGR_HPRE_2   (0x4U << RCC_CFGR_HPRE_Pos) /*!< 0x00000040 */
#define RCC_CFGR_HPRE_3   (0x8U << RCC_CFGR_HPRE_Pos) /*!< 0x00000080 */

#define RCC_CFGR_HPRE_DIV1   (0x00000000U) /*!< SYSCLK not divided */
#define RCC_CFGR_HPRE_DIV2   (0x00000080U) /*!< SYSCLK divided by 2 */
#define RCC_CFGR_HPRE_DIV4   (0x00000090U) /*!< SYSCLK divided by 4 */
#define RCC_CFGR_HPRE_DIV8   (0x000000A0U) /*!< SYSCLK divided by 8 */
#define RCC_CFGR_HPRE_DIV16  (0x000000B0U) /*!< SYSCLK divided by 16 */
#define RCC_CFGR_HPRE_DIV64  (0x000000C0U) /*!< SYSCLK divided by 64 */
#define RCC_CFGR_HPRE_DIV128 (0x000000D0U) /*!< SYSCLK divided by 128 */
#define RCC_CFGR_HPRE_DIV256 (0x000000E0U) /*!< SYSCLK divided by 256 */
#define RCC_CFGR_HPRE_DIV512 (0x000000F0U) /*!< SYSCLK divided by 512 */

/*!< PPRE configuration */
#define RCC_CFGR_PPRE_Pos (8U)
#define RCC_CFGR_PPRE_Msk (0x7U << RCC_CFGR_PPRE_Pos) /*!< 0x00000700 */
#define RCC_CFGR_PPRE     RCC_CFGR_PPRE_Msk /*!< PRE[2:0] bits (APB prescaler) */
#define RCC_CFGR_PPRE_0   (0x1U << RCC_CFGR_PPRE_Pos) /*!< 0x00000100 */
#define RCC_CFGR_PPRE_1   (0x2U << RCC_CFGR_PPRE_Pos) /*!< 0x00000200 */
#define RCC_CFGR_PPRE_2   (0x4U << RCC_CFGR_PPRE_Pos) /*!< 0x00000400 */

#define RCC_CFGR_PPRE_DIV1     (0x00000000U) /*!< HCLK not divided */
#define RCC_CFGR_PPRE_DIV2_Pos (10U)
#define RCC_CFGR_PPRE_DIV2_Msk \
    (0x1U << RCC_CFGR_PPRE_DIV2_Pos)                  /*!< 0x00000400 */
#define RCC_CFGR_PPRE_DIV2     RCC_CFGR_PPRE_DIV2_Msk /*!< HCLK divided by 2 */
#define RCC_CFGR_PPRE_DIV4_Pos (8U)
#define RCC_CFGR_PPRE_DIV4_Msk \
    (0x5U << RCC_CFGR_PPRE_DIV4_Pos)                  /*!< 0x00000500 */
#define RCC_CFGR_PPRE_DIV4     RCC_CFGR_PPRE_DIV4_Msk /*!< HCLK divided by 4 */
#define RCC_CFGR_PPRE_DIV8_Pos (9U)
#define RCC_CFGR_PPRE_DIV8_Msk \
    (0x3U << RCC_CFGR_PPRE_DIV8_Pos)                   /*!< 0x00000600 */
#define RCC_CFGR_PPRE_DIV8      RCC_CFGR_PPRE_DIV8_Msk /*!< HCLK divided by 8 */
#define RCC_CFGR_PPRE_DIV16_Pos (8U)
#define RCC_CFGR_PPRE_DIV16_Msk \
    (0x7U << RCC_CFGR_PPRE_DIV16_Pos)               /*!< 0x00000700 */
#define RCC_CFGR_PPRE_DIV16 RCC_CFGR_PPRE_DIV16_Msk /*!< HCLK divided by 16 */

/*!< ADCPPRE configuration */
#define RCC_CFGR_ADCPRE_Pos (14U)
#define RCC_CFGR_ADCPRE_Msk (0x1U << RCC_CFGR_ADCPRE_Pos) /*!< 0x00004000 */
#define RCC_CFGR_ADCPRE     RCC_CFGR_ADCPRE_Msk /*!< ADCPRE bit (ADC prescaler) */

#define RCC_CFGR_ADCPRE_DIV2 (0x00000000U) /*!< PCLK divided by 2 */
#define RCC_CFGR_ADCPRE_DIV4 (0x00004000U) /*!< PCLK divided by 4 */

#define RCC_CFGR_PLLSRC_Pos (15U)
#define RCC_CFGR_PLLSRC_Msk (0x3U << RCC_CFGR_PLLSRC_Pos) /*!< 0x00010000 */
#define RCC_CFGR_PLLSRC \
    (0x2U << RCC_CFGR_PLLSRC_Pos) /*!< PLL entry clock source */
#define RCC_CFGR_PLLSRC_HSI_DIV2                                          \
    (0x00000000U) /*!< HSI clock divided by 2 selected as PLL entry clock \
                     source */
#define RCC_CFGR_PLLSRC_HSE_PREDIV \
    (0x00010000U) /*!< HSE/PREDIV clock selected as PLL entry clock source */

#define RCC_CFGR_PLLXTPRE_Pos (17U)
#define RCC_CFGR_PLLXTPRE_Msk                       \
    (0x1U << RCC_CFGR_PLLXTPRE_Pos) /*!< 0x00020000 \
                                     */
#define RCC_CFGR_PLLXTPRE \
    RCC_CFGR_PLLXTPRE_Msk /*!< HSE divider for PLL entry */
#define RCC_CFGR_PLLXTPRE_HSE_PREDIV_DIV1 \
    (0x00000000U) /*!< HSE/PREDIV clock not divided for PLL entry */
#define RCC_CFGR_PLLXTPRE_HSE_PREDIV_DIV2 \
    (0x00020000U) /*!< HSE/PREDIV clock divided by 2 for PLL entry */

/*!< PLLMUL configuration */
#define RCC_CFGR_PLLMUL_Pos (18U)
#define RCC_CFGR_PLLMUL_Msk (0xFU << RCC_CFGR_PLLMUL_Pos) /*!< 0x003C0000 */
#define RCC_CFGR_PLLMUL \
    RCC_CFGR_PLLMUL_Msk /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define RCC_CFGR_PLLMUL_0 (0x1U << RCC_CFGR_PLLMUL_Pos) /*!< 0x00040000 */
#define RCC_CFGR_PLLMUL_1 (0x2U << RCC_CFGR_PLLMUL_Pos) /*!< 0x00080000 */
#define RCC_CFGR_PLLMUL_2 (0x4U << RCC_CFGR_PLLMUL_Pos) /*!< 0x00100000 */
#define RCC_CFGR_PLLMUL_3 (0x8U << RCC_CFGR_PLLMUL_Pos) /*!< 0x00200000 */

#define RCC_CFGR_PLLMUL2  (0x00000000U) /*!< PLL input clock*2 */
#define RCC_CFGR_PLLMUL3  (0x00040000U) /*!< PLL input clock*3 */
#define RCC_CFGR_PLLMUL4  (0x00080000U) /*!< PLL input clock*4 */
#define RCC_CFGR_PLLMUL5  (0x000C0000U) /*!< PLL input clock*5 */
#define RCC_CFGR_PLLMUL6  (0x00100000U) /*!< PLL input clock*6 */
#define RCC_CFGR_PLLMUL7  (0x00140000U) /*!< PLL input clock*7 */
#define RCC_CFGR_PLLMUL8  (0x00180000U) /*!< PLL input clock*8 */
#define RCC_CFGR_PLLMUL9  (0x001C0000U) /*!< PLL input clock*9 */
#define RCC_CFGR_PLLMUL10 (0x00200000U) /*!< PLL input clock10 */
#define RCC_CFGR_PLLMUL11 (0x00240000U) /*!< PLL input clock*11 */
#define RCC_CFGR_PLLMUL12 (0x00280000U) /*!< PLL input clock*12 */
#define RCC_CFGR_PLLMUL13 (0x002C0000U) /*!< PLL input clock*13 */
#define RCC_CFGR_PLLMUL14 (0x00300000U) /*!< PLL input clock*14 */
#define RCC_CFGR_PLLMUL15 (0x00340000U) /*!< PLL input clock*15 */
#define RCC_CFGR_PLLMUL16 (0x00380000U) /*!< PLL input clock*16 */

/*!< MCO configuration */
#define RCC_CFGR_MCO_Pos (24U)
#define RCC_CFGR_MCO_Msk (0xFU << RCC_CFGR_MCO_Pos) /*!< 0x0F000000 */
#define RCC_CFGR_MCO \
    RCC_CFGR_MCO_Msk /*!< MCO[3:0] bits (Microcontroller Clock Output) */
#define RCC_CFGR_MCO_0 (0x1U << RCC_CFGR_MCO_Pos) /*!< 0x01000000 */
#define RCC_CFGR_MCO_1 (0x2U << RCC_CFGR_MCO_Pos) /*!< 0x02000000 */
#define RCC_CFGR_MCO_2 (0x4U << RCC_CFGR_MCO_Pos) /*!< 0x04000000 */

#define RCC_CFGR_MCO_NOCLOCK (0x00000000U) /*!< No clock */
#define RCC_CFGR_MCO_HSI14 \
    (0x01000000U) /*!< HSI14 clock selected as MCO source */
#define RCC_CFGR_MCO_LSI                                \
    (0x02000000U) /*!< LSI clock selected as MCO source \
                   */
#define RCC_CFGR_MCO_LSE                                \
    (0x03000000U) /*!< LSE clock selected as MCO source \
                   */
#define RCC_CFGR_MCO_SYSCLK \
    (0x04000000U) /*!< System clock selected as MCO source */
#define RCC_CFGR_MCO_HSI                                \
    (0x05000000U) /*!< HSI clock selected as MCO source \
                   */
#define RCC_CFGR_MCO_HSE                                \
    (0x06000000U) /*!< HSE clock selected as MCO source \
                   */
#define RCC_CFGR_MCO_PLL \
    (0x07000000U) /*!< PLL clock divided by 2 selected as MCO source */

#define RCC_CFGR_MCOPRE_Pos    (28U)
#define RCC_CFGR_MCOPRE_Msk    (0x7U << RCC_CFGR_MCOPRE_Pos) /*!< 0x70000000 */
#define RCC_CFGR_MCOPRE        RCC_CFGR_MCOPRE_Msk /*!< MCO prescaler  */
#define RCC_CFGR_MCOPRE_DIV1   (0x00000000U)       /*!< MCO is divided by 1  */
#define RCC_CFGR_MCOPRE_DIV2   (0x10000000U)       /*!< MCO is divided by 2  */
#define RCC_CFGR_MCOPRE_DIV4   (0x20000000U)       /*!< MCO is divided by 4  */
#define RCC_CFGR_MCOPRE_DIV8   (0x30000000U)       /*!< MCO is divided by 8  */
#define RCC_CFGR_MCOPRE_DIV16  (0x40000000U)       /*!< MCO is divided by 16  */
#define RCC_CFGR_MCOPRE_DIV32  (0x50000000U)       /*!< MCO is divided by 32  */
#define RCC_CFGR_MCOPRE_DIV64  (0x60000000U)       /*!< MCO is divided by 64  */
#define RCC_CFGR_MCOPRE_DIV128 (0x70000000U) /*!< MCO is divided by 128  */

#define RCC_CFGR_PLLNODIV_Pos (31U)
#define RCC_CFGR_PLLNODIV_Msk                       \
    (0x1U << RCC_CFGR_PLLNODIV_Pos) /*!< 0x80000000 \
                                     */
#define RCC_CFGR_PLLNODIV \
    RCC_CFGR_PLLNODIV_Msk /*!< PLL is not divided to MCO  */

/* Reference defines */
#define RCC_CFGR_MCOSEL          RCC_CFGR_MCO
#define RCC_CFGR_MCOSEL_0        RCC_CFGR_MCO_0
#define RCC_CFGR_MCOSEL_1        RCC_CFGR_MCO_1
#define RCC_CFGR_MCOSEL_2        RCC_CFGR_MCO_2
#define RCC_CFGR_MCOSEL_NOCLOCK  RCC_CFGR_MCO_NOCLOCK
#define RCC_CFGR_MCOSEL_HSI14    RCC_CFGR_MCO_HSI14
#define RCC_CFGR_MCOSEL_LSI      RCC_CFGR_MCO_LSI
#define RCC_CFGR_MCOSEL_LSE      RCC_CFGR_MCO_LSE
#define RCC_CFGR_MCOSEL_SYSCLK   RCC_CFGR_MCO_SYSCLK
#define RCC_CFGR_MCOSEL_HSI      RCC_CFGR_MCO_HSI
#define RCC_CFGR_MCOSEL_HSE      RCC_CFGR_MCO_HSE
#define RCC_CFGR_MCOSEL_PLL_DIV2 RCC_CFGR_MCO_PLL

/*!<******************  Bit definition for RCC_CIR register  *****************/
#define RCC_CIR_LSIRDYF_Pos   (0U)
#define RCC_CIR_LSIRDYF_Msk   (0x1U << RCC_CIR_LSIRDYF_Pos) /*!< 0x00000001 */
#define RCC_CIR_LSIRDYF       RCC_CIR_LSIRDYF_Msk /*!< LSI Ready Interrupt flag */
#define RCC_CIR_LSERDYF_Pos   (1U)
#define RCC_CIR_LSERDYF_Msk   (0x1U << RCC_CIR_LSERDYF_Pos) /*!< 0x00000002 */
#define RCC_CIR_LSERDYF       RCC_CIR_LSERDYF_Msk /*!< LSE Ready Interrupt flag */
#define RCC_CIR_HSIRDYF_Pos   (2U)
#define RCC_CIR_HSIRDYF_Msk   (0x1U << RCC_CIR_HSIRDYF_Pos) /*!< 0x00000004 */
#define RCC_CIR_HSIRDYF       RCC_CIR_HSIRDYF_Msk /*!< HSI Ready Interrupt flag */
#define RCC_CIR_HSERDYF_Pos   (3U)
#define RCC_CIR_HSERDYF_Msk   (0x1U << RCC_CIR_HSERDYF_Pos) /*!< 0x00000008 */
#define RCC_CIR_HSERDYF       RCC_CIR_HSERDYF_Msk /*!< HSE Ready Interrupt flag */
#define RCC_CIR_PLLRDYF_Pos   (4U)
#define RCC_CIR_PLLRDYF_Msk   (0x1U << RCC_CIR_PLLRDYF_Pos) /*!< 0x00000010 */
#define RCC_CIR_PLLRDYF       RCC_CIR_PLLRDYF_Msk /*!< PLL Ready Interrupt flag */
#define RCC_CIR_HSI14RDYF_Pos (5U)
#define RCC_CIR_HSI14RDYF_Msk                       \
    (0x1U << RCC_CIR_HSI14RDYF_Pos) /*!< 0x00000020 \
                                     */
#define RCC_CIR_HSI14RDYF \
    RCC_CIR_HSI14RDYF_Msk /*!< HSI14 Ready Interrupt flag */
#define RCC_CIR_CSSF_Pos (7U)
#define RCC_CIR_CSSF_Msk (0x1U << RCC_CIR_CSSF_Pos) /*!< 0x00000080 */
#define RCC_CIR_CSSF \
    RCC_CIR_CSSF_Msk /*!< Clock Security System Interrupt flag */
#define RCC_CIR_LSIRDYIE_Pos (8U)
#define RCC_CIR_LSIRDYIE_Msk (0x1U << RCC_CIR_LSIRDYIE_Pos) /*!< 0x00000100 */
#define RCC_CIR_LSIRDYIE                                 \
    RCC_CIR_LSIRDYIE_Msk /*!< LSI Ready Interrupt Enable \
                          */
#define RCC_CIR_LSERDYIE_Pos (9U)
#define RCC_CIR_LSERDYIE_Msk (0x1U << RCC_CIR_LSERDYIE_Pos) /*!< 0x00000200 */
#define RCC_CIR_LSERDYIE                                 \
    RCC_CIR_LSERDYIE_Msk /*!< LSE Ready Interrupt Enable \
                          */
#define RCC_CIR_HSIRDYIE_Pos (10U)
#define RCC_CIR_HSIRDYIE_Msk (0x1U << RCC_CIR_HSIRDYIE_Pos) /*!< 0x00000400 */
#define RCC_CIR_HSIRDYIE                                 \
    RCC_CIR_HSIRDYIE_Msk /*!< HSI Ready Interrupt Enable \
                          */
#define RCC_CIR_HSERDYIE_Pos (11U)
#define RCC_CIR_HSERDYIE_Msk (0x1U << RCC_CIR_HSERDYIE_Pos) /*!< 0x00000800 */
#define RCC_CIR_HSERDYIE                                 \
    RCC_CIR_HSERDYIE_Msk /*!< HSE Ready Interrupt Enable \
                          */
#define RCC_CIR_PLLRDYIE_Pos (12U)
#define RCC_CIR_PLLRDYIE_Msk (0x1U << RCC_CIR_PLLRDYIE_Pos) /*!< 0x00001000 */
#define RCC_CIR_PLLRDYIE                                 \
    RCC_CIR_PLLRDYIE_Msk /*!< PLL Ready Interrupt Enable \
                          */
#define RCC_CIR_HSI14RDYIE_Pos (13U)
#define RCC_CIR_HSI14RDYIE_Msk \
    (0x1U << RCC_CIR_HSI14RDYIE_Pos) /*!< 0x00002000 */
#define RCC_CIR_HSI14RDYIE \
    RCC_CIR_HSI14RDYIE_Msk /*!< HSI14 Ready Interrupt Enable */
#define RCC_CIR_LSIRDYC_Pos   (16U)
#define RCC_CIR_LSIRDYC_Msk   (0x1U << RCC_CIR_LSIRDYC_Pos) /*!< 0x00010000 */
#define RCC_CIR_LSIRDYC       RCC_CIR_LSIRDYC_Msk /*!< LSI Ready Interrupt Clear */
#define RCC_CIR_LSERDYC_Pos   (17U)
#define RCC_CIR_LSERDYC_Msk   (0x1U << RCC_CIR_LSERDYC_Pos) /*!< 0x00020000 */
#define RCC_CIR_LSERDYC       RCC_CIR_LSERDYC_Msk /*!< LSE Ready Interrupt Clear */
#define RCC_CIR_HSIRDYC_Pos   (18U)
#define RCC_CIR_HSIRDYC_Msk   (0x1U << RCC_CIR_HSIRDYC_Pos) /*!< 0x00040000 */
#define RCC_CIR_HSIRDYC       RCC_CIR_HSIRDYC_Msk /*!< HSI Ready Interrupt Clear */
#define RCC_CIR_HSERDYC_Pos   (19U)
#define RCC_CIR_HSERDYC_Msk   (0x1U << RCC_CIR_HSERDYC_Pos) /*!< 0x00080000 */
#define RCC_CIR_HSERDYC       RCC_CIR_HSERDYC_Msk /*!< HSE Ready Interrupt Clear */
#define RCC_CIR_PLLRDYC_Pos   (20U)
#define RCC_CIR_PLLRDYC_Msk   (0x1U << RCC_CIR_PLLRDYC_Pos) /*!< 0x00100000 */
#define RCC_CIR_PLLRDYC       RCC_CIR_PLLRDYC_Msk /*!< PLL Ready Interrupt Clear */
#define RCC_CIR_HSI14RDYC_Pos (21U)
#define RCC_CIR_HSI14RDYC_Msk                       \
    (0x1U << RCC_CIR_HSI14RDYC_Pos) /*!< 0x00200000 \
                                     */
#define RCC_CIR_HSI14RDYC \
    RCC_CIR_HSI14RDYC_Msk /*!< HSI14 Ready Interrupt Clear */
#define RCC_CIR_CSSC_Pos (23U)
#define RCC_CIR_CSSC_Msk (0x1U << RCC_CIR_CSSC_Pos) /*!< 0x00800000 */
#define RCC_CIR_CSSC \
    RCC_CIR_CSSC_Msk /*!< Clock Security System Interrupt Clear */

