niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/*****************  Bit definition for RCC_APB2RSTR register  ****************/
#define RCC_APB2RSTR_SYSCFGRST_Pos (0U)
#define RCC_APB2RSTR_SYSCFGRST_Msk \
    (0x1U << RCC_APB2RSTR_SYSCFGRST_Pos)                   /*!< 0x00000001 */
#define RCC_APB2RSTR_SYSCFGRST  RCC_APB2RSTR_SYSCFGRST_Msk /*!< SYSCFG reset */
#define RCC_APB2RSTR_ADCRST_Pos (9U)
#define RCC_APB2RSTR_ADCRST_Msk \
    (0x1U << RCC_APB2RSTR_ADCRST_Pos)                    /*!< 0x00000200 */
#define RCC_APB2RSTR_ADCRST      RCC_APB2RSTR_ADCRST_Msk /*!< ADC reset */
#define RCC_APB2RSTR_TIM1RST_Pos (11U)
#define RCC_APB2RSTR_TIM1RST_Msk \
    (0x1U << RCC_APB2RSTR_TIM1RST_Pos)                    /*!< 0x00000800 */
#define RCC_APB2RSTR_TIM1RST     RCC_APB2RSTR_TIM1RST_Msk /*!< TIM1 reset */
#define RCC_APB2RSTR_SPI1RST_Pos (12U)
#define RCC_APB2RSTR_SPI1RST_Msk \
    (0x1U << RCC_APB2RSTR_SPI1RST_Pos)                      /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST       RCC_APB2RSTR_SPI1RST_Msk /*!< SPI1 reset */
#define RCC_APB2RSTR_USART1RST_Pos (14U)
#define RCC_APB2RSTR_USART1RST_Msk \
    (0x1U << RCC_APB2RSTR_USART1RST_Pos)                     /*!< 0x00004000 */
#define RCC_APB2RSTR_USART1RST    RCC_APB2RSTR_USART1RST_Msk /*!< USART1 reset */
#define RCC_APB2RSTR_TIM16RST_Pos (17U)
#define RCC_APB2RSTR_TIM16RST_Msk \
    (0x1U << RCC_APB2RSTR_TIM16RST_Pos)                     /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST     RCC_APB2RSTR_TIM16RST_Msk /*!< TIM16 reset */
#define RCC_APB2RSTR_TIM17RST_Pos (18U)
#define RCC_APB2RSTR_TIM17RST_Msk \
    (0x1U << RCC_APB2RSTR_TIM17RST_Pos)                      /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST      RCC_APB2RSTR_TIM17RST_Msk /*!< TIM17 reset */
#define RCC_APB2RSTR_DBGMCURST_Pos (22U)
#define RCC_APB2RSTR_DBGMCURST_Msk \
    (0x1U << RCC_APB2RSTR_DBGMCURST_Pos)                  /*!< 0x00400000 */
#define RCC_APB2RSTR_DBGMCURST RCC_APB2RSTR_DBGMCURST_Msk /*!< DBGMCU reset */

/*!< Old ADC1 reset bit definition maintained for legacy purpose */
#define RCC_APB2RSTR_ADC1RST RCC_APB2RSTR_ADCRST

/*****************  Bit definition for RCC_APB1RSTR register  ****************/
#define RCC_APB1RSTR_TIM3RST_Pos (1U)
#define RCC_APB1RSTR_TIM3RST_Msk \
    (0x1U << RCC_APB1RSTR_TIM3RST_Pos)                     /*!< 0x00000002 */
#define RCC_APB1RSTR_TIM3RST      RCC_APB1RSTR_TIM3RST_Msk /*!< Timer 3 reset */
#define RCC_APB1RSTR_TIM14RST_Pos (8U)
#define RCC_APB1RSTR_TIM14RST_Msk \
    (0x1U << RCC_APB1RSTR_TIM14RST_Pos)                    /*!< 0x00000100 */
#define RCC_APB1RSTR_TIM14RST    RCC_APB1RSTR_TIM14RST_Msk /*!< Timer 14 reset */
#define RCC_APB1RSTR_WWDGRST_Pos (11U)
#define RCC_APB1RSTR_WWDGRST_Msk \
    (0x1U << RCC_APB1RSTR_WWDGRST_Pos) /*!< 0x00000800 */
#define RCC_APB1RSTR_WWDGRST \
    RCC_APB1RSTR_WWDGRST_Msk /*!< Window Watchdog reset */
#define RCC_APB1RSTR_I2C1RST_Pos (21U)
#define RCC_APB1RSTR_I2C1RST_Msk \
    (0x1U << RCC_APB1RSTR_I2C1RST_Pos)                   /*!< 0x00200000 */
#define RCC_APB1RSTR_I2C1RST    RCC_APB1RSTR_I2C1RST_Msk /*!< I2C 1 reset */
#define RCC_APB1RSTR_PWRRST_Pos (28U)
#define RCC_APB1RSTR_PWRRST_Msk \
    (0x1U << RCC_APB1RSTR_PWRRST_Pos)               /*!< 0x10000000 */
#define RCC_APB1RSTR_PWRRST RCC_APB1RSTR_PWRRST_Msk /*!< PWR reset */

/******************  Bit definition for RCC_AHBENR register  *****************/
#define RCC_AHBENR_DMAEN_Pos  (0U)
#define RCC_AHBENR_DMAEN_Msk  (0x1U << RCC_AHBENR_DMAEN_Pos) /*!< 0x00000001 */
#define RCC_AHBENR_DMAEN      RCC_AHBENR_DMAEN_Msk /*!< DMA1 clock enable */
#define RCC_AHBENR_SRAMEN_Pos (2U)
#define RCC_AHBENR_SRAMEN_Msk                       \
    (0x1U << RCC_AHBENR_SRAMEN_Pos) /*!< 0x00000004 \
                                     */
#define RCC_AHBENR_SRAMEN \
    RCC_AHBENR_SRAMEN_Msk /*!< SRAM interface clock enable */
#define RCC_AHBENR_FLITFEN_Pos (4U)
#define RCC_AHBENR_FLITFEN_Msk \
    (0x1U << RCC_AHBENR_FLITFEN_Pos)                  /*!< 0x00000010 */
#define RCC_AHBENR_FLITFEN     RCC_AHBENR_FLITFEN_Msk /*!< FLITF clock enable */
#define RCC_AHBENR_CRCEN_Pos   (6U)
#define RCC_AHBENR_CRCEN_Msk   (0x1U << RCC_AHBENR_CRCEN_Pos) /*!< 0x00000040 */
#define RCC_AHBENR_CRCEN       RCC_AHBENR_CRCEN_Msk /*!< CRC clock enable */
#define RCC_AHBENR_GPIOAEN_Pos (17U)
#define RCC_AHBENR_GPIOAEN_Msk \
    (0x1U << RCC_AHBENR_GPIOAEN_Pos)                  /*!< 0x00020000 */
#define RCC_AHBENR_GPIOAEN     RCC_AHBENR_GPIOAEN_Msk /*!< GPIOA clock enable */
#define RCC_AHBENR_GPIOBEN_Pos (18U)
#define RCC_AHBENR_GPIOBEN_Msk \
    (0x1U << RCC_AHBENR_GPIOBEN_Pos)                  /*!< 0x00040000 */
#define RCC_AHBENR_GPIOBEN     RCC_AHBENR_GPIOBEN_Msk /*!< GPIOB clock enable */
#define RCC_AHBENR_GPIOCEN_Pos (19U)
#define RCC_AHBENR_GPIOCEN_Msk \
    (0x1U << RCC_AHBENR_GPIOCEN_Pos)                  /*!< 0x00080000 */
#define RCC_AHBENR_GPIOCEN     RCC_AHBENR_GPIOCEN_Msk /*!< GPIOC clock enable */
#define RCC_AHBENR_GPIODEN_Pos (20U)
#define RCC_AHBENR_GPIODEN_Msk \
    (0x1U << RCC_AHBENR_GPIODEN_Pos)                  /*!< 0x00100000 */
#define RCC_AHBENR_GPIODEN     RCC_AHBENR_GPIODEN_Msk /*!< GPIOD clock enable */
#define RCC_AHBENR_GPIOFEN_Pos (22U)
#define RCC_AHBENR_GPIOFEN_Msk \
    (0x1U << RCC_AHBENR_GPIOFEN_Pos)              /*!< 0x00400000 */
#define RCC_AHBENR_GPIOFEN RCC_AHBENR_GPIOFEN_Msk /*!< GPIOF clock enable */

/* Old Bit definition maintained for legacy purpose */
#define RCC_AHBENR_DMA1EN RCC_AHBENR_DMAEN /*!< DMA1 clock enable */
#define RCC_AHBENR_TSEN   RCC_AHBENR_TSCEN /*!< TS clock enable */

/*****************  Bit definition for RCC_APB2ENR register  *****************/
#define RCC_APB2ENR_SYSCFGCOMPEN_Pos (0U)
#define RCC_APB2ENR_SYSCFGCOMPEN_Msk \
    (0x1U << RCC_APB2ENR_SYSCFGCOMPEN_Pos) /*!< 0x00000001 */
#define RCC_APB2ENR_SYSCFGCOMPEN \
    RCC_APB2ENR_SYSCFGCOMPEN_Msk /*!< SYSCFG and comparator clock enable */
#define RCC_APB2ENR_ADCEN_Pos (9U)
#define RCC_APB2ENR_ADCEN_Msk                                        \
    (0x1U << RCC_APB2ENR_ADCEN_Pos)                  /*!< 0x00000200 \
                                                      */
#define RCC_APB2ENR_ADCEN      RCC_APB2ENR_ADCEN_Msk /*!< ADC1 clock enable */
#define RCC_APB2ENR_TIM1EN_Pos (11U)
#define RCC_APB2ENR_TIM1EN_Msk \
    (0x1U << RCC_APB2ENR_TIM1EN_Pos)                  /*!< 0x00000800 */
#define RCC_APB2ENR_TIM1EN     RCC_APB2ENR_TIM1EN_Msk /*!< TIM1 clock enable */
#define RCC_APB2ENR_SPI1EN_Pos (12U)
#define RCC_APB2ENR_SPI1EN_Msk \
    (0x1U << RCC_APB2ENR_SPI1EN_Pos)                    /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN       RCC_APB2ENR_SPI1EN_Msk /*!< SPI1 clock enable */
#define RCC_APB2ENR_USART1EN_Pos (14U)
#define RCC_APB2ENR_USART1EN_Msk \
    (0x1U << RCC_APB2ENR_USART1EN_Pos) /*!< 0x00004000 */
#define RCC_APB2ENR_USART1EN \
    RCC_APB2ENR_USART1EN_Msk /*!< USART1 clock enable */
#define RCC_APB2ENR_TIM16EN_Pos (17U)
#define RCC_APB2ENR_TIM16EN_Msk \
    (0x1U << RCC_APB2ENR_TIM16EN_Pos)                   /*!< 0x00020000 */
#define RCC_APB2ENR_TIM16EN     RCC_APB2ENR_TIM16EN_Msk /*!< TIM16 clock enable */
#define RCC_APB2ENR_TIM17EN_Pos (18U)
#define RCC_APB2ENR_TIM17EN_Msk \
    (0x1U << RCC_APB2ENR_TIM17EN_Pos)                    /*!< 0x00040000 */
#define RCC_APB2ENR_TIM17EN      RCC_APB2ENR_TIM17EN_Msk /*!< TIM17 clock enable */
#define RCC_APB2ENR_DBGMCUEN_Pos (22U)
#define RCC_APB2ENR_DBGMCUEN_Msk \
    (0x1U << RCC_APB2ENR_DBGMCUEN_Pos) /*!< 0x00400000 */
#define RCC_APB2ENR_DBGMCUEN \
    RCC_APB2ENR_DBGMCUEN_Msk /*!< DBGMCU clock enable */

/* Old Bit definition maintained for legacy purpose */
#define RCC_APB2ENR_SYSCFGEN \
    RCC_APB2ENR_SYSCFGCOMPEN                 /*!< SYSCFG clock enable */
#define RCC_APB2ENR_ADC1EN RCC_APB2ENR_ADCEN /*!< ADC1 clock enable */

/*****************  Bit definition for RCC_APB1ENR register  *****************/
#define RCC_APB1ENR_TIM3EN_Pos (1U)
#define RCC_APB1ENR_TIM3EN_Msk \
    (0x1U << RCC_APB1ENR_TIM3EN_Pos)                   /*!< 0x00000002 */
#define RCC_APB1ENR_TIM3EN      RCC_APB1ENR_TIM3EN_Msk /*!< Timer 3 clock enable */
#define RCC_APB1ENR_TIM14EN_Pos (8U)
#define RCC_APB1ENR_TIM14EN_Msk \
    (0x1U << RCC_APB1ENR_TIM14EN_Pos) /*!< 0x00000100 */
#define RCC_APB1ENR_TIM14EN \
    RCC_APB1ENR_TIM14EN_Msk /*!< Timer 14 clock enable */
#define RCC_APB1ENR_WWDGEN_Pos (11U)
#define RCC_APB1ENR_WWDGEN_Msk \
    (0x1U << RCC_APB1ENR_WWDGEN_Pos) /*!< 0x00000800 */
#define RCC_APB1ENR_WWDGEN \
    RCC_APB1ENR_WWDGEN_Msk /*!< Window Watchdog clock enable */
#define RCC_APB1ENR_I2C1EN_Pos (21U)
#define RCC_APB1ENR_I2C1EN_Msk \
    (0x1U << RCC_APB1ENR_I2C1EN_Pos)                 /*!< 0x00200000 */
#define RCC_APB1ENR_I2C1EN    RCC_APB1ENR_I2C1EN_Msk /*!< I2C1 clock enable */
#define RCC_APB1ENR_PWREN_Pos (28U)
#define RCC_APB1ENR_PWREN_Msk                                   \
    (0x1U << RCC_APB1ENR_PWREN_Pos)             /*!< 0x10000000 \
                                                 */
#define RCC_APB1ENR_PWREN RCC_APB1ENR_PWREN_Msk /*!< PWR clock enable */

/*******************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos (0U)
#define RCC_BDCR_LSEON_Msk (0x1U << RCC_BDCR_LSEON_Pos) /*!< 0x00000001 */
#define RCC_BDCR_LSEON \
    RCC_BDCR_LSEON_Msk /*!< External Low Speed oscillator enable */
#define RCC_BDCR_LSERDY_Pos (1U)
#define RCC_BDCR_LSERDY_Msk (0x1U << RCC_BDCR_LSERDY_Pos) /*!< 0x00000002 */
#define RCC_BDCR_LSERDY \
    RCC_BDCR_LSERDY_Msk /*!< External Low Speed oscillator Ready */
#define RCC_BDCR_LSEBYP_Pos (2U)
#define RCC_BDCR_LSEBYP_Msk (0x1U << RCC_BDCR_LSEBYP_Pos) /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP \
    RCC_BDCR_LSEBYP_Msk /*!< External Low Speed oscillator Bypass */

#define RCC_BDCR_LSEDRV_Pos (3U)
#define RCC_BDCR_LSEDRV_Msk (0x3U << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV \
    RCC_BDCR_LSEDRV_Msk /*!< LSEDRV[1:0] bits (LSE Osc. drive capability) */
#define RCC_BDCR_LSEDRV_0 (0x1U << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1 (0x2U << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000010 */

#define RCC_BDCR_RTCSEL_Pos (8U)
#define RCC_BDCR_RTCSEL_Msk (0x3U << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL \
    RCC_BDCR_RTCSEL_Msk /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_BDCR_RTCSEL_0 (0x1U << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1 (0x2U << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000200 */

