niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/*!< RTC configuration */
#define RCC_BDCR_RTCSEL_NOCLOCK (0x00000000U) /*!< No clock */
#define RCC_BDCR_RTCSEL_LSE \
    (0x00000100U) /*!< LSE oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_LSI \
    (0x00000200U) /*!< LSI oscillator clock used as RTC clock */
#define RCC_BDCR_RTCSEL_HSE                                                  \
    (0x00000300U) /*!< HSE oscillator clock divided by 128 used as RTC clock \
                   */

#define RCC_BDCR_RTCEN_Pos (15U)
#define RCC_BDCR_RTCEN_Msk (0x1U << RCC_BDCR_RTCEN_Pos) /*!< 0x00008000 */
#define RCC_BDCR_RTCEN     RCC_BDCR_RTCEN_Msk           /*!< RTC clock enable */
#define RCC_BDCR_BDRST_Pos (16U)
#define RCC_BDCR_BDRST_Msk (0x1U << RCC_BDCR_BDRST_Pos) /*!< 0x00010000 */
#define RCC_BDCR_BDRST     RCC_BDCR_BDRST_Msk /*!< Backup domain software reset */

/*******************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos (0U)
#define RCC_CSR_LSION_Msk (0x1U << RCC_CSR_LSION_Pos) /*!< 0x00000001 */
#define RCC_CSR_LSION \
    RCC_CSR_LSION_Msk /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY_Pos (1U)
#define RCC_CSR_LSIRDY_Msk (0x1U << RCC_CSR_LSIRDY_Pos) /*!< 0x00000002 */
#define RCC_CSR_LSIRDY \
    RCC_CSR_LSIRDY_Msk /*!< Internal Low Speed oscillator Ready */
#define RCC_CSR_V18PWRRSTF_Pos (23U)
#define RCC_CSR_V18PWRRSTF_Msk \
    (0x1U << RCC_CSR_V18PWRRSTF_Pos) /*!< 0x00800000 */
#define RCC_CSR_V18PWRRSTF \
    RCC_CSR_V18PWRRSTF_Msk /*!< V1.8 power domain reset flag */
#define RCC_CSR_RMVF_Pos     (24U)
#define RCC_CSR_RMVF_Msk     (0x1U << RCC_CSR_RMVF_Pos) /*!< 0x01000000 */
#define RCC_CSR_RMVF         RCC_CSR_RMVF_Msk /*!< Remove reset flag */
#define RCC_CSR_OBLRSTF_Pos  (25U)
#define RCC_CSR_OBLRSTF_Msk  (0x1U << RCC_CSR_OBLRSTF_Pos) /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF      RCC_CSR_OBLRSTF_Msk /*!< OBL reset flag */
#define RCC_CSR_PINRSTF_Pos  (26U)
#define RCC_CSR_PINRSTF_Msk  (0x1U << RCC_CSR_PINRSTF_Pos) /*!< 0x04000000 */
#define RCC_CSR_PINRSTF      RCC_CSR_PINRSTF_Msk /*!< PIN reset flag */
#define RCC_CSR_PORRSTF_Pos  (27U)
#define RCC_CSR_PORRSTF_Msk  (0x1U << RCC_CSR_PORRSTF_Pos) /*!< 0x08000000 */
#define RCC_CSR_PORRSTF      RCC_CSR_PORRSTF_Msk /*!< POR/PDR reset flag */
#define RCC_CSR_SFTRSTF_Pos  (28U)
#define RCC_CSR_SFTRSTF_Msk  (0x1U << RCC_CSR_SFTRSTF_Pos) /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF      RCC_CSR_SFTRSTF_Msk /*!< Software Reset flag */
#define RCC_CSR_IWDGRSTF_Pos (29U)
#define RCC_CSR_IWDGRSTF_Msk (0x1U << RCC_CSR_IWDGRSTF_Pos) /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF \
    RCC_CSR_IWDGRSTF_Msk /*!< Independent Watchdog reset flag */
#define RCC_CSR_WWDGRSTF_Pos (30U)
#define RCC_CSR_WWDGRSTF_Msk (0x1U << RCC_CSR_WWDGRSTF_Pos) /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                                 \
    RCC_CSR_WWDGRSTF_Msk /*!< Window watchdog reset flag \
                          */
#define RCC_CSR_LPWRRSTF_Pos (31U)
#define RCC_CSR_LPWRRSTF_Msk (0x1U << RCC_CSR_LPWRRSTF_Pos) /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF     RCC_CSR_LPWRRSTF_Msk /*!< Low-Power reset flag */

/* Old Bit definition maintained for legacy purpose */
#define RCC_CSR_OBL RCC_CSR_OBLRSTF /*!< OBL reset flag */

/*******************  Bit definition for RCC_AHBRSTR register  ***************/
#define RCC_AHBRSTR_GPIOARST_Pos (17U)
#define RCC_AHBRSTR_GPIOARST_Msk \
    (0x1U << RCC_AHBRSTR_GPIOARST_Pos)                    /*!< 0x00020000 */
#define RCC_AHBRSTR_GPIOARST     RCC_AHBRSTR_GPIOARST_Msk /*!< GPIOA reset */
#define RCC_AHBRSTR_GPIOBRST_Pos (18U)
#define RCC_AHBRSTR_GPIOBRST_Msk \
    (0x1U << RCC_AHBRSTR_GPIOBRST_Pos)                    /*!< 0x00040000 */
#define RCC_AHBRSTR_GPIOBRST     RCC_AHBRSTR_GPIOBRST_Msk /*!< GPIOB reset */
#define RCC_AHBRSTR_GPIOCRST_Pos (19U)
#define RCC_AHBRSTR_GPIOCRST_Msk \
    (0x1U << RCC_AHBRSTR_GPIOCRST_Pos)                    /*!< 0x00080000 */
#define RCC_AHBRSTR_GPIOCRST     RCC_AHBRSTR_GPIOCRST_Msk /*!< GPIOC reset */
#define RCC_AHBRSTR_GPIODRST_Pos (20U)
#define RCC_AHBRSTR_GPIODRST_Msk \
    (0x1U << RCC_AHBRSTR_GPIODRST_Pos)                    /*!< 0x00100000 */
#define RCC_AHBRSTR_GPIODRST     RCC_AHBRSTR_GPIODRST_Msk /*!< GPIOD reset */
#define RCC_AHBRSTR_GPIOFRST_Pos (22U)
#define RCC_AHBRSTR_GPIOFRST_Msk \
    (0x1U << RCC_AHBRSTR_GPIOFRST_Pos)                /*!< 0x00400000 */
#define RCC_AHBRSTR_GPIOFRST RCC_AHBRSTR_GPIOFRST_Msk /*!< GPIOF reset */

/*******************  Bit definition for RCC_CFGR2 register  *****************/
/*!< PREDIV configuration */
#define RCC_CFGR2_PREDIV_Pos (0U)
#define RCC_CFGR2_PREDIV_Msk (0xFU << RCC_CFGR2_PREDIV_Pos) /*!< 0x0000000F */
#define RCC_CFGR2_PREDIV     RCC_CFGR2_PREDIV_Msk /*!< PREDIV[3:0] bits */
#define RCC_CFGR2_PREDIV_0   (0x1U << RCC_CFGR2_PREDIV_Pos) /*!< 0x00000001 */
#define RCC_CFGR2_PREDIV_1   (0x2U << RCC_CFGR2_PREDIV_Pos) /*!< 0x00000002 */
#define RCC_CFGR2_PREDIV_2   (0x4U << RCC_CFGR2_PREDIV_Pos) /*!< 0x00000004 */
#define RCC_CFGR2_PREDIV_3   (0x8U << RCC_CFGR2_PREDIV_Pos) /*!< 0x00000008 */

#define RCC_CFGR2_PREDIV_DIV1 \
    (0x00000000U) /*!< PREDIV input clock not divided */
#define RCC_CFGR2_PREDIV_DIV2 \
    (0x00000001U) /*!< PREDIV input clock divided by 2 */
#define RCC_CFGR2_PREDIV_DIV3 \
    (0x00000002U) /*!< PREDIV input clock divided by 3 */
#define RCC_CFGR2_PREDIV_DIV4 \
    (0x00000003U) /*!< PREDIV input clock divided by 4 */
#define RCC_CFGR2_PREDIV_DIV5 \
    (0x00000004U) /*!< PREDIV input clock divided by 5 */
#define RCC_CFGR2_PREDIV_DIV6 \
    (0x00000005U) /*!< PREDIV input clock divided by 6 */
#define RCC_CFGR2_PREDIV_DIV7 \
    (0x00000006U) /*!< PREDIV input clock divided by 7 */
#define RCC_CFGR2_PREDIV_DIV8 \
    (0x00000007U) /*!< PREDIV input clock divided by 8 */
#define RCC_CFGR2_PREDIV_DIV9 \
    (0x00000008U) /*!< PREDIV input clock divided by 9 */
#define RCC_CFGR2_PREDIV_DIV10 \
    (0x00000009U) /*!< PREDIV input clock divided by 10 */
#define RCC_CFGR2_PREDIV_DIV11 \
    (0x0000000AU) /*!< PREDIV input clock divided by 11 */
#define RCC_CFGR2_PREDIV_DIV12 \
    (0x0000000BU) /*!< PREDIV input clock divided by 12 */
#define RCC_CFGR2_PREDIV_DIV13 \
    (0x0000000CU) /*!< PREDIV input clock divided by 13 */
#define RCC_CFGR2_PREDIV_DIV14 \
    (0x0000000DU) /*!< PREDIV input clock divided by 14 */
#define RCC_CFGR2_PREDIV_DIV15 \
    (0x0000000EU) /*!< PREDIV input clock divided by 15 */
#define RCC_CFGR2_PREDIV_DIV16 \
    (0x0000000FU) /*!< PREDIV input clock divided by 16 */

/*******************  Bit definition for RCC_CFGR3 register  *****************/
/*!< USART1 Clock source selection */
#define RCC_CFGR3_USART1SW_Pos (0U)
#define RCC_CFGR3_USART1SW_Msk \
    (0x3U << RCC_CFGR3_USART1SW_Pos)              /*!< 0x00000003 */
#define RCC_CFGR3_USART1SW RCC_CFGR3_USART1SW_Msk /*!< USART1SW[1:0] bits */
#define RCC_CFGR3_USART1SW_0                         \
    (0x1U << RCC_CFGR3_USART1SW_Pos) /*!< 0x00000001 \
                                      */
#define RCC_CFGR3_USART1SW_1                         \
    (0x2U << RCC_CFGR3_USART1SW_Pos) /*!< 0x00000002 \
                                      */

#define RCC_CFGR3_USART1SW_PCLK \
    (0x00000000U) /*!< PCLK clock used as USART1 clock source */
#define RCC_CFGR3_USART1SW_SYSCLK                                   \
    (0x00000001U) /*!< System clock selected as USART1 clock source \
                   */
#define RCC_CFGR3_USART1SW_LSE \
    (0x00000002U) /*!< LSE oscillator clock used as USART1 clock source */
#define RCC_CFGR3_USART1SW_HSI \
    (0x00000003U) /*!< HSI oscillator clock used as USART1 clock source */

/*!< I2C1 Clock source selection */
#define RCC_CFGR3_I2C1SW_Pos (4U)
#define RCC_CFGR3_I2C1SW_Msk (0x1U << RCC_CFGR3_I2C1SW_Pos) /*!< 0x00000010 */
#define RCC_CFGR3_I2C1SW     RCC_CFGR3_I2C1SW_Msk           /*!< I2C1SW bits */

