niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
#define RCC_CFGR3_I2C1SW_HSI \
    (0x00000000U) /*!< HSI oscillator clock used as I2C1 clock source */
#define RCC_CFGR3_I2C1SW_SYSCLK_Pos (4U)
#define RCC_CFGR3_I2C1SW_SYSCLK_Msk \
    (0x1U << RCC_CFGR3_I2C1SW_SYSCLK_Pos) /*!< 0x00000010 */
#define RCC_CFGR3_I2C1SW_SYSCLK                                          \
    RCC_CFGR3_I2C1SW_SYSCLK_Msk /*!< System clock selected as I2C1 clock \
                                   source */

/*******************  Bit definition for RCC_CR2 register  *******************/
#define RCC_CR2_HSI14ON_Pos (0U)
#define RCC_CR2_HSI14ON_Msk (0x1U << RCC_CR2_HSI14ON_Pos) /*!< 0x00000001 */
#define RCC_CR2_HSI14ON \
    RCC_CR2_HSI14ON_Msk /*!< Internal High Speed 14MHz clock enable */
#define RCC_CR2_HSI14RDY_Pos (1U)
#define RCC_CR2_HSI14RDY_Msk (0x1U << RCC_CR2_HSI14RDY_Pos) /*!< 0x00000002 */
#define RCC_CR2_HSI14RDY \
    RCC_CR2_HSI14RDY_Msk /*!< Internal High Speed 14MHz clock ready flag */
#define RCC_CR2_HSI14DIS_Pos (2U)
#define RCC_CR2_HSI14DIS_Msk (0x1U << RCC_CR2_HSI14DIS_Pos) /*!< 0x00000004 */
#define RCC_CR2_HSI14DIS \
    RCC_CR2_HSI14DIS_Msk /*!< Internal High Speed 14MHz clock disable */
#define RCC_CR2_HSI14TRIM_Pos (3U)
#define RCC_CR2_HSI14TRIM_Msk \
    (0x1FU << RCC_CR2_HSI14TRIM_Pos) /*!< 0x000000F8 */
#define RCC_CR2_HSI14TRIM \
    RCC_CR2_HSI14TRIM_Msk /*!< Internal High Speed 14MHz clock trimming */
#define RCC_CR2_HSI14CAL_Pos (8U)
#define RCC_CR2_HSI14CAL_Msk                        \
    (0xFFU << RCC_CR2_HSI14CAL_Pos) /*!< 0x0000FF00 \
                                     */
#define RCC_CR2_HSI14CAL \
    RCC_CR2_HSI14CAL_Msk /*!< Internal High Speed 14MHz clock Calibration */

/*****************************************************************************/
/*                                                                           */
/*                           Real-Time Clock (RTC)                           */
/*                                                                           */
/*****************************************************************************/
/*
 * @brief Specific device feature definitions  (not present on all devices in
 * the STM32F0 serie)
 */
#define RTC_TAMPER1_SUPPORT /*!< TAMPER 1 feature support */
#define RTC_TAMPER2_SUPPORT /*!< TAMPER 2 feature support */

/********************  Bits definition for RTC_TR register  ******************/
#define RTC_TR_PM_Pos  (22U)
#define RTC_TR_PM_Msk  (0x1U << RTC_TR_PM_Pos) /*!< 0x00400000 */
#define RTC_TR_PM      RTC_TR_PM_Msk
#define RTC_TR_HT_Pos  (20U)
#define RTC_TR_HT_Msk  (0x3U << RTC_TR_HT_Pos) /*!< 0x00300000 */
#define RTC_TR_HT      RTC_TR_HT_Msk
#define RTC_TR_HT_0    (0x1U << RTC_TR_HT_Pos) /*!< 0x00100000 */
#define RTC_TR_HT_1    (0x2U << RTC_TR_HT_Pos) /*!< 0x00200000 */
#define RTC_TR_HU_Pos  (16U)
#define RTC_TR_HU_Msk  (0xFU << RTC_TR_HU_Pos) /*!< 0x000F0000 */
#define RTC_TR_HU      RTC_TR_HU_Msk
#define RTC_TR_HU_0    (0x1U << RTC_TR_HU_Pos) /*!< 0x00010000 */
#define RTC_TR_HU_1    (0x2U << RTC_TR_HU_Pos) /*!< 0x00020000 */
#define RTC_TR_HU_2    (0x4U << RTC_TR_HU_Pos) /*!< 0x00040000 */
#define RTC_TR_HU_3    (0x8U << RTC_TR_HU_Pos) /*!< 0x00080000 */
#define RTC_TR_MNT_Pos (12U)
#define RTC_TR_MNT_Msk (0x7U << RTC_TR_MNT_Pos) /*!< 0x00007000 */
#define RTC_TR_MNT     RTC_TR_MNT_Msk
#define RTC_TR_MNT_0   (0x1U << RTC_TR_MNT_Pos) /*!< 0x00001000 */
#define RTC_TR_MNT_1   (0x2U << RTC_TR_MNT_Pos) /*!< 0x00002000 */
#define RTC_TR_MNT_2   (0x4U << RTC_TR_MNT_Pos) /*!< 0x00004000 */
#define RTC_TR_MNU_Pos (8U)
#define RTC_TR_MNU_Msk (0xFU << RTC_TR_MNU_Pos) /*!< 0x00000F00 */
#define RTC_TR_MNU     RTC_TR_MNU_Msk
#define RTC_TR_MNU_0   (0x1U << RTC_TR_MNU_Pos) /*!< 0x00000100 */
#define RTC_TR_MNU_1   (0x2U << RTC_TR_MNU_Pos) /*!< 0x00000200 */
#define RTC_TR_MNU_2   (0x4U << RTC_TR_MNU_Pos) /*!< 0x00000400 */
#define RTC_TR_MNU_3   (0x8U << RTC_TR_MNU_Pos) /*!< 0x00000800 */
#define RTC_TR_ST_Pos  (4U)
#define RTC_TR_ST_Msk  (0x7U << RTC_TR_ST_Pos) /*!< 0x00000070 */
#define RTC_TR_ST      RTC_TR_ST_Msk
#define RTC_TR_ST_0    (0x1U << RTC_TR_ST_Pos) /*!< 0x00000010 */
#define RTC_TR_ST_1    (0x2U << RTC_TR_ST_Pos) /*!< 0x00000020 */
#define RTC_TR_ST_2    (0x4U << RTC_TR_ST_Pos) /*!< 0x00000040 */
#define RTC_TR_SU_Pos  (0U)
#define RTC_TR_SU_Msk  (0xFU << RTC_TR_SU_Pos) /*!< 0x0000000F */
#define RTC_TR_SU      RTC_TR_SU_Msk
#define RTC_TR_SU_0    (0x1U << RTC_TR_SU_Pos) /*!< 0x00000001 */
#define RTC_TR_SU_1    (0x2U << RTC_TR_SU_Pos) /*!< 0x00000002 */
#define RTC_TR_SU_2    (0x4U << RTC_TR_SU_Pos) /*!< 0x00000004 */
#define RTC_TR_SU_3    (0x8U << RTC_TR_SU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_DR register  ******************/
#define RTC_DR_YT_Pos  (20U)
#define RTC_DR_YT_Msk  (0xFU << RTC_DR_YT_Pos) /*!< 0x00F00000 */
#define RTC_DR_YT      RTC_DR_YT_Msk
#define RTC_DR_YT_0    (0x1U << RTC_DR_YT_Pos) /*!< 0x00100000 */
#define RTC_DR_YT_1    (0x2U << RTC_DR_YT_Pos) /*!< 0x00200000 */
#define RTC_DR_YT_2    (0x4U << RTC_DR_YT_Pos) /*!< 0x00400000 */
#define RTC_DR_YT_3    (0x8U << RTC_DR_YT_Pos) /*!< 0x00800000 */
#define RTC_DR_YU_Pos  (16U)
#define RTC_DR_YU_Msk  (0xFU << RTC_DR_YU_Pos) /*!< 0x000F0000 */
#define RTC_DR_YU      RTC_DR_YU_Msk
#define RTC_DR_YU_0    (0x1U << RTC_DR_YU_Pos) /*!< 0x00010000 */
#define RTC_DR_YU_1    (0x2U << RTC_DR_YU_Pos) /*!< 0x00020000 */
#define RTC_DR_YU_2    (0x4U << RTC_DR_YU_Pos) /*!< 0x00040000 */
#define RTC_DR_YU_3    (0x8U << RTC_DR_YU_Pos) /*!< 0x00080000 */
#define RTC_DR_WDU_Pos (13U)
#define RTC_DR_WDU_Msk (0x7U << RTC_DR_WDU_Pos) /*!< 0x0000E000 */
#define RTC_DR_WDU     RTC_DR_WDU_Msk
#define RTC_DR_WDU_0   (0x1U << RTC_DR_WDU_Pos) /*!< 0x00002000 */
#define RTC_DR_WDU_1   (0x2U << RTC_DR_WDU_Pos) /*!< 0x00004000 */
#define RTC_DR_WDU_2   (0x4U << RTC_DR_WDU_Pos) /*!< 0x00008000 */
#define RTC_DR_MT_Pos  (12U)
#define RTC_DR_MT_Msk  (0x1U << RTC_DR_MT_Pos) /*!< 0x00001000 */
#define RTC_DR_MT      RTC_DR_MT_Msk
#define RTC_DR_MU_Pos  (8U)
#define RTC_DR_MU_Msk  (0xFU << RTC_DR_MU_Pos) /*!< 0x00000F00 */
#define RTC_DR_MU      RTC_DR_MU_Msk
#define RTC_DR_MU_0    (0x1U << RTC_DR_MU_Pos) /*!< 0x00000100 */
#define RTC_DR_MU_1    (0x2U << RTC_DR_MU_Pos) /*!< 0x00000200 */
#define RTC_DR_MU_2    (0x4U << RTC_DR_MU_Pos) /*!< 0x00000400 */
#define RTC_DR_MU_3    (0x8U << RTC_DR_MU_Pos) /*!< 0x00000800 */
#define RTC_DR_DT_Pos  (4U)
#define RTC_DR_DT_Msk  (0x3U << RTC_DR_DT_Pos) /*!< 0x00000030 */
#define RTC_DR_DT      RTC_DR_DT_Msk
#define RTC_DR_DT_0    (0x1U << RTC_DR_DT_Pos) /*!< 0x00000010 */
#define RTC_DR_DT_1    (0x2U << RTC_DR_DT_Pos) /*!< 0x00000020 */
#define RTC_DR_DU_Pos  (0U)
#define RTC_DR_DU_Msk  (0xFU << RTC_DR_DU_Pos) /*!< 0x0000000F */
#define RTC_DR_DU      RTC_DR_DU_Msk
#define RTC_DR_DU_0    (0x1U << RTC_DR_DU_Pos) /*!< 0x00000001 */
#define RTC_DR_DU_1    (0x2U << RTC_DR_DU_Pos) /*!< 0x00000002 */
#define RTC_DR_DU_2    (0x4U << RTC_DR_DU_Pos) /*!< 0x00000004 */
#define RTC_DR_DU_3    (0x8U << RTC_DR_DU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_CR register  ******************/
#define RTC_CR_COE_Pos     (23U)
#define RTC_CR_COE_Msk     (0x1U << RTC_CR_COE_Pos) /*!< 0x00800000 */
#define RTC_CR_COE         RTC_CR_COE_Msk
#define RTC_CR_OSEL_Pos    (21U)
#define RTC_CR_OSEL_Msk    (0x3U << RTC_CR_OSEL_Pos) /*!< 0x00600000 */
#define RTC_CR_OSEL        RTC_CR_OSEL_Msk
#define RTC_CR_OSEL_0      (0x1U << RTC_CR_OSEL_Pos) /*!< 0x00200000 */
#define RTC_CR_OSEL_1      (0x2U << RTC_CR_OSEL_Pos) /*!< 0x00400000 */
#define RTC_CR_POL_Pos     (20U)
#define RTC_CR_POL_Msk     (0x1U << RTC_CR_POL_Pos) /*!< 0x00100000 */
#define RTC_CR_POL         RTC_CR_POL_Msk
#define RTC_CR_COSEL_Pos   (19U)
#define RTC_CR_COSEL_Msk   (0x1U << RTC_CR_COSEL_Pos) /*!< 0x00080000 */
#define RTC_CR_COSEL       RTC_CR_COSEL_Msk
#define RTC_CR_BKP_Pos     (18U)
#define RTC_CR_BKP_Msk     (0x1U << RTC_CR_BKP_Pos) /*!< 0x00040000 */
#define RTC_CR_BKP         RTC_CR_BKP_Msk
#define RTC_CR_SUB1H_Pos   (17U)
#define RTC_CR_SUB1H_Msk   (0x1U << RTC_CR_SUB1H_Pos) /*!< 0x00020000 */
#define RTC_CR_SUB1H       RTC_CR_SUB1H_Msk
#define RTC_CR_ADD1H_Pos   (16U)
#define RTC_CR_ADD1H_Msk   (0x1U << RTC_CR_ADD1H_Pos) /*!< 0x00010000 */
#define RTC_CR_ADD1H       RTC_CR_ADD1H_Msk
#define RTC_CR_TSIE_Pos    (15U)
#define RTC_CR_TSIE_Msk    (0x1U << RTC_CR_TSIE_Pos) /*!< 0x00008000 */
#define RTC_CR_TSIE        RTC_CR_TSIE_Msk
#define RTC_CR_ALRAIE_Pos  (12U)
#define RTC_CR_ALRAIE_Msk  (0x1U << RTC_CR_ALRAIE_Pos) /*!< 0x00001000 */
#define RTC_CR_ALRAIE      RTC_CR_ALRAIE_Msk
#define RTC_CR_TSE_Pos     (11U)
#define RTC_CR_TSE_Msk     (0x1U << RTC_CR_TSE_Pos) /*!< 0x00000800 */
#define RTC_CR_TSE         RTC_CR_TSE_Msk
#define RTC_CR_ALRAE_Pos   (8U)
#define RTC_CR_ALRAE_Msk   (0x1U << RTC_CR_ALRAE_Pos) /*!< 0x00000100 */
#define RTC_CR_ALRAE       RTC_CR_ALRAE_Msk
#define RTC_CR_FMT_Pos     (6U)
#define RTC_CR_FMT_Msk     (0x1U << RTC_CR_FMT_Pos) /*!< 0x00000040 */
#define RTC_CR_FMT         RTC_CR_FMT_Msk
#define RTC_CR_BYPSHAD_Pos (5U)
#define RTC_CR_BYPSHAD_Msk (0x1U << RTC_CR_BYPSHAD_Pos) /*!< 0x00000020 */
#define RTC_CR_BYPSHAD     RTC_CR_BYPSHAD_Msk
#define RTC_CR_REFCKON_Pos (4U)
#define RTC_CR_REFCKON_Msk (0x1U << RTC_CR_REFCKON_Pos) /*!< 0x00000010 */
#define RTC_CR_REFCKON     RTC_CR_REFCKON_Msk
#define RTC_CR_TSEDGE_Pos  (3U)
#define RTC_CR_TSEDGE_Msk  (0x1U << RTC_CR_TSEDGE_Pos) /*!< 0x00000008 */
#define RTC_CR_TSEDGE      RTC_CR_TSEDGE_Msk

