niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/* Legacy defines */
#define RTC_CR_BCK_Pos RTC_CR_BKP_Pos
#define RTC_CR_BCK_Msk RTC_CR_BKP_Msk
#define RTC_CR_BCK     RTC_CR_BKP

/********************  Bits definition for RTC_ISR register  *****************/
#define RTC_ISR_RECALPF_Pos (16U)
#define RTC_ISR_RECALPF_Msk (0x1U << RTC_ISR_RECALPF_Pos) /*!< 0x00010000 */
#define RTC_ISR_RECALPF     RTC_ISR_RECALPF_Msk
#define RTC_ISR_TAMP2F_Pos  (14U)
#define RTC_ISR_TAMP2F_Msk  (0x1U << RTC_ISR_TAMP2F_Pos) /*!< 0x00004000 */
#define RTC_ISR_TAMP2F      RTC_ISR_TAMP2F_Msk
#define RTC_ISR_TAMP1F_Pos  (13U)
#define RTC_ISR_TAMP1F_Msk  (0x1U << RTC_ISR_TAMP1F_Pos) /*!< 0x00002000 */
#define RTC_ISR_TAMP1F      RTC_ISR_TAMP1F_Msk
#define RTC_ISR_TSOVF_Pos   (12U)
#define RTC_ISR_TSOVF_Msk   (0x1U << RTC_ISR_TSOVF_Pos) /*!< 0x00001000 */
#define RTC_ISR_TSOVF       RTC_ISR_TSOVF_Msk
#define RTC_ISR_TSF_Pos     (11U)
#define RTC_ISR_TSF_Msk     (0x1U << RTC_ISR_TSF_Pos) /*!< 0x00000800 */
#define RTC_ISR_TSF         RTC_ISR_TSF_Msk
#define RTC_ISR_ALRAF_Pos   (8U)
#define RTC_ISR_ALRAF_Msk   (0x1U << RTC_ISR_ALRAF_Pos) /*!< 0x00000100 */
#define RTC_ISR_ALRAF       RTC_ISR_ALRAF_Msk
#define RTC_ISR_INIT_Pos    (7U)
#define RTC_ISR_INIT_Msk    (0x1U << RTC_ISR_INIT_Pos) /*!< 0x00000080 */
#define RTC_ISR_INIT        RTC_ISR_INIT_Msk
#define RTC_ISR_INITF_Pos   (6U)
#define RTC_ISR_INITF_Msk   (0x1U << RTC_ISR_INITF_Pos) /*!< 0x00000040 */
#define RTC_ISR_INITF       RTC_ISR_INITF_Msk
#define RTC_ISR_RSF_Pos     (5U)
#define RTC_ISR_RSF_Msk     (0x1U << RTC_ISR_RSF_Pos) /*!< 0x00000020 */
#define RTC_ISR_RSF         RTC_ISR_RSF_Msk
#define RTC_ISR_INITS_Pos   (4U)
#define RTC_ISR_INITS_Msk   (0x1U << RTC_ISR_INITS_Pos) /*!< 0x00000010 */
#define RTC_ISR_INITS       RTC_ISR_INITS_Msk
#define RTC_ISR_SHPF_Pos    (3U)
#define RTC_ISR_SHPF_Msk    (0x1U << RTC_ISR_SHPF_Pos) /*!< 0x00000008 */
#define RTC_ISR_SHPF        RTC_ISR_SHPF_Msk
#define RTC_ISR_ALRAWF_Pos  (0U)
#define RTC_ISR_ALRAWF_Msk  (0x1U << RTC_ISR_ALRAWF_Pos) /*!< 0x00000001 */
#define RTC_ISR_ALRAWF      RTC_ISR_ALRAWF_Msk

/********************  Bits definition for RTC_PRER register  ****************/
#define RTC_PRER_PREDIV_A_Pos (16U)
#define RTC_PRER_PREDIV_A_Msk \
    (0x7FU << RTC_PRER_PREDIV_A_Pos) /*!< 0x007F0000 */
#define RTC_PRER_PREDIV_A     RTC_PRER_PREDIV_A_Msk
#define RTC_PRER_PREDIV_S_Pos (0U)
#define RTC_PRER_PREDIV_S_Msk \
    (0x7FFFU << RTC_PRER_PREDIV_S_Pos) /*!< 0x00007FFF */
#define RTC_PRER_PREDIV_S RTC_PRER_PREDIV_S_Msk

/********************  Bits definition for RTC_ALRMAR register  **************/
#define RTC_ALRMAR_MSK4_Pos  (31U)
#define RTC_ALRMAR_MSK4_Msk  (0x1U << RTC_ALRMAR_MSK4_Pos) /*!< 0x80000000 */
#define RTC_ALRMAR_MSK4      RTC_ALRMAR_MSK4_Msk
#define RTC_ALRMAR_WDSEL_Pos (30U)
#define RTC_ALRMAR_WDSEL_Msk (0x1U << RTC_ALRMAR_WDSEL_Pos) /*!< 0x40000000 */
#define RTC_ALRMAR_WDSEL     RTC_ALRMAR_WDSEL_Msk
#define RTC_ALRMAR_DT_Pos    (28U)
#define RTC_ALRMAR_DT_Msk    (0x3U << RTC_ALRMAR_DT_Pos) /*!< 0x30000000 */
#define RTC_ALRMAR_DT        RTC_ALRMAR_DT_Msk
#define RTC_ALRMAR_DT_0      (0x1U << RTC_ALRMAR_DT_Pos) /*!< 0x10000000 */
#define RTC_ALRMAR_DT_1      (0x2U << RTC_ALRMAR_DT_Pos) /*!< 0x20000000 */
#define RTC_ALRMAR_DU_Pos    (24U)
#define RTC_ALRMAR_DU_Msk    (0xFU << RTC_ALRMAR_DU_Pos) /*!< 0x0F000000 */
#define RTC_ALRMAR_DU        RTC_ALRMAR_DU_Msk
#define RTC_ALRMAR_DU_0      (0x1U << RTC_ALRMAR_DU_Pos) /*!< 0x01000000 */
#define RTC_ALRMAR_DU_1      (0x2U << RTC_ALRMAR_DU_Pos) /*!< 0x02000000 */
#define RTC_ALRMAR_DU_2      (0x4U << RTC_ALRMAR_DU_Pos) /*!< 0x04000000 */
#define RTC_ALRMAR_DU_3      (0x8U << RTC_ALRMAR_DU_Pos) /*!< 0x08000000 */
#define RTC_ALRMAR_MSK3_Pos  (23U)
#define RTC_ALRMAR_MSK3_Msk  (0x1U << RTC_ALRMAR_MSK3_Pos) /*!< 0x00800000 */
#define RTC_ALRMAR_MSK3      RTC_ALRMAR_MSK3_Msk
#define RTC_ALRMAR_PM_Pos    (22U)
#define RTC_ALRMAR_PM_Msk    (0x1U << RTC_ALRMAR_PM_Pos) /*!< 0x00400000 */
#define RTC_ALRMAR_PM        RTC_ALRMAR_PM_Msk
#define RTC_ALRMAR_HT_Pos    (20U)
#define RTC_ALRMAR_HT_Msk    (0x3U << RTC_ALRMAR_HT_Pos) /*!< 0x00300000 */
#define RTC_ALRMAR_HT        RTC_ALRMAR_HT_Msk
#define RTC_ALRMAR_HT_0      (0x1U << RTC_ALRMAR_HT_Pos) /*!< 0x00100000 */
#define RTC_ALRMAR_HT_1      (0x2U << RTC_ALRMAR_HT_Pos) /*!< 0x00200000 */
#define RTC_ALRMAR_HU_Pos    (16U)
#define RTC_ALRMAR_HU_Msk    (0xFU << RTC_ALRMAR_HU_Pos) /*!< 0x000F0000 */
#define RTC_ALRMAR_HU        RTC_ALRMAR_HU_Msk
#define RTC_ALRMAR_HU_0      (0x1U << RTC_ALRMAR_HU_Pos) /*!< 0x00010000 */
#define RTC_ALRMAR_HU_1      (0x2U << RTC_ALRMAR_HU_Pos) /*!< 0x00020000 */
#define RTC_ALRMAR_HU_2      (0x4U << RTC_ALRMAR_HU_Pos) /*!< 0x00040000 */
#define RTC_ALRMAR_HU_3      (0x8U << RTC_ALRMAR_HU_Pos) /*!< 0x00080000 */
#define RTC_ALRMAR_MSK2_Pos  (15U)
#define RTC_ALRMAR_MSK2_Msk  (0x1U << RTC_ALRMAR_MSK2_Pos) /*!< 0x00008000 */
#define RTC_ALRMAR_MSK2      RTC_ALRMAR_MSK2_Msk
#define RTC_ALRMAR_MNT_Pos   (12U)
#define RTC_ALRMAR_MNT_Msk   (0x7U << RTC_ALRMAR_MNT_Pos) /*!< 0x00007000 */
#define RTC_ALRMAR_MNT       RTC_ALRMAR_MNT_Msk
#define RTC_ALRMAR_MNT_0     (0x1U << RTC_ALRMAR_MNT_Pos) /*!< 0x00001000 */
#define RTC_ALRMAR_MNT_1     (0x2U << RTC_ALRMAR_MNT_Pos) /*!< 0x00002000 */
#define RTC_ALRMAR_MNT_2     (0x4U << RTC_ALRMAR_MNT_Pos) /*!< 0x00004000 */
#define RTC_ALRMAR_MNU_Pos   (8U)
#define RTC_ALRMAR_MNU_Msk   (0xFU << RTC_ALRMAR_MNU_Pos) /*!< 0x00000F00 */
#define RTC_ALRMAR_MNU       RTC_ALRMAR_MNU_Msk
#define RTC_ALRMAR_MNU_0     (0x1U << RTC_ALRMAR_MNU_Pos) /*!< 0x00000100 */
#define RTC_ALRMAR_MNU_1     (0x2U << RTC_ALRMAR_MNU_Pos) /*!< 0x00000200 */
#define RTC_ALRMAR_MNU_2     (0x4U << RTC_ALRMAR_MNU_Pos) /*!< 0x00000400 */
#define RTC_ALRMAR_MNU_3     (0x8U << RTC_ALRMAR_MNU_Pos) /*!< 0x00000800 */
#define RTC_ALRMAR_MSK1_Pos  (7U)
#define RTC_ALRMAR_MSK1_Msk  (0x1U << RTC_ALRMAR_MSK1_Pos) /*!< 0x00000080 */
#define RTC_ALRMAR_MSK1      RTC_ALRMAR_MSK1_Msk
#define RTC_ALRMAR_ST_Pos    (4U)
#define RTC_ALRMAR_ST_Msk    (0x7U << RTC_ALRMAR_ST_Pos) /*!< 0x00000070 */
#define RTC_ALRMAR_ST        RTC_ALRMAR_ST_Msk
#define RTC_ALRMAR_ST_0      (0x1U << RTC_ALRMAR_ST_Pos) /*!< 0x00000010 */
#define RTC_ALRMAR_ST_1      (0x2U << RTC_ALRMAR_ST_Pos) /*!< 0x00000020 */
#define RTC_ALRMAR_ST_2      (0x4U << RTC_ALRMAR_ST_Pos) /*!< 0x00000040 */
#define RTC_ALRMAR_SU_Pos    (0U)
#define RTC_ALRMAR_SU_Msk    (0xFU << RTC_ALRMAR_SU_Pos) /*!< 0x0000000F */
#define RTC_ALRMAR_SU        RTC_ALRMAR_SU_Msk
#define RTC_ALRMAR_SU_0      (0x1U << RTC_ALRMAR_SU_Pos) /*!< 0x00000001 */
#define RTC_ALRMAR_SU_1      (0x2U << RTC_ALRMAR_SU_Pos) /*!< 0x00000002 */
#define RTC_ALRMAR_SU_2      (0x4U << RTC_ALRMAR_SU_Pos) /*!< 0x00000004 */
#define RTC_ALRMAR_SU_3      (0x8U << RTC_ALRMAR_SU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_WPR register  *****************/
#define RTC_WPR_KEY_Pos (0U)
#define RTC_WPR_KEY_Msk (0xFFU << RTC_WPR_KEY_Pos) /*!< 0x000000FF */
#define RTC_WPR_KEY     RTC_WPR_KEY_Msk

/********************  Bits definition for RTC_SSR register  *****************/
#define RTC_SSR_SS_Pos (0U)
#define RTC_SSR_SS_Msk (0xFFFFU << RTC_SSR_SS_Pos) /*!< 0x0000FFFF */
#define RTC_SSR_SS     RTC_SSR_SS_Msk

