niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/********************  Bits definition for RTC_SHIFTR register  **************/
#define RTC_SHIFTR_SUBFS_Pos (0U)
#define RTC_SHIFTR_SUBFS_Msk \
    (0x7FFFU << RTC_SHIFTR_SUBFS_Pos) /*!< 0x00007FFF */
#define RTC_SHIFTR_SUBFS     RTC_SHIFTR_SUBFS_Msk
#define RTC_SHIFTR_ADD1S_Pos (31U)
#define RTC_SHIFTR_ADD1S_Msk (0x1U << RTC_SHIFTR_ADD1S_Pos) /*!< 0x80000000 */
#define RTC_SHIFTR_ADD1S     RTC_SHIFTR_ADD1S_Msk

/********************  Bits definition for RTC_TSTR register  ****************/
#define RTC_TSTR_PM_Pos  (22U)
#define RTC_TSTR_PM_Msk  (0x1U << RTC_TSTR_PM_Pos) /*!< 0x00400000 */
#define RTC_TSTR_PM      RTC_TSTR_PM_Msk
#define RTC_TSTR_HT_Pos  (20U)
#define RTC_TSTR_HT_Msk  (0x3U << RTC_TSTR_HT_Pos) /*!< 0x00300000 */
#define RTC_TSTR_HT      RTC_TSTR_HT_Msk
#define RTC_TSTR_HT_0    (0x1U << RTC_TSTR_HT_Pos) /*!< 0x00100000 */
#define RTC_TSTR_HT_1    (0x2U << RTC_TSTR_HT_Pos) /*!< 0x00200000 */
#define RTC_TSTR_HU_Pos  (16U)
#define RTC_TSTR_HU_Msk  (0xFU << RTC_TSTR_HU_Pos) /*!< 0x000F0000 */
#define RTC_TSTR_HU      RTC_TSTR_HU_Msk
#define RTC_TSTR_HU_0    (0x1U << RTC_TSTR_HU_Pos) /*!< 0x00010000 */
#define RTC_TSTR_HU_1    (0x2U << RTC_TSTR_HU_Pos) /*!< 0x00020000 */
#define RTC_TSTR_HU_2    (0x4U << RTC_TSTR_HU_Pos) /*!< 0x00040000 */
#define RTC_TSTR_HU_3    (0x8U << RTC_TSTR_HU_Pos) /*!< 0x00080000 */
#define RTC_TSTR_MNT_Pos (12U)
#define RTC_TSTR_MNT_Msk (0x7U << RTC_TSTR_MNT_Pos) /*!< 0x00007000 */
#define RTC_TSTR_MNT     RTC_TSTR_MNT_Msk
#define RTC_TSTR_MNT_0   (0x1U << RTC_TSTR_MNT_Pos) /*!< 0x00001000 */
#define RTC_TSTR_MNT_1   (0x2U << RTC_TSTR_MNT_Pos) /*!< 0x00002000 */
#define RTC_TSTR_MNT_2   (0x4U << RTC_TSTR_MNT_Pos) /*!< 0x00004000 */
#define RTC_TSTR_MNU_Pos (8U)
#define RTC_TSTR_MNU_Msk (0xFU << RTC_TSTR_MNU_Pos) /*!< 0x00000F00 */
#define RTC_TSTR_MNU     RTC_TSTR_MNU_Msk
#define RTC_TSTR_MNU_0   (0x1U << RTC_TSTR_MNU_Pos) /*!< 0x00000100 */
#define RTC_TSTR_MNU_1   (0x2U << RTC_TSTR_MNU_Pos) /*!< 0x00000200 */
#define RTC_TSTR_MNU_2   (0x4U << RTC_TSTR_MNU_Pos) /*!< 0x00000400 */
#define RTC_TSTR_MNU_3   (0x8U << RTC_TSTR_MNU_Pos) /*!< 0x00000800 */
#define RTC_TSTR_ST_Pos  (4U)
#define RTC_TSTR_ST_Msk  (0x7U << RTC_TSTR_ST_Pos) /*!< 0x00000070 */
#define RTC_TSTR_ST      RTC_TSTR_ST_Msk
#define RTC_TSTR_ST_0    (0x1U << RTC_TSTR_ST_Pos) /*!< 0x00000010 */
#define RTC_TSTR_ST_1    (0x2U << RTC_TSTR_ST_Pos) /*!< 0x00000020 */
#define RTC_TSTR_ST_2    (0x4U << RTC_TSTR_ST_Pos) /*!< 0x00000040 */
#define RTC_TSTR_SU_Pos  (0U)
#define RTC_TSTR_SU_Msk  (0xFU << RTC_TSTR_SU_Pos) /*!< 0x0000000F */
#define RTC_TSTR_SU      RTC_TSTR_SU_Msk
#define RTC_TSTR_SU_0    (0x1U << RTC_TSTR_SU_Pos) /*!< 0x00000001 */
#define RTC_TSTR_SU_1    (0x2U << RTC_TSTR_SU_Pos) /*!< 0x00000002 */
#define RTC_TSTR_SU_2    (0x4U << RTC_TSTR_SU_Pos) /*!< 0x00000004 */
#define RTC_TSTR_SU_3    (0x8U << RTC_TSTR_SU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_TSDR register  ****************/
#define RTC_TSDR_WDU_Pos (13U)
#define RTC_TSDR_WDU_Msk (0x7U << RTC_TSDR_WDU_Pos) /*!< 0x0000E000 */
#define RTC_TSDR_WDU     RTC_TSDR_WDU_Msk
#define RTC_TSDR_WDU_0   (0x1U << RTC_TSDR_WDU_Pos) /*!< 0x00002000 */
#define RTC_TSDR_WDU_1   (0x2U << RTC_TSDR_WDU_Pos) /*!< 0x00004000 */
#define RTC_TSDR_WDU_2   (0x4U << RTC_TSDR_WDU_Pos) /*!< 0x00008000 */
#define RTC_TSDR_MT_Pos  (12U)
#define RTC_TSDR_MT_Msk  (0x1U << RTC_TSDR_MT_Pos) /*!< 0x00001000 */
#define RTC_TSDR_MT      RTC_TSDR_MT_Msk
#define RTC_TSDR_MU_Pos  (8U)
#define RTC_TSDR_MU_Msk  (0xFU << RTC_TSDR_MU_Pos) /*!< 0x00000F00 */
#define RTC_TSDR_MU      RTC_TSDR_MU_Msk
#define RTC_TSDR_MU_0    (0x1U << RTC_TSDR_MU_Pos) /*!< 0x00000100 */
#define RTC_TSDR_MU_1    (0x2U << RTC_TSDR_MU_Pos) /*!< 0x00000200 */
#define RTC_TSDR_MU_2    (0x4U << RTC_TSDR_MU_Pos) /*!< 0x00000400 */
#define RTC_TSDR_MU_3    (0x8U << RTC_TSDR_MU_Pos) /*!< 0x00000800 */
#define RTC_TSDR_DT_Pos  (4U)
#define RTC_TSDR_DT_Msk  (0x3U << RTC_TSDR_DT_Pos) /*!< 0x00000030 */
#define RTC_TSDR_DT      RTC_TSDR_DT_Msk
#define RTC_TSDR_DT_0    (0x1U << RTC_TSDR_DT_Pos) /*!< 0x00000010 */
#define RTC_TSDR_DT_1    (0x2U << RTC_TSDR_DT_Pos) /*!< 0x00000020 */
#define RTC_TSDR_DU_Pos  (0U)
#define RTC_TSDR_DU_Msk  (0xFU << RTC_TSDR_DU_Pos) /*!< 0x0000000F */
#define RTC_TSDR_DU      RTC_TSDR_DU_Msk
#define RTC_TSDR_DU_0    (0x1U << RTC_TSDR_DU_Pos) /*!< 0x00000001 */
#define RTC_TSDR_DU_1    (0x2U << RTC_TSDR_DU_Pos) /*!< 0x00000002 */
#define RTC_TSDR_DU_2    (0x4U << RTC_TSDR_DU_Pos) /*!< 0x00000004 */
#define RTC_TSDR_DU_3    (0x8U << RTC_TSDR_DU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_TSSSR register  ***************/
#define RTC_TSSSR_SS_Pos (0U)
#define RTC_TSSSR_SS_Msk (0xFFFFU << RTC_TSSSR_SS_Pos) /*!< 0x0000FFFF */
#define RTC_TSSSR_SS     RTC_TSSSR_SS_Msk

/********************  Bits definition for RTC_CALR register  ****************/
#define RTC_CALR_CALP_Pos   (15U)
#define RTC_CALR_CALP_Msk   (0x1U << RTC_CALR_CALP_Pos) /*!< 0x00008000 */
#define RTC_CALR_CALP       RTC_CALR_CALP_Msk
#define RTC_CALR_CALW8_Pos  (14U)
#define RTC_CALR_CALW8_Msk  (0x1U << RTC_CALR_CALW8_Pos) /*!< 0x00004000 */
#define RTC_CALR_CALW8      RTC_CALR_CALW8_Msk
#define RTC_CALR_CALW16_Pos (13U)
#define RTC_CALR_CALW16_Msk (0x1U << RTC_CALR_CALW16_Pos) /*!< 0x00002000 */
#define RTC_CALR_CALW16     RTC_CALR_CALW16_Msk
#define RTC_CALR_CALM_Pos   (0U)
#define RTC_CALR_CALM_Msk   (0x1FFU << RTC_CALR_CALM_Pos) /*!< 0x000001FF */
#define RTC_CALR_CALM       RTC_CALR_CALM_Msk
#define RTC_CALR_CALM_0     (0x001U << RTC_CALR_CALM_Pos) /*!< 0x00000001 */
#define RTC_CALR_CALM_1     (0x002U << RTC_CALR_CALM_Pos) /*!< 0x00000002 */
#define RTC_CALR_CALM_2     (0x004U << RTC_CALR_CALM_Pos) /*!< 0x00000004 */
#define RTC_CALR_CALM_3     (0x008U << RTC_CALR_CALM_Pos) /*!< 0x00000008 */
#define RTC_CALR_CALM_4     (0x010U << RTC_CALR_CALM_Pos) /*!< 0x00000010 */
#define RTC_CALR_CALM_5     (0x020U << RTC_CALR_CALM_Pos) /*!< 0x00000020 */
#define RTC_CALR_CALM_6     (0x040U << RTC_CALR_CALM_Pos) /*!< 0x00000040 */
#define RTC_CALR_CALM_7     (0x080U << RTC_CALR_CALM_Pos) /*!< 0x00000080 */
#define RTC_CALR_CALM_8     (0x100U << RTC_CALR_CALM_Pos) /*!< 0x00000100 */

/********************  Bits definition for RTC_TAFCR register  ***************/
#define RTC_TAFCR_PC15MODE_Pos (23U)
#define RTC_TAFCR_PC15MODE_Msk \
    (0x1U << RTC_TAFCR_PC15MODE_Pos) /*!< 0x00800000 */
#define RTC_TAFCR_PC15MODE      RTC_TAFCR_PC15MODE_Msk
#define RTC_TAFCR_PC15VALUE_Pos (22U)
#define RTC_TAFCR_PC15VALUE_Msk \
    (0x1U << RTC_TAFCR_PC15VALUE_Pos) /*!< 0x00400000 */
#define RTC_TAFCR_PC15VALUE    RTC_TAFCR_PC15VALUE_Msk
#define RTC_TAFCR_PC14MODE_Pos (21U)
#define RTC_TAFCR_PC14MODE_Msk \
    (0x1U << RTC_TAFCR_PC14MODE_Pos) /*!< 0x00200000 */
#define RTC_TAFCR_PC14MODE      RTC_TAFCR_PC14MODE_Msk
#define RTC_TAFCR_PC14VALUE_Pos (20U)
#define RTC_TAFCR_PC14VALUE_Msk \
    (0x1U << RTC_TAFCR_PC14VALUE_Pos) /*!< 0x00100000 */
#define RTC_TAFCR_PC14VALUE    RTC_TAFCR_PC14VALUE_Msk
#define RTC_TAFCR_PC13MODE_Pos (19U)
#define RTC_TAFCR_PC13MODE_Msk \
    (0x1U << RTC_TAFCR_PC13MODE_Pos) /*!< 0x00080000 */
#define RTC_TAFCR_PC13MODE      RTC_TAFCR_PC13MODE_Msk
#define RTC_TAFCR_PC13VALUE_Pos (18U)
#define RTC_TAFCR_PC13VALUE_Msk \
    (0x1U << RTC_TAFCR_PC13VALUE_Pos) /*!< 0x00040000 */
#define RTC_TAFCR_PC13VALUE     RTC_TAFCR_PC13VALUE_Msk
#define RTC_TAFCR_TAMPPUDIS_Pos (15U)
#define RTC_TAFCR_TAMPPUDIS_Msk \
    (0x1U << RTC_TAFCR_TAMPPUDIS_Pos) /*!< 0x00008000 */
#define RTC_TAFCR_TAMPPUDIS    RTC_TAFCR_TAMPPUDIS_Msk
#define RTC_TAFCR_TAMPPRCH_Pos (13U)
#define RTC_TAFCR_TAMPPRCH_Msk \
    (0x3U << RTC_TAFCR_TAMPPRCH_Pos) /*!< 0x00006000 */
#define RTC_TAFCR_TAMPPRCH RTC_TAFCR_TAMPPRCH_Msk
#define RTC_TAFCR_TAMPPRCH_0                         \
    (0x1U << RTC_TAFCR_TAMPPRCH_Pos) /*!< 0x00002000 \
                                      */
#define RTC_TAFCR_TAMPPRCH_1                         \
    (0x2U << RTC_TAFCR_TAMPPRCH_Pos) /*!< 0x00004000 \
                                      */
#define RTC_TAFCR_TAMPFLT_Pos (11U)
#define RTC_TAFCR_TAMPFLT_Msk                       \
    (0x3U << RTC_TAFCR_TAMPFLT_Pos) /*!< 0x00001800 \
                                     */
#define RTC_TAFCR_TAMPFLT      RTC_TAFCR_TAMPFLT_Msk
#define RTC_TAFCR_TAMPFLT_0    (0x1U << RTC_TAFCR_TAMPFLT_Pos) /*!< 0x00000800 */
#define RTC_TAFCR_TAMPFLT_1    (0x2U << RTC_TAFCR_TAMPFLT_Pos) /*!< 0x00001000 */
#define RTC_TAFCR_TAMPFREQ_Pos (8U)
#define RTC_TAFCR_TAMPFREQ_Msk \
    (0x7U << RTC_TAFCR_TAMPFREQ_Pos) /*!< 0x00000700 */
#define RTC_TAFCR_TAMPFREQ RTC_TAFCR_TAMPFREQ_Msk
#define RTC_TAFCR_TAMPFREQ_0                         \
    (0x1U << RTC_TAFCR_TAMPFREQ_Pos) /*!< 0x00000100 \
                                      */
#define RTC_TAFCR_TAMPFREQ_1                         \
    (0x2U << RTC_TAFCR_TAMPFREQ_Pos) /*!< 0x00000200 \
                                      */
#define RTC_TAFCR_TAMPFREQ_2                         \
    (0x4U << RTC_TAFCR_TAMPFREQ_Pos) /*!< 0x00000400 \
                                      */
#define RTC_TAFCR_TAMPTS_Pos   (7U)
#define RTC_TAFCR_TAMPTS_Msk   (0x1U << RTC_TAFCR_TAMPTS_Pos) /*!< 0x00000080 */
#define RTC_TAFCR_TAMPTS       RTC_TAFCR_TAMPTS_Msk
#define RTC_TAFCR_TAMP2TRG_Pos (4U)
#define RTC_TAFCR_TAMP2TRG_Msk \
    (0x1U << RTC_TAFCR_TAMP2TRG_Pos) /*!< 0x00000010 */
#define RTC_TAFCR_TAMP2TRG     RTC_TAFCR_TAMP2TRG_Msk
#define RTC_TAFCR_TAMP2E_Pos   (3U)
#define RTC_TAFCR_TAMP2E_Msk   (0x1U << RTC_TAFCR_TAMP2E_Pos) /*!< 0x00000008 */
#define RTC_TAFCR_TAMP2E       RTC_TAFCR_TAMP2E_Msk
#define RTC_TAFCR_TAMPIE_Pos   (2U)
#define RTC_TAFCR_TAMPIE_Msk   (0x1U << RTC_TAFCR_TAMPIE_Pos) /*!< 0x00000004 */
#define RTC_TAFCR_TAMPIE       RTC_TAFCR_TAMPIE_Msk
#define RTC_TAFCR_TAMP1TRG_Pos (1U)
#define RTC_TAFCR_TAMP1TRG_Msk \
    (0x1U << RTC_TAFCR_TAMP1TRG_Pos) /*!< 0x00000002 */
#define RTC_TAFCR_TAMP1TRG   RTC_TAFCR_TAMP1TRG_Msk
#define RTC_TAFCR_TAMP1E_Pos (0U)
#define RTC_TAFCR_TAMP1E_Msk (0x1U << RTC_TAFCR_TAMP1E_Pos) /*!< 0x00000001 */
#define RTC_TAFCR_TAMP1E     RTC_TAFCR_TAMP1E_Msk

/* Reference defines */
#define RTC_TAFCR_ALARMOUTTYPE RTC_TAFCR_PC13VALUE

