niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************  Bit definition for USART_CR2 register  *******************/
#define USART_CR2_ADDM7_Pos (4U)
#define USART_CR2_ADDM7_Msk (0x1U << USART_CR2_ADDM7_Pos) /*!< 0x00000010 */
#define USART_CR2_ADDM7 \
    USART_CR2_ADDM7_Msk /*!< 7-bit or 4-bit Address Detection */
#define USART_CR2_LBCL_Pos  (8U)
#define USART_CR2_LBCL_Msk  (0x1U << USART_CR2_LBCL_Pos) /*!< 0x00000100 */
#define USART_CR2_LBCL      USART_CR2_LBCL_Msk /*!< Last Bit Clock pulse */
#define USART_CR2_CPHA_Pos  (9U)
#define USART_CR2_CPHA_Msk  (0x1U << USART_CR2_CPHA_Pos) /*!< 0x00000200 */
#define USART_CR2_CPHA      USART_CR2_CPHA_Msk           /*!< Clock Phase */
#define USART_CR2_CPOL_Pos  (10U)
#define USART_CR2_CPOL_Msk  (0x1U << USART_CR2_CPOL_Pos) /*!< 0x00000400 */
#define USART_CR2_CPOL      USART_CR2_CPOL_Msk           /*!< Clock Polarity */
#define USART_CR2_CLKEN_Pos (11U)
#define USART_CR2_CLKEN_Msk (0x1U << USART_CR2_CLKEN_Pos) /*!< 0x00000800 */
#define USART_CR2_CLKEN     USART_CR2_CLKEN_Msk           /*!< Clock Enable */
#define USART_CR2_STOP_Pos  (12U)
#define USART_CR2_STOP_Msk  (0x3U << USART_CR2_STOP_Pos) /*!< 0x00003000 */
#define USART_CR2_STOP      USART_CR2_STOP_Msk /*!< STOP[1:0] bits (STOP bits) */
#define USART_CR2_STOP_0    (0x1U << USART_CR2_STOP_Pos) /*!< 0x00001000 */
#define USART_CR2_STOP_1    (0x2U << USART_CR2_STOP_Pos) /*!< 0x00002000 */
#define USART_CR2_SWAP_Pos  (15U)
#define USART_CR2_SWAP_Msk  (0x1U << USART_CR2_SWAP_Pos) /*!< 0x00008000 */
#define USART_CR2_SWAP      USART_CR2_SWAP_Msk           /*!< SWAP TX/RX pins */
#define USART_CR2_RXINV_Pos (16U)
#define USART_CR2_RXINV_Msk (0x1U << USART_CR2_RXINV_Pos) /*!< 0x00010000 */
#define USART_CR2_RXINV \
    USART_CR2_RXINV_Msk /*!< RX pin active level inversion */
#define USART_CR2_TXINV_Pos (17U)
#define USART_CR2_TXINV_Msk (0x1U << USART_CR2_TXINV_Pos) /*!< 0x00020000 */
#define USART_CR2_TXINV \
    USART_CR2_TXINV_Msk /*!< TX pin active level inversion */
#define USART_CR2_DATAINV_Pos (18U)
#define USART_CR2_DATAINV_Msk                                        \
    (0x1U << USART_CR2_DATAINV_Pos)                  /*!< 0x00040000 \
                                                      */
#define USART_CR2_DATAINV      USART_CR2_DATAINV_Msk /*!< Binary data inversion */
#define USART_CR2_MSBFIRST_Pos (19U)
#define USART_CR2_MSBFIRST_Msk \
    (0x1U << USART_CR2_MSBFIRST_Pos) /*!< 0x00080000 */
#define USART_CR2_MSBFIRST \
    USART_CR2_MSBFIRST_Msk /*!< Most Significant Bit First */
#define USART_CR2_ABREN_Pos   (20U)
#define USART_CR2_ABREN_Msk   (0x1U << USART_CR2_ABREN_Pos) /*!< 0x00100000 */
#define USART_CR2_ABREN       USART_CR2_ABREN_Msk /*!< Auto Baud-Rate Enable*/
#define USART_CR2_ABRMODE_Pos (21U)
#define USART_CR2_ABRMODE_Msk                       \
    (0x3U << USART_CR2_ABRMODE_Pos) /*!< 0x00600000 \
                                     */
#define USART_CR2_ABRMODE \
    USART_CR2_ABRMODE_Msk /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
#define USART_CR2_ABRMODE_0 (0x1U << USART_CR2_ABRMODE_Pos) /*!< 0x00200000 */
#define USART_CR2_ABRMODE_1 (0x2U << USART_CR2_ABRMODE_Pos) /*!< 0x00400000 */
#define USART_CR2_RTOEN_Pos (23U)
#define USART_CR2_RTOEN_Msk (0x1U << USART_CR2_RTOEN_Pos) /*!< 0x00800000 */
#define USART_CR2_RTOEN     USART_CR2_RTOEN_Msk /*!< Receiver Time-Out enable */
#define USART_CR2_ADD_Pos   (24U)
#define USART_CR2_ADD_Msk   (0xFFU << USART_CR2_ADD_Pos) /*!< 0xFF000000 */
#define USART_CR2_ADD       USART_CR2_ADD_Msk /*!< Address of the USART node */

/******************  Bit definition for USART_CR3 register  *******************/
#define USART_CR3_EIE_Pos    (0U)
#define USART_CR3_EIE_Msk    (0x1U << USART_CR3_EIE_Pos) /*!< 0x00000001 */
#define USART_CR3_EIE        USART_CR3_EIE_Msk /*!< Error Interrupt Enable */
#define USART_CR3_HDSEL_Pos  (3U)
#define USART_CR3_HDSEL_Msk  (0x1U << USART_CR3_HDSEL_Pos) /*!< 0x00000008 */
#define USART_CR3_HDSEL      USART_CR3_HDSEL_Msk /*!< Half-Duplex Selection */
#define USART_CR3_DMAR_Pos   (6U)
#define USART_CR3_DMAR_Msk   (0x1U << USART_CR3_DMAR_Pos) /*!< 0x00000040 */
#define USART_CR3_DMAR       USART_CR3_DMAR_Msk /*!< DMA Enable Receiver */
#define USART_CR3_DMAT_Pos   (7U)
#define USART_CR3_DMAT_Msk   (0x1U << USART_CR3_DMAT_Pos) /*!< 0x00000080 */
#define USART_CR3_DMAT       USART_CR3_DMAT_Msk /*!< DMA Enable Transmitter */
#define USART_CR3_RTSE_Pos   (8U)
#define USART_CR3_RTSE_Msk   (0x1U << USART_CR3_RTSE_Pos) /*!< 0x00000100 */
#define USART_CR3_RTSE       USART_CR3_RTSE_Msk           /*!< RTS Enable */
#define USART_CR3_CTSE_Pos   (9U)
#define USART_CR3_CTSE_Msk   (0x1U << USART_CR3_CTSE_Pos) /*!< 0x00000200 */
#define USART_CR3_CTSE       USART_CR3_CTSE_Msk           /*!< CTS Enable */
#define USART_CR3_CTSIE_Pos  (10U)
#define USART_CR3_CTSIE_Msk  (0x1U << USART_CR3_CTSIE_Pos) /*!< 0x00000400 */
#define USART_CR3_CTSIE      USART_CR3_CTSIE_Msk /*!< CTS Interrupt Enable */
#define USART_CR3_ONEBIT_Pos (11U)
#define USART_CR3_ONEBIT_Msk (0x1U << USART_CR3_ONEBIT_Pos) /*!< 0x00000800 */
#define USART_CR3_ONEBIT \
    USART_CR3_ONEBIT_Msk /*!< One sample bit method enable */
#define USART_CR3_OVRDIS_Pos (12U)
#define USART_CR3_OVRDIS_Msk (0x1U << USART_CR3_OVRDIS_Pos) /*!< 0x00001000 */
#define USART_CR3_OVRDIS     USART_CR3_OVRDIS_Msk /*!< Overrun Disable */
#define USART_CR3_DDRE_Pos   (13U)
#define USART_CR3_DDRE_Msk   (0x1U << USART_CR3_DDRE_Pos) /*!< 0x00002000 */
#define USART_CR3_DDRE                                     \
    USART_CR3_DDRE_Msk /*!< DMA Disable on Reception Error \
                        */
#define USART_CR3_DEM_Pos (14U)
#define USART_CR3_DEM_Msk (0x1U << USART_CR3_DEM_Pos) /*!< 0x00004000 */
#define USART_CR3_DEM     USART_CR3_DEM_Msk           /*!< Driver Enable Mode */
#define USART_CR3_DEP_Pos (15U)
#define USART_CR3_DEP_Msk (0x1U << USART_CR3_DEP_Pos) /*!< 0x00008000 */
#define USART_CR3_DEP                                       \
    USART_CR3_DEP_Msk /*!< Driver Enable Polarity Selection \
                       */

