niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************  Bit definition for USART_BRR register  *******************/
#define USART_BRR_DIV_FRACTION_Pos (0U)
#define USART_BRR_DIV_FRACTION_Msk \
    (0xFU << USART_BRR_DIV_FRACTION_Pos) /*!< 0x0000000F */
#define USART_BRR_DIV_FRACTION \
    USART_BRR_DIV_FRACTION_Msk /*!< Fraction of USARTDIV */
#define USART_BRR_DIV_MANTISSA_Pos (4U)
#define USART_BRR_DIV_MANTISSA_Msk \
    (0xFFFU << USART_BRR_DIV_MANTISSA_Pos) /*!< 0x0000FFF0 */
#define USART_BRR_DIV_MANTISSA \
    USART_BRR_DIV_MANTISSA_Msk /*!< Mantissa of USARTDIV */

/******************  Bit definition for USART_GTPR register  ******************/
#define USART_GTPR_PSC_Pos (0U)
#define USART_GTPR_PSC_Msk (0xFFU << USART_GTPR_PSC_Pos) /*!< 0x000000FF */
#define USART_GTPR_PSC \
    USART_GTPR_PSC_Msk /*!< PSC[7:0] bits (Prescaler value) */
#define USART_GTPR_GT_Pos (8U)
#define USART_GTPR_GT_Msk (0xFFU << USART_GTPR_GT_Pos) /*!< 0x0000FF00 */
#define USART_GTPR_GT                                      \
    USART_GTPR_GT_Msk /*!< GT[7:0] bits (Guard time value) \
                       */

/*******************  Bit definition for USART_RTOR register  *****************/
#define USART_RTOR_RTO_Pos (0U)
#define USART_RTOR_RTO_Msk                                     \
    (0xFFFFFFU << USART_RTOR_RTO_Pos)          /*!< 0x00FFFFFF \
                                                */
#define USART_RTOR_RTO      USART_RTOR_RTO_Msk /*!< Receiver Time Out Value */
#define USART_RTOR_BLEN_Pos (24U)
#define USART_RTOR_BLEN_Msk (0xFFU << USART_RTOR_BLEN_Pos) /*!< 0xFF000000 */
#define USART_RTOR_BLEN     USART_RTOR_BLEN_Msk            /*!< Block Length */

/*******************  Bit definition for USART_RQR register  ******************/
#define USART_RQR_ABRRQ_Pos (0U)
#define USART_RQR_ABRRQ_Msk (0x1U << USART_RQR_ABRRQ_Pos) /*!< 0x00000001 */
#define USART_RQR_ABRRQ     USART_RQR_ABRRQ_Msk /*!< Auto-Baud Rate Request */
#define USART_RQR_SBKRQ_Pos (1U)
#define USART_RQR_SBKRQ_Msk (0x1U << USART_RQR_SBKRQ_Pos) /*!< 0x00000002 */
#define USART_RQR_SBKRQ     USART_RQR_SBKRQ_Msk /*!< Send Break Request */
#define USART_RQR_MMRQ_Pos  (2U)
#define USART_RQR_MMRQ_Msk  (0x1U << USART_RQR_MMRQ_Pos) /*!< 0x00000004 */
#define USART_RQR_MMRQ      USART_RQR_MMRQ_Msk /*!< Mute Mode Request */
#define USART_RQR_RXFRQ_Pos (3U)
#define USART_RQR_RXFRQ_Msk (0x1U << USART_RQR_RXFRQ_Pos) /*!< 0x00000008 */
#define USART_RQR_RXFRQ     USART_RQR_RXFRQ_Msk /*!< Receive Data flush Request */

/*******************  Bit definition for USART_ISR register  ******************/
#define USART_ISR_PE_Pos    (0U)
#define USART_ISR_PE_Msk    (0x1U << USART_ISR_PE_Pos) /*!< 0x00000001 */
#define USART_ISR_PE        USART_ISR_PE_Msk           /*!< Parity Error */
#define USART_ISR_FE_Pos    (1U)
#define USART_ISR_FE_Msk    (0x1U << USART_ISR_FE_Pos) /*!< 0x00000002 */
#define USART_ISR_FE        USART_ISR_FE_Msk           /*!< Framing Error */
#define USART_ISR_NE_Pos    (2U)
#define USART_ISR_NE_Msk    (0x1U << USART_ISR_NE_Pos) /*!< 0x00000004 */
#define USART_ISR_NE        USART_ISR_NE_Msk /*!< Noise detected Flag */
#define USART_ISR_ORE_Pos   (3U)
#define USART_ISR_ORE_Msk   (0x1U << USART_ISR_ORE_Pos) /*!< 0x00000008 */
#define USART_ISR_ORE       USART_ISR_ORE_Msk           /*!< OverRun Error */
#define USART_ISR_IDLE_Pos  (4U)
#define USART_ISR_IDLE_Msk  (0x1U << USART_ISR_IDLE_Pos) /*!< 0x00000010 */
#define USART_ISR_IDLE      USART_ISR_IDLE_Msk /*!< IDLE line detected */
#define USART_ISR_RXNE_Pos  (5U)
#define USART_ISR_RXNE_Msk  (0x1U << USART_ISR_RXNE_Pos) /*!< 0x00000020 */
#define USART_ISR_RXNE      USART_ISR_RXNE_Msk /*!< Read Data Register Not Empty */
#define USART_ISR_TC_Pos    (6U)
#define USART_ISR_TC_Msk    (0x1U << USART_ISR_TC_Pos) /*!< 0x00000040 */
#define USART_ISR_TC        USART_ISR_TC_Msk /*!< Transmission Complete */
#define USART_ISR_TXE_Pos   (7U)
#define USART_ISR_TXE_Msk   (0x1U << USART_ISR_TXE_Pos) /*!< 0x00000080 */
#define USART_ISR_TXE       USART_ISR_TXE_Msk /*!< Transmit Data Register Empty */
#define USART_ISR_CTSIF_Pos (9U)
#define USART_ISR_CTSIF_Msk (0x1U << USART_ISR_CTSIF_Pos) /*!< 0x00000200 */
#define USART_ISR_CTSIF     USART_ISR_CTSIF_Msk /*!< CTS interrupt flag */
#define USART_ISR_CTS_Pos   (10U)
#define USART_ISR_CTS_Msk   (0x1U << USART_ISR_CTS_Pos) /*!< 0x00000400 */
#define USART_ISR_CTS       USART_ISR_CTS_Msk           /*!< CTS flag */
#define USART_ISR_RTOF_Pos  (11U)
#define USART_ISR_RTOF_Msk  (0x1U << USART_ISR_RTOF_Pos) /*!< 0x00000800 */
#define USART_ISR_RTOF      USART_ISR_RTOF_Msk /*!< Receiver Time Out */
#define USART_ISR_ABRE_Pos  (14U)
#define USART_ISR_ABRE_Msk  (0x1U << USART_ISR_ABRE_Pos) /*!< 0x00004000 */
#define USART_ISR_ABRE      USART_ISR_ABRE_Msk /*!< Auto-Baud Rate Error */
#define USART_ISR_ABRF_Pos  (15U)
#define USART_ISR_ABRF_Msk  (0x1U << USART_ISR_ABRF_Pos) /*!< 0x00008000 */
#define USART_ISR_ABRF      USART_ISR_ABRF_Msk /*!< Auto-Baud Rate Flag */
#define USART_ISR_BUSY_Pos  (16U)
#define USART_ISR_BUSY_Msk  (0x1U << USART_ISR_BUSY_Pos) /*!< 0x00010000 */
#define USART_ISR_BUSY      USART_ISR_BUSY_Msk           /*!< Busy Flag */
#define USART_ISR_CMF_Pos   (17U)
#define USART_ISR_CMF_Msk   (0x1U << USART_ISR_CMF_Pos) /*!< 0x00020000 */
#define USART_ISR_CMF       USART_ISR_CMF_Msk /*!< Character Match Flag */
#define USART_ISR_SBKF_Pos  (18U)
#define USART_ISR_SBKF_Msk  (0x1U << USART_ISR_SBKF_Pos) /*!< 0x00040000 */
#define USART_ISR_SBKF      USART_ISR_SBKF_Msk           /*!< Send Break Flag */
#define USART_ISR_RWU_Pos   (19U)
#define USART_ISR_RWU_Msk   (0x1U << USART_ISR_RWU_Pos) /*!< 0x00080000 */
#define USART_ISR_RWU \
    USART_ISR_RWU_Msk /*!< Receive Wake Up from mute mode Flag */
#define USART_ISR_TEACK_Pos (21U)
#define USART_ISR_TEACK_Msk (0x1U << USART_ISR_TEACK_Pos) /*!< 0x00200000 */
#define USART_ISR_TEACK \
    USART_ISR_TEACK_Msk /*!< Transmit Enable Acknowledge Flag */
#define USART_ISR_REACK_Pos (22U)
#define USART_ISR_REACK_Msk (0x1U << USART_ISR_REACK_Pos) /*!< 0x00400000 */
#define USART_ISR_REACK \
    USART_ISR_REACK_Msk /*!< Receive Enable Acknowledge Flag */

