niaraki/keyfob_firmware/tests/fake/hll/include/stm32f030x6_override.h
/******************************* DMA Instances ********************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE)                                  \
    (((INSTANCE) == DMA1_Channel1) || ((INSTANCE) == DMA1_Channel2)    \
     || ((INSTANCE) == DMA1_Channel3) || ((INSTANCE) == DMA1_Channel4) \
     || ((INSTANCE) == DMA1_Channel5))

/****************************** GPIO Instances ********************************/
#define IS_GPIO_ALL_INSTANCE(INSTANCE)                                       \
    (((INSTANCE) == GPIOA) || ((INSTANCE) == GPIOB) || ((INSTANCE) == GPIOC) \
     || ((INSTANCE) == GPIOD) || ((INSTANCE) == GPIOF))

/**************************** GPIO Alternate Function Instances ***************/
#define IS_GPIO_AF_INSTANCE(INSTANCE) \
    (((INSTANCE) == GPIOA) || ((INSTANCE) == GPIOB))

/****************************** GPIO Lock Instances ***************************/
#define IS_GPIO_LOCK_INSTANCE(INSTANCE) \
    (((INSTANCE) == GPIOA) || ((INSTANCE) == GPIOB))

/****************************** I2C Instances *********************************/
#define IS_I2C_ALL_INSTANCE(INSTANCE) ((INSTANCE) == I2C1)

/****************************** IWDG Instances ********************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE) ((INSTANCE) == IWDG)

/****************************** RTC Instances *********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == RTC)

/****************************** SMBUS Instances
 * *********************************/
#define IS_SMBUS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == I2C1)

/****************************** SPI Instances *********************************/
#define IS_SPI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == SPI1)

/****************************** TIM Instances *********************************/
#define IS_TIM_INSTANCE(INSTANCE)                                          \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM14) \
     || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_CC1_INSTANCE(INSTANCE)                                      \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM14) \
     || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_CC2_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CC3_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CC4_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CLOCKSOURCE_TIX_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_ENCODER_INTERFACE_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_HALL_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1))

#define IS_TIM_HALL_SENSOR_INTERFACE_INSTANCE(INSTANCE) (((INSTANCE) == TIM1))

#define IS_TIM_XOR_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_MASTER_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_SLAVE_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (0)

#define IS_TIM_DMABURST_INSTANCE(INSTANCE)                                 \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM16) \
     || ((INSTANCE) == TIM17))

#define IS_TIM_BREAK_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_CCX_INSTANCE(INSTANCE, CHANNEL)                                 \
    ((((INSTANCE) == TIM1)                                                     \
      && (((CHANNEL) == TIM_CHANNEL_1) || ((CHANNEL) == TIM_CHANNEL_2)         \
          || ((CHANNEL) == TIM_CHANNEL_3) || ((CHANNEL) == TIM_CHANNEL_4)))    \
     || (((INSTANCE) == TIM3)                                                  \
         && (((CHANNEL) == TIM_CHANNEL_1) || ((CHANNEL) == TIM_CHANNEL_2)      \
             || ((CHANNEL) == TIM_CHANNEL_3) || ((CHANNEL) == TIM_CHANNEL_4))) \
     || (((INSTANCE) == TIM14) && (((CHANNEL) == TIM_CHANNEL_1)))              \
     || (((INSTANCE) == TIM16) && (((CHANNEL) == TIM_CHANNEL_1)))              \
     || (((INSTANCE) == TIM17) && (((CHANNEL) == TIM_CHANNEL_1))))

#define IS_TIM_CCXN_INSTANCE(INSTANCE, CHANNEL)                        \
    ((((INSTANCE) == TIM1)                                             \
      && (((CHANNEL) == TIM_CHANNEL_1) || ((CHANNEL) == TIM_CHANNEL_2) \
          || ((CHANNEL) == TIM_CHANNEL_3)))                            \
     || (((INSTANCE) == TIM16) && ((CHANNEL) == TIM_CHANNEL_1))        \
     || (((INSTANCE) == TIM17) && ((CHANNEL) == TIM_CHANNEL_1)))

#define IS_TIM_COUNTER_MODE_SELECT_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3))

#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_CLOCK_DIVISION_INSTANCE(INSTANCE)                           \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM14) \
     || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_DMA_INSTANCE(INSTANCE)                                      \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM16) \
     || ((INSTANCE) == TIM17))

#define IS_TIM_DMA_CC_INSTANCE(INSTANCE)                                   \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM3) || ((INSTANCE) == TIM16) \
     || ((INSTANCE) == TIM17))

#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) \
    (((INSTANCE) == TIM1) || ((INSTANCE) == TIM16) || ((INSTANCE) == TIM17))

#define IS_TIM_REMAP_INSTANCE(INSTANCE) ((INSTANCE) == TIM14)

